{
  "Review": [

    "I liked the low calories, low net carbs, the seeds and the taste.  Does not taste like cardboard and 7 grams of fiber is outstanding.  I only gave it 4 stars for value for the money because $9 is a lot to spend for bread but that's what the cost is and if you want the bread you pay.  I don't think they are out of line with other low carb products though.  Try it...you will love it.",

    "this bread is wonderful! as advertised it is sweet and buttery. It toasts well and does not have an odor or aftertaste like keto breads I have tried from the grocery store. Its only 1 carb per slice and is even good for people who are not following a keto diet but just want to cut down on carbs.  My only complaint is the cost.",

    "It definitely tasted funny. I will not buy it again.",

    "Tastes great and ingredients are not bad",

    "Love the buttery flavor and it’s freshness. I’m ready to make another order. This time a bigger order! 🤗",

    "Flavor is actually really good.",

    "Got the bread today March 27th/23 so had to try the bread right away, I think I have a new bread in my life. Love a bite of toast with my coffee in the morning and this cuts down on the carbs and sugar. Thanks",

    "This not the sweet oat bread I have always bought, this new stuff is terrible, last one of these I will buy. Will try Hero Seeded bread .",

    "LO CARB AND LO Calorie Buttery delicious Yum",

    "Great Product I Love it",

    "Oat bread is not exactly like white wheat bread, but it is yummy bread. Sola's wheat is most likely to fool someone into thinking it is normal bread, but I find the oat variety more yummy.",

    "This is bread. I don't know what else to say. My odyssey for the best Keto bread is over! Great texture, great flavor (not eggy, AT ALL) There's a bit of an aftertaste to the crust but on my 2nd 3rd and 4th piece I didn't notice it. I am so happy right now :)",

    "It’s a little pricey but the bread arrived very fresh and it was really good.",

    "Tastes delicious",

    "Love this low carb bread!",

    "Of all the low-carb \"bread\" out there, this is the most like real bread.\nThe real bread it mimics (perfectly!) is low end long shelf life whole grain wheat. It's good for making me feel like I am eating bread when I am at the end of my tolerance for vegetables and liquid meal substitutes. But it's bitter and dry.",

    "The best",

    "I loved Sola bread, every variety, but the \"new look\" is NOT the same bread! The recipe has changed, and so has the taste and quality -- unfortunately for the worse. (See label, many changes, including main ingredient and net carbs.) Now, when toasted, the bread shrinks significantly and gets VERY dry and too crisp. When eaten it turns into a chewy paste in your mouth. I am very sad to report it is no longer good!",

    "iTS PRICEY, BUT TASTES LIKE BREAD, NOT FAKE BREAD, NOT IMITATION BREAD...IT JUST TASTES LIKE REAL GOOD GROCERY STORE BREAD .  THAT IS HUGE AS I TRY TO MAKE FUNDAMENTAL CHANGES TO MY DIET.",

    "This bread was horrible! You shouldn’t be selling it to any one!",

    "This is the first time I actively enjoy a keto-friendly sliced bread product, and it's not particularly close. I can actually enjoy these even untoasted or by themselves as a snack, although that'd be a mistake since they go so well with scrambled eggs and/or avocado. Simply delicious.",

    "Great price",

    "I found this at Costco originally and my girlfriend convinced me to try it. I was very surprised! The taste is very good, not acidly as some carb breads are. It’s great toasted and fresh, both good for sandwiches. The slice size is smaller than normal but still adequate. The company also offers French toast loaf and blueberry loaf on their website however these have been listed as sold out for quite some time. The company has failed to respond to queries about when those would be available. Overall very good but pricey.",

    "I have tried various brands of Keto friendly bread and this one by far is the best. Unfortunately the slices are very small, so I have to resist the urge to eat more. The price here on Amazon is over the top. I have been very successful at my local NC Walmart-$5.64 per loaf. Still not cheap, but your grilled cheese sandwiches will be delicious.",

    "Much better than other low carb breads, because they don't load it up with fiber that'll have your stomach bloating all day. Works good with burgers and everything else. Only complain is the price, but I will be buying again",

    "Very meh overall. Tasted more like cardboard than bread. Other low carb breads are better.",

    "At $8+ per loaf, the actual bread slices are on the small side. I keep the loaf in the freezer and remove one or two slices as needed. The slices are easily removed and are not frozen together. If you are looking for a low cal/low carb bread, Sola bread will do the job. I find it does not have a lot of flavor, but is good for toast or a small sandwich.",

    "I did a taste test of the top five keto breads and this one by far is the best. All my coworkers agree as I’ve taken into work and had them try it and many are now purchasing this product",

    "This is the closest bread that I have found that tastes like regular bread.  I don't think anything can match to real bread.",

    "Packages were open and moldy",

    "This product is a total rip-off, I do not recommend this. I'm not sure how it got so a high rating... The product was late, I ordered on 02/10, and delivered on 02/21. I requested them on 02/15 (as they promised) to cancel the order, but the seller did not pay damn attention...",

    "Bought the sweet and buttery loaves. These were beyond my expectations due to disappointments with other products. They arrived fresh, soft, and tasted like a thin sliced bakery bought oatmeal bread. So good as toast and as a sandwich. Highly recommended.",

    "This is one of the best low-carb breads we have tried (and we've tried many.) In addition to it having great flavor, it's real-life slices of bread and not the \"diet\" slices you get with many loaves of low-carb bread. It's a little pricey, but all the low-carb breads are, so if you want to go this route, you'll want a bread that delivers on taste, and this one does.",

    "This is the best low carb bread out there\nFresh . Buttery delicious and just plain good",

    "Unlike almost every other Keto product I’ve tried, this is a winner. It actually tastes like a regular loaf of bread that you would choose to buy because it tastes good. Amazing. Keep it in the refrigerator and it lasts for a couple of weeks. Makes great sandwiches, toast, toasted cheese sandwiches, French toast, croutons, bread pudding",

    "Has good flavor. Specially low Carb. It's good for people with diabetes.",

    "Very Small Slices,Very small loaves.No wonder they have so few carbs",

    "Great taste!",

    "Suavecito\nEl mejor pan keto que he probado..las rebanadas son un poco más chicas que el pan normal pero con un sabor muy rico",

    "This bread is unpleasantly sweet and has the aftertaste of a sweetener",

    "like the buttery one better this one is aweful finally found some at walmart for $5",

    "You will love this bread I love to toast it and make a sandwich  either PBJ  or what ever ,you can't go wrong I tried other keto brands but solo is my best !",

    "I tried several keto , and low carb breads . Most of them i could not even eat more then one peace. Its the only keto bread that i can eat and enjoy as well. i eat it in break fast with eggs. for my sweet tooth satisfaction i use keto strawberry preserve on the sola toast and its yummy.\nI had also tried there buns and hamburgers they are equally good and taste great.\nI am a regular buyer of sola bread.",

    "Best low carb bread I’ve had.",

    "Even though this bread is meant for Keto, it has a surprisingly good taste. It helps me with my regular bread cravings and will highly recommend if you're looking for a good Keto bread.",

    "This bagel had a good texture. I had strawberry cream cheese which initially tasted good. Then I began to taste garlic in it and that was it for me: I don’t like garlic at all and stopped eating it. I looked at the ingredients and it didn’t mention garlic. My friend also had one and said the same exact thing about the garlic. I would like to find this brand without garlic and would like them. I am giving these away to a friend who loves the flavor of garlic.",

    "This is the best low glycemic bread with outstanding flavor, texture that can replace easily, without any doubt most of the bread types in the market. I am very pleased. I just hope that the seller could drop the price to $5-6 bucks per loaf. I would be a customer forever.",

    "For those of you on a keto diet I recommend this bread! It is so yummy and fresh you can't go wrong.\nI was so upset when I couldn't find this bread in my local stores like I had in the past, that I immediately went to amazon and was so happy to see that they sold it and immediately picked up two loaves! I am so grateful to the people who created this bread because it's that good and I love it!",

    "I'm trying to eat low carb but LOVE bread.  This product is so close to the real carby-carb breads that I can still enjoy my sandwich!",

    "Good flavor",

    "I’ve been keto for years and this Sweet Oat bread is bar none the very best!",

    "Keto diet. Not sure if it spikes blood sugar.",

    "The bread is fresh spongy and toasts beautifully. Great taste without the guilt of carbs. Wonderful to add a sandwich to my diet options ....",

    "It raises blood sugar. I nearly passed out. Everything went in the trash after that.",

    "I was excited about this low carb. bread. I was disappointed when I saw the package. The loaf is smaller than regular loaves and so are the individual slices. The taste was not fantastic.  I think I'll try making my own bread.",

    "The fact is that this bread is a fair substitute for regular bread since I am monitoring my carb intake and I missed making sandwiches.  However, I find it very pricy, which will stop me from making another purchase.",

    "Well worth the few days wait to try this absolutely delicious low carb bread.  I can't believe I have never come across it before since starting low carb early 2018.  Have tried so many and all had this funny no bread texture and/or flavor.  This is just like the bread I would eat before Keto and a game changer for quick lunch meals.  Now if I could just get my hands on some of the french toast swirl and blueberry.  Please bring back in stock! :)",

    "This is a decent tasting bread. The package came pretty quick and nothing was damaged or moldy. There are two negatives to this. One is the size of the slices. It’s not the size of normal bread that you get in the store. This is what helps their claimed reduced carb amount. The second negative is there are some added preservatives and so forth that are not good. Check the ingredients in the picture before you buy to see if you are okay with what they have added. Other than that the bread tasted pretty good and is probably better than your average white bread. It worked out well for sandwiches and toast.",

    "Like the headline says.",

    "I really enjoy the good flavor and the freshness of this bread! Recommended!!",

    "Could be a little less on cost but still ok",

    "I like sola bread. This was very good. I made a fried egg sandwich with cheese and I highly recommend that. The only issue was that the swirls kind of separated and left a gap about 4in long and .5in this. Spreading butter was almost impossible. Yeah, I'm going to figure out how to spread butter on bread with a gap in it. I've got the motivation, but I shouldn't have to try so hard. I might buy it again if I get a craving.",

    "I legit love sola bread so much. I won't eat any other low carb bread now. It's really expensive, but well worth. Two packs lasts me a long time, I usually freeze one. I've been on keto since July and lost 41 pounds. It hasn't messed with my loss at all. I use it for burgers, pb and low carb jelly sandwhichs, grilled cheese you name it. Highly reccommend this.",

    "Not bad. It’s spongy kinda, but if you toast them, it’s just like regular bread.",

    "Sola bread is very low in carbs.  The loaves I bought had a total carb-less-fiber count of three carbs per slice.  The slices are about the size of raisin bread, but they toast nicely and are wonderful for those of us who love bread but have to watch our carbs.  This Sola bread tastes good--something one cannot say about many low-carb products.  Important to people like me who cannot tolerate almond flour because of a nut allergy, this bread does not use almond flour.",

    "Arrived quickly in good condition.  Best tasting lo carb bread.  I’ve tried other brands as well as make my own. This is a much better product.",

    "This has Eggs & Non-fat Milk !",

    "Like many others, we feel like we have tried nearly every low carb bread out there. This one is far and away the best we have ever had! We ordered the Sweet and Buttery and it tastes great. It also has a great texture. Look no further if you are searching for an excellent and delicious low carb bread.",

    "I'm no stranger to keto bread, and they are notoriously small compared to regular loaf breads. But this is almost half the size of that. Maybe 2x3? Think a tiny slice of baguette. And for the price? Get out of here. Trust me, it's good, but it isn't THAT good.",

    "I have been having trouble finding low carb bread locally. It's always sold out.\nI like this bread so I decided to buy it through Amazon. It arrived on time, nicely packed, directly from Sola.",

    "OK but not a good bread replacement for most uses.  If stored frozen will tend to burn in toaster.  Recommend thawing thoroughly first.",

    "Loved it",

    "Yeah, it’s definitely an expensive item, but I’ve wasted more store bought bread over the years to really appreciate this high fiber, soft and truly delicious bread. I will never go back to regular sandwich bread. And there’s no waste. I use what i need and freeze the rest. Totally worth every penny.",

    "The slices are a little on the small side, but this tastes just like regular bread. Highly recommended!",

    "Best tasting Keto bread ever. I have tried several others and none taste as close to the real bread like Sola bread. The texture is just on point, it toasts just like regular bread and so buttery. I’m so happy I finally found a low carb bread that’s just like the real thing. Others I couldn’t event grill or toast right. The slices are quite small but so all other low carb bread brands. I will be buying this bread for as long as I can. It came fresh by the way. I froze the second bag.",

    "This low carb bread makes great toast and is an essential addition on my low carb regime.",

    "Great tasting and always fresh.  Healthier for those of us doing Keto.  But the size of the package seems to be shrinking as well as the product itself - then again - most things are these days.  Great product though.  Will continue to rebuy this again.",

    "Didn't care for the texture. Kinda stiff.",

    "I've been waiting for something to come along that replicates real bread in taste and texture. This is it. Right now I'm enjoying  avocado toast. Next up is lox on toast. AWESOME!!!!",

    "$27 a bit much for too long for bread!!!!!!!",

    "I liked this product",

    "Use for sandwiches",

    "Two bags were moldy. The one good bag was excellent.  However, I Paid for three and only got one that wasn't moldy.",

    "Ordered 3 loaves. I'm on the 2nd and have yet to see the swirl. Maybe it should be renamed dot bread. My loaves do have 2 or 3 dots.",

    "Good as toast with butter or coconut oil.",

    "I am a bread person and doing keto without having bread is hard but this bread is pretty close to actual bread! It has a good buttery flavor. It is fluffy. It last a really long time if it is sealed up!",

    "Love this bread and the flavor. It actually tastes amazing, i’ve been enjoying this bread for a few months now. I am so happy that I can enjoy bread again. I would highly recommend.",

    "Bread became moldy after a couple of days!",

    "People say to me - how can you stand not eating bread??! Well I do eat bread and stay under my carb allotment.  I promise you this sweet & buttery flavor is bread - I don’t even want to say like bread. Peter Doucey on Fox & Friends was talking about this bread this morning so the word is out; buy a loaf before they sell out again",

    "I love this bread. It is the best low carb bread I've found.",

    "Great-tasting low carb bread.  I am very picky when it comes to my bread, and I can attest that this bread tastes, smells, and feels just like the high-carb breads out there.  The only difference I noticed was that the Sola bread has a slightly more \"spongy\" feel to it, but that doesn't affect the taste in the slightest.  Keeps together, and great for sandwiches.  The price is the only drawback because the slices are a bit smaller than the regular high-carb bread slices in the supermarkets.  I challenge anyone to find a better-tasting keto-friendly bread out there.",

    "Delicious",

    "Would no recommend",

    "Delicious but so expensive!",

    "We love this bread, we’ve purchased several times, always fresh, the taste is better than regular wheat bread, and the low carb count seals the deal. The shipping time is the only draw back, generally takes about a week and a half to arrive, so order before you run out!",

    "Too pricey",

    "I’ve had this bread for 12 days and I finished one loaf and went to open up a second when I saw that the other 2 have mold on them and they don’t expired for another 23 days",

    "I love the bread it’s chewy and sweet. Perfect for sandwiches or by itself as a snack .",

    "No almond flour taste! It just tastes like real bread.",

    "Tastes too sweet.  Not bad overall but looking for something better",

    "Great tasting French swirl bread is just one of the many tasty bread products from sola. The French swirl is light with a mildly sweet cinnamon taste",

    "Loved it! Tried other brands and always was disappointed but this one is a game changer! Perfect for whom is on dirt! Def recommend it!",

    "I realize when it comes to flavor it's up to each person to what you like or don't, and to me this ended in a trash. Very odd flavor and it got bitter when I tried to make a french toast as my last attempt to find some use out of this bread.",

    "I like this bread brand , but this time the bread was mold. I had to throw all away!!!",

    "This is absolutely the best Keto/Low Carb bread I have found.  I can finally have my avocado toast again!  I followed other recommendations about freezing it immediately after receiving my box.  Then I take a few slices out and let it thaw in the fridge over night.  I highly recommend this bread.",

    "I was pleasantly surprised at how good this bread is in flavor and texture. I have been looking for low carb bread for awhile and most are either lacking in taste or they are dry.",

    "I've ordered this bread many times and really like it. But my most recent order arrived a week ago and was already growing mold. I understand that this could happen in the summer, BUT, it's still not acceptable that I am just stuck with no recourse offered by the vendor. There seems to be no way to return this or to ask for a refund or to ask for a replacement. No way to contact the company at all. This bread is WAY too expensive for me to write off the cost of three moldy loaves.",

    "I've basically been on Keto and off bread for 9 months. Like all of you too I miss bread. This is by far the best Keto bread. Soft and good tasting like real bread. The loafs are small and expensive but for an occasional piece of bread it's great",

    "Most low carb Keto bread I have used in the past tasted like cardboard! This bread has a very good taste! The slices are about 3/4 the size of a regular slice of bread and is somewhat pricey but is a great alternative to keep your carbs low!",

    "All gluten",

    "I'm diabetic, and until my diagnosis in 2013, I was a bread lover who grew up enjoying homemade bread and learned to bake my own. You can imagine how devastating it was to be deprived of this joy when I was diagnosed Type 2 despite a healthy, plant based lifestyle till I was 67 years old. I really missed carbs, especially breads. So until this year, I was without even one bite of bread. I tried other brands of \"fake bread\" and it was tough, or like cardboard and completely without taste. I had given up when I found Sola on Amazon. I love all the flavors, and this new French Toasty Swirl is amazing! It's a lovely treat to enjoy with my morning coffee and, like the other Sola varieties, it is BREAD, real bread. It has zero impact on my glucose and is just fabulous. I'm thankful for it every day. Now, Sola -- can you fix potatoes? LOL! I miss them, too.",

    "I buy this bread all the time and never had a problem till this order as soon as I get the bread I put it in the freezer well when I took it out to use it it is moldy and it is on every loaf,",

    "Finally, a sandwich!",

    "Very good bread.  Low carbs, fresh and tasty.",

    "Crazy that we have to buy bread from Amazon! I love the texture, flavor and only 3 carbs, I got tired of driving all over the busy streets of Phoenix looking for Sola Bread, so let my fingers do the shopping. It arrived in perfect condition and stayed fresh for days. I popped two of the loaves in the freezer.",

    "Love this brand! Had to stop buying so much because I was eating too much of it. Makes eating low carb so much easier!!!",

    "Toast beautifully, great for grilled cheese although cooks fast.  It has chewier texture than regular white bread which is why I like it.",

    "When I received my order the bread was molded ....😡 I order this item often ....very disappointing",

    "My wife could not explain the way she was feeling. Then she discovered the bread was full of mold. Enjoy.",

    "I love it’s taste, softness and that it is Keto.  I can eat it with out guilt.",

    "Good, but ridiculously EXPENSIVE!",

    "Bread literally arrived moldy. I can’t even get my\nMoney back or do a return for this.",

    "By far the best keto bread on the market! Great taste and texture- my only complaint is the slices are small, but the competition does not even compare!!",

    "Did not care for taste  but have had worse.",

    "I have an ileostomy. The high fiber in this bread was a contributing factor to an emergency hospital visit that took five days. This warning only applies to ileostomy patients. The bread tastes exactly like whole wheat bread and toasts nicely. Tastes great with butter, etc.",

    "This is my husband's favorite keto bread. He does say it needs to be toasted when he eats it though which gives it a better texture. It came perfectly packaged and was not squished at all. We popped it in the freezer as soon as we got it and we just take a couple slices out here and there when he wants some. We let it defrost on the counter for about 10-15 mins and then pop it in the toaster. It did cost a bit more then it does on the store but is a great option if you let store is out of it for a bit.",

    "I’m trying to lose weight by watching my carbs. This bread is great tasting for low carb",

    "Tried other keto friendly bread and it was awful. Sola bread is delicious! It’s really improved my avocado toast game. So glad I found it. The slices are small but whatever, the flavor and texture make up for it. Buy it, you won’t be disappointed!",

    "I've been on Keto for 6 months now and miss bread so much. I have tried dozens of keto breads and none have impressed me. Let me tell you, this bread is incredible. Once again I can have cold sandwiches, grilled cheese sandwiches, French toast, garlic toast, garlic cheese bread, the list goes on. Honestly I was hesitant at first because of cost but saw some reviews that convinced me to buy it. I feel the price is worth it. Yes it is expensive and I probably won't buy a lot but maybe I'll buy some every other month or so. Final opinion is buy some and decide for yourself.",

    "This is worth the price.  Wanted french toast in the worst way but because of elevated sugar levels couldn't do it.  This bread worked out great for french toast.  It is soft like regular high carb bread and tastes like regular bread.  Will definitely keep buying this.",

    "First of all; No, it isn't exactly like the bread you're used to.\nSecond of all; Yes, it is a good replacement as a delivery vehicle for all the Keto friendly sandwich fixin's you know and love.\nThere is a slight spongy texture, which you get used to, and the slices are smaller than most bread loaves.\nToasting or grilling doesn't resolve the spongy texture and kinda makes it worse, so I suggest you don't do that.\nMy favorite sandwich recipes are rotisserie chicken salad with a little ginger powder, salt, garlic, a splash of brown mustard and lots of mayonnaise.\nTuna salad also works well.",

    "My husband is diabetic and while we are NOT doing a 'keto diet' we watch the carbs.  My husband reports of all the low carb bread, this brand, Sola, is his favorite.  The bread slices are very small in size, but regular thickness.  It is soft and fresh tasting, but is reasonably weighty (or dense) - 5 gms of protein and 4 gms of fiber.  It's a good option for diabetics in my opinion.  I never hesitate to update my reviews should new info seem useful.",

    "I love this product, but vendor take vantage of these  the price products I buy this one in HEBand I pay 3.79 for one, so that’s mean for the three if you go to HEB or any grocery store to caring this bread you pay no more than $12",

    "Two tests now, grilled cheese and honey toast.  So far, so good.  Texture is the best I've found in a commercial product.  Taste is great.  I have not eaten it plain yet, I just don't do that.  But I'll make a cold sandwich one of these days and if it's horrible, I'll let you know.  🤣",

    "I’ve been on keto for about 20 months. I have fallen off the diet, occasionally, but not for more than a few days. But there are a few things I seriously missed, and bread was right up there. I inadvertently found this product while looking for keto pasta. I had never tasted decent keto bread, but decided to try it. All I can say is wow. It is actually good (don’t expect great).  I’m in shock. Can’t wait to make a grilled cheese!!  I will definitely buy more!  This will reduce those off-the-wagon episodes!",

    "The bread is expensive...but so good. Soft, light and airy, slightly spongy. The flavor is slightly sweet like a hawaiian roll. Completely satisfying.  I made a turkey sandwich. The fiber possibly had an effect on me. Please lower the price and I will eat daily.",

    "Pleasantly surprised at the texture, flavor, etc. For a keto/low carb bread, this delivered above my expectations. I've had it with hamburger, plain and toasted w/ PB. Fantastic stuff. I'd say a tad bit better than Chompies (I usually get the whole wheat version).  Will buy this bread again once I eat it all~",

    "Touch pricey but I can’t live without bread 🥖",

    "Taste spongy not that good. Too expensive for the size and flavor.",

    "Texture and taste just like toast when I toasted it.  Sandwiches tomorrow. I have tried crackers etc.  much to my disappointment but this will be a repeated purchase",

    "Good taste but at $10.00 per 🍞 loaf and relatively small slice's it's not worth it.",

    "Too expensive for so little or no flavor. You can get better product in Aldi.",

    "Didn’t realize this bread has propionate in it which is linked to causing Diabetes. Won’t buy this product again.",

    "This is the best keto bread I have had and I have tried just about every brand on the market.",

    "I don't care what anyone else writes, if you have to suddenly go low carb and you are used to regular bread, this DOES NOT taste like regular white bread. It is disgusting and even toasted it is gross, threw the entire 2 loaves away!",

    "This is the best keto bread I have had!  It tastes just like regular bread. The consistency is the same also.  It may a small loaf and a little pricey, but I’ll continue to purchase it. I highly recommend it.\nIt’s 1000% better than Base Culture keto bread I got at Whole Foods.",

    "For being low carb bread it is very good",

    "I saw this bread in a review by a diabetic  that said she'd used this bread to replace regular bread.  On the wrapper it says 2 net grams of carbs. If u turn the wrapper around to the nutritional content,  it says 7 grams! Per slice! I thought 2 grams would be great. Then there's the taste. Hmm. There's not actually ANY taste,  except maybe of cardboard.  I was disappointed,  especially at $26 for 3 loaves.",

    "The bread has a bread-like look and feel. The flavor is acceptable, but I wouldn't say it is excellent. It is my opinion you cannot compare it to \"real\" bread...I likely will not buy again. However, I think it is an excellent effort to allow those of us who have a hard time giving up bread on low-carb diets to get at least the experience of some form of bread.",

    "I HAVE LOST TRACK OF THE NUMBER OF TIMES THAT I HAVE ORDERED.  ALL OTHER LOW CARB BREADS HAVE BEEN A DISAPPOINTMENT.",

    "I love Sola bread. It tastes so much better than the Arnolds keto bread hands down. I recommend buying it in Walmart because it cost me $10 to buy it on amazon and I went shopping yesterday and it was $4 plus change. So I bought 3 from Walmart and froze them. I will continue to buy the bread but not on Amazon.",

    "well I cant have sola sweet oats, I found out that it raises my blood sugars , so I'm going to get sweet butter, and that won't raise my sugars in my blood",

    "I've tried the majority of keto/low carb breads offered (when pigs fly, 647 brand, arnold, thin slim, etc) and this has got to be one of my favorites!!! I love the flavor and the texture while slightly spongy, toasts really well and makes yummy breakfast sandwiches and can be eaten pleasurably raw. I notice with some of the other breads, unless you toast it, its like paste-y and gross. I definitely will buy again in the absence of 647 brand which is my favorite hands down texture wise--> benefit of this brand is that its actually better macros wise to the 647 brand.",

    "I hate giving up bread on my low carb diet and my friends have been telling me about Sola so I decided to try it. The sweet and buttery bread is sort of pricey, I get it; but to me it tastes almost exactly like Jewish Challah, which is my favorite bread..eggy, buttery, somewhat sweet. Not really chewy but that’s ok. When I got the box the first thing I did was to grab one slice and toast it, then smother it with cream cheese. Delicious! Yeah..this IS the one!",

    "Best low carb bread I have ever had!",

    "I really like this product.  The flavor and texture is awesome; however, if you are diabetic or pre-diabetic, be careful.  This product will spike up your glucose.  I had to toss out this product, which was unfortunate.",

    "What you see is what you get",

    "This is a great Keto bread but the price per loaf is outrageous. I found a Keto loaf, different brand, at my grocers for half the price. Now I know and so do you.",

    "Sola is always fresh and tastes great.  This Sola with seeds is the best of their bread products.",

    "Any other low carb bread that I've purchased does not agree with my digestive system. This bread is delicious, keeps me full for many hours and does not feel like a brick in my stomach. I made a ham and swiss sandwich with this today and it's the best \"guilt free\" sandwich I've had in a long time!!! I am sold!!!",

    "On keto, I  really miss bread. This does the trick. Still a bit pricey though.",

    "This is an excellent bread for a low/no carb diet.  The company has Excellent customer service.\nI had a lost shipment and I contacted the co and they sent a replacement out that. We would highly recommend this  Company.",

    "good for low cab or diabetics, much much cheaper at wally world",

    "I enjoy an occasional sandwich and this bread makes that possible!",

    "They taste great for every bread substitute I love them but the problem is it just gives you a lot of gas youl fart all night:(",

    "The texture chewing is a bit rubbery, slices are about a third smaller than regular slices, and way too expensive when other keto breads offere same carbs.  Not terrible, but wont be buying again.",

    "Finally, a bread low in carbs and delicious!  Sure the slices are smaller and thinner than regular sliced bread but for me that’s a compromise I am willing to live with.  This bread is delicious and does not affect my sugar levels. I can eat bread now and not worry about my sugar spiking.  I love it!!",

    "This bread is the best one I've tried so far. Many brands have a weird flavor, this one is just like regular bread. 100% recommended.",

    "This bread smells bad and tastes worse.",

    "This is a small loaf with smaller-than-usual thin slices.  It is very dense and very little flavor.  Won’t be buying again.",

    "This stuff is amazing. Our pantry is stocked with it. It easily passes for real bread and, in my view, is TASTIER than real bread. So much so, that I have doubted the claim it has almost no net carbs! It just can't be!",

    "undersized and over priced  but better taste than similar products",

    "It’s really good when you’re counting your carbs and the same time you enjoy the flavor.",

    "It tastes sweet, without sugar and it's so tasty, I don't want any other bread after I've tried this one. I highly recommend the bread and the seller.",

    "Good attempt at low carb bread... still not there yet...if you like toast... you won't like this bread... when heated the bread becomes spongy, chewy, and like styrofoam...given this bread cost $10 a loaf I'd say its better than the general keto breads that are horrible...it seems it's better to pinch this loaf instead of eating it...keep smiling 🥲!",

    "If you are on a Keto diet and just can't give up bread, then this is the right substitute for those thick, grainy, carbohydrate-laden loaves of the \"Staff of Life\".  It looks like bread, and even tastes like bread.  It's a bit chewy, but other than that, it makes a nice sandwich or morning toast.  I give it an 8 out of 10 for flavor, texture, and general goodness.",

    "Sola Bread is the best low-carb bread I have ever found. I'm diabetic, and it does not spike my glucose. Better yet, it has the taste of my favorite regular bread. The texture is great. It's moist enough, never dry. It's just so GOOD to have a product I can rely on and that makes me feel more \"normal\". I can't thank the Sola company enough for this product. I've tried two different flavors, and they were both excellent.",

    "best keto bread ever",

    "This isn’t the best photo, but yummmm. I made grilled cheese and although it has a slight aftertaste, this is SO good. I’ve tried so many other brands of low carb breads and this one is the only one I could actually finish eating and I’m having it again today! I didn’t throw it in the garbage. Yay! I am so excited I found it and can’t wait to have all those yummy foods that I was depriving myself of because it just wasn’t the same without actually bread! Yay!!!\nUpdate: Just found this bread at my local Price Chopper grocery store, for $5 each! Can’t believe I paid double on here. Smh",

    "I ordered 2 loaves of Sola bread for $21.77, then I checked Walmart and discovered that they sell it for $4.17 for one loaf. Product is way overpriced from Amazon (Sola is a 3rd party vender ). Sola company does not accept returns or give refunds, but if you refuse  it at point of delivery you should receive a refund from the Sola company….just an FYI.",

    "Each slice is smaller than regular bread. I used it for French toast. It was pretty good.",

    "I wear a Continuous Glucouse Monitor (CGM).  I use it for health reason and weed out Keto frauds.  This is one of them.  This product spiked my glucouse about the same as regular white bread.  It taste good though.",

    "It was so fresh and it freezes great",

    "When the order arrived, I put each loaf in it's original bag, into a gallon freezer bag and froze each one separately.  I took out only what I needed each time and had no issue with freshness and taste. I would recommend this product.",

    "This product taste terrible - not just lacking flavor it taste bad. I am a diabetic and have an open mind for food variety always on the look for low carb especially.\nThe bread arrived fresh, packaging was good. But the flavor was bad! It doesn’t really matter if the value relative to other products in this category if you can’t stand the taste.",

    "Way too expensive no flavor",

    "Great",

    "I started a keto diet not too long ago. Being a very picky eater I didn't expect to last long. Tried it once before and basically just lived off bacon and eggs for two weeks before giving up. I'm past the month mark this time and still going strong, and almost strictly have this bread to thank. I can have a few of my favorite foods with this (Cheeseburgers using this as the buns, spaghetti minus the noodles, so just hamburger and spaghetti sauce and making a couple slices of garlic bread with this).\nIt's not a bad taste, but I wouldn't call it good either. Like I wouldn't eat it on it's own. Tried it as toast with bacon and eggs and didn't care for that. But in a meal that has a lot more going on, where it's absorbing sauce, or the grease and condiments like my burgers, it's fantastic. To me it's a must buy for a low carb diet.",

    "I bought this from our local grocery store. Just wanted to warn folks that eating it can give you lots of gas. I ate one slice and have been paying for it all day. Maybe doesn’t affect everyone the same way, but it did that to me. It tasted like bread, but bread never did this to me.",

    "This is the BEST low carb bread I've ever found. I have tried both the Oat and the Sweet and Buttery. Sweet and Buttery is my favorite. This is a medical issue for me. I am diabetic, and I have no choice but to live low carb. Sola bread products do NOT spike my glucose at all. They keep me level. It's a huge bonus that they are also delicious, and I would buy them even if I were not required to live low carb. I am thankful every day that I found Sola bread, and I recommend them highly.",

    "A better low carb bread than ALDIs Carrie’s",

    "It was great",

    "Good flavor and freshness",

    "I’ve tried several Keto alternatives to regular bread. One was made of tapioca starch, was like glue and stuck to my teeth. One was made of cauliflower and while it was good, it wasn’t very much like bread. Slices were way to small on another, etc., etc. This is the closest to bread that I have tasted. Yes, the slices are smaller than regular bread, but if you are truly following a Keto diet, put more protein and greens in your sandwich! And while it is more expensive than regular bread, buy the 3 pack for the best price. That price is lower than the $12 to $14 of other brands.",

    "My perfect keto bread/staple pantry item!",

    "It does not taste “good” in my opinion. I would not eat this bread unless I was on strict keto. It toasts up golden like real bread, which isn’t the case with other keto breads, so that’s nice. Other than that, it’s just like other keto breads where, what you sauce or spread it up with will make the difference. Honestly, I might still continue to buy Carbonaut bread that I can buy frozen in my local Whole Foods vs. wait for this to be mailed to me, because Carbonaut is half the net carbs of this one, it’s more cost effective, and it’s mild enough that it doesn’t interfere with the flavor and texture of my keto friendly PB&J. So all in all, we still have a ways to go in having a keto bread that actually tastes…like bread.",

    "Well, I wasn't sure about ordering as I have had some Keto products that the taste was just not good. However, I quite liked this bread's taste. Now, the size of each slice is smaller than a traditional slice of bread, I was fine with it. I made toast, grilled cheese and sandwiches with it and was very satisfied. Trying to stick to a Keto diet is hard when you can't have regular 'bread\" products but this satisfied my craving for bread and again I enjoyed the taste. I used the 1st loaf and froze the other two and after thawing was very pleased that it still tasted great. I would recommend this to anyone that is wanting to cut carbs.",

    "No",

    "If you're diabetic and need to watch your carb intake, his bread is perfect for that.\nHowever the slices are smaller and thinner at 3g carb per .9 oz serving, than regular bread which has 14g carb per 1.9 oz serving. By weight you're only saving 8g of carb, So I'm still on the fence as to if it is worth the extra price, when I can get regular bread for $1.99.",

    "great texture and flavor from a keto friendly product.  this is my new go-to loaf, for sure!",

    "To expensive",

    "it is rather expensive, but you get what you pay for.",

    "Didn’t know what to expect but glad I tried this.  This is a small slice and makes bomb grilled cheese to accompany my tomato bisque soup. And I love my soup.",

    "So far I have been very pleased with this bread for toasting and for sandwiches.",

    "Difficult to find low carb breads in my local stores.  This is a good product.  Arrived fresh.  Slice are a bit smaller.",

    "Can’t promote this bread as Paleo compliant, when ingredients that make up the bread are restricted on the Paleo diet i.e. wheat etc.",

    "Never thought I'd be having this for breakfast again because I didn't put much faith in yet another keto product because scant few have measured up, but I love this bread. Makes great toast.",

    "Very under cooked mishaped unusable garbage. Store where purchased are NO HELP ! 🖕 Tried to contact company, very unsuccessful, web contact is a joke impossible.  I WILL NEVER BUY FRIM THIS COMPANY EVER AGAIN. !!!!! 🖕🖕🖕",

    "This bread although small in size is indeed mighty when it comes to texture and flavor! It a rare treat for me and pairs well with Nutella, butter, cheese, etc. I love it toasted and it still holds its chewiness. I will buy this again when my bread craving hits.",

    "Anyone who has suffered through crappy low carb bread in past knows this kind is a blessing for sandwiches or toast, even French toast too! It is not absolutely perfect but what would you expect for such low carbs and not made with flour.",

    "Too many calories,too small aserving",

    "I enjoy it toasted, egg sandwich, lunch meat sandwich, next will be French toast.",

    "To small and expensive.",

    "The only thing I miss is toast when being a low carb eater! Thank you for such satisfaction!!!",

    "BEST BREAD EVER, and amazon gets it here quick!",

    "Finally cracked the code for a delicious low carb bread!! SO EXCITED",

    "These taste less like cardboard than the alternatives, especially for toasting. Try one.",

    "This bread is delicious! I am very happy to have found it and it tastes great!",

    "Aunt Millie's Live Low Carb bread has this beat hands down.  However, at this time it is only available in some grocery stores - tho' I haven't tried any specialty stores online.",

    "Very expensive. But if frozen and used sparingly, it helps you get through the desire for carb loaded bread. Not a ton of flavor, but good with butter.",

    "I used a parcel forwarding company to ship this all the way to Ireland because we don't have anything like that here or in the UK for that matter. And I can only say it was worth the Extra cost. Took over a week to arrive and still had a great date on it. I love it!",

    "Great quality and taste",

    "as described. packaged well. fresh. great taste.",

    "Good bread substitute. Pricey but worth the dietary goals.",

    "This bread is delicious! Worth every penny!",

    "Although it takes a week or more to arrive, it’s worth the wait! It’s soft and chewy, and a little bit sweet, with only 2 carbs and 5g protein.",

    "Great product! Ordering it again. I have made many of my own Keto friendly breads - this surpasses anything I can come up with. This is the best choice for me. Hope my local Whole Foods will be able to carry it soon.",

    "Love this bread! Better than kissmyketo and franz by a mile. Tastes so fresh and good!",

    "Got used to taste but cost too much for me,",

    "Sola bread is the best-tasting low-carb bread I have eaten.  The texture is closer to higher carb breads also.",

    "Maybe it was just my delivery but the bread was downright mushy. it looked and tasted like it wasn't fully cooked.",

    "since I have just been told that I have type 2 Diabetes and now need to slow down with all the carbs that I eat so much ( Bread , Pasta , Rice etc ) this has taken the replacement of regular Carbed filled breads! it taste really good and will be my go to for sandwiches & French toasts .  its a bit pricey but what can you do?",

    "This is by far the best keto bread out there",

    "it was great\n1 Like real bread and not a lot of fiber to bloat you.",

    "I really struggled purchasing this because of the price. I've tried a few other keto breads, mainly from Aldi, and they are crispy and weird tasting but toasted I could stomach it begrudgingly. This bread is neutral flavor, moist, fluffy and has a light chewyness that is missing from Keto foods. I had a loaf of French toast begging me to drop my will but I didn't cave and instead toasted up some of this bread. Hate the price but if it keeps me headed on the right health path....worth it.",

    "This bread is really good, great taste, low in carbs & a great buy.",

    "Sola bread is the very best low carb and low cal bread of all time! It’s soft and flavorful and perfect for all sandwiches!",

    "Has a weird bitter taste to it that can't really be covered, even by butter. To some it may be a good low carb dupe but imo it wasn't worth it.",

    "I was excited.  The slices were very small, so that would help them have lower carbs.  That really is like a cheat.  Also, it seemed like it needed to be cooked more.  My loaves came smushed also, and toasting them didn't help.  Maybe my experience would have been different if the loaves weren't crushed, but I don't think so.  This just didn't seem like bread.",

    "I think the bread is delicious but they get away with a low carb label because the pieces are so tiny.",

    "Bread is very moist, almost wet feeling (under cooked maybe?) Taste was good but both loaves were collapsed so already small slices were even smaller, probably won't try again",

    "Slices are small but taste is good. We need a low carb and this one is.",

    "This bread was good. I ordered 3 loads and all came in crushed. The first 2 were edible, but the last loaf is not. I paid about $9 per loaf!!!!",

    "I do appreciate the quick shipping and packaging. But it still tastes like low carb bread. Small slices...like a diet bread...and that weird taste. Almost eggy. Odd texture. It would probably be better toasted. I wanted to taste it on it's own legs first though. Tastes like weird low carb bread.\nAm I desperate for SOMETHING to make a sandwich? Yes!\nAm I desperate for anything with bread mouth-feel? YES\nWould I buy this again? no",

    "Love this bread!  Since I started eating low carb, “legal” breads are hard to find.",

    "I love this bread ,but can't justify the price when Walmart and Target you can purchase 2 for 1/2 the price. delivered or not.  I'll stick with buying extra and freezing it.",

    "I splurge on this occaisionally to satisfy a desire for bread while on a low carb or keto diet. I use it for sandwiches (grilled cheese, egg salad) and it tastes quite good. There are two negatives: it is expensive and it is a highly processed food. For these reasons, it is only an occasional treat.",

    "Just received my bread today and was happily surprised!  It was just as described, soft and buttery.  I’m a toast fanatic and it toasted just like regular bread.  My son was said wow I can’t wait to have a sandwich on that.  I’m thrilled to finally have found a keto bread that I love and I tried about 10 different brands including making my own from scratch.",

    "Great flavor and texture. It does not fall apart like many other keto breads!",

    "While I do agree with everyone that the size is relatively smaller than other breads, I’d bet money that you cannot beat the flavor and texture. I’ve tried other keto breads and they literally taste like cardboard or expired protein. But holy cow…these are sweet, buttery, moist and taste like wheat bread. Even better toasted!!!! Yes the size is smaller but you’ve tried other keto breads, you’ll come back to this.",

    "Only Problem— Make the loaf bigger so the slices are larger.",

    "I've been buying the wonder bread low carb version of Franz for a few years now and have tolerated it and finally decided to try this bread. I got the seeded two loaf order. Nothing compares! This is so delicious and amazing. Personally, I'm okay with the smaller size of the slices. I'll keep buying for as long as they make it! Thank you, Sola.",

    "Price is a bit higher than CostCo but it was delivered quickly and tastes great.",

    "Makes good sandwiches and toasts well.",

    "This is the best keto bread I have found.  it makes great sandwiches.  It is not rubbery and does not dry out when you toast it, like another popular brand.  I would eat it even if not worried about carbs.  I take some with me when I go out to eat.",

    "If you've made many homemade keto breads just to be disappointed in the flavor and texture, this is for you. Yes, it's somewhat pricey but you don't have to baby it for hours to make it yourself. Among the best youtube videos on bread is \"I don't Sugar Coat\" and the gluten bread she makes is very similar to this. It's great plain and toasted. (You know a lot of homemade keto bread has problems with toasting.) It's sort of soft and stretchy due to the gluten, and the cherry on top is that it's got 2 carbs per slice. The slices are smaller than regular bread, kinda of like raisin bread size. The loaf is that size too.  It has the barest taste of almond flour, you know the taste a lot of people don't like with keto bread. It came on time and in good condition. So, go for it. I have no reason whatsoever to recommend this except that it's GOOD and it's convenient.",

    "Best keto bread I have ever tasted. It’s close enough to the real bread. I have bought the three pack 16 times already at $27.99 per pack. However I am not buying it anymore from here on since the company have added $4.99 shipping cost. Spending almost $10 on a loaf of bread is already high enough without adding additional shipping cost.",

    "I have tried all the Keto breads and this taste like regular bread nothing like the other hard and tasteless brands I had. I know you will love it too",

    "Taste delicious",

    "This is the BEST low carb bread ever!  Excellent flavor, soft texture and roasts up beautifully!  Made a grilled cheese sandwich with it and it was perfect!  You won’t regret trying it!",

    "I paid $4.99 at a local supermarket and they're charging NINE DOLLARS PER LOAF here!  Also the slices are so small a sandwich looks fit for a toddler, not adult!",

    "I found these bread at my local Wal-Mart for almost $5 dollars. Buying it here is like almost 2x the price for each loaf. Either ways this is the best tasting keto bread I had so far.",

    "Kind of small but delicious . Best keto bread ever.",

    "Did not care for this product.\nWe put in garbage only tried to eat 2 slices.",

    "I need bread in my life. I don't need carbs in my life though. With this I can have my avocado toast, brie and pear sandwiches and other stuff and I'm happy. It's not \"buttery\" which is good. It just tastes good. You do have to toast it, from frozen, so it won't get crunchy. But it tastes good, it's bread and therefore worth it if you are looking to lower carb intake.",

    "Taste not great\nNot fresh",

    "This bread is tasty and arrives fresh.  At more than $9 per loaf, it was a borderline value.  Now that the company is charging another $4.99 for shipping, I will shop for better value elsewhere.",

    "Came very well packaged. Was not squished or damaged in anyway. I froze two and am almost finished with the first loaf. Children have no idea it's keto bread and neither does my 84 year old mother. Toast, sandwich, panini, all delicious. Pricey, yes, but am very happy and will order again.",

    "Like having bread while doing keto",

    "I bought this because I am on a keto diet.  It is better tasting than most regular breads.  My husband who is not a keto, prefers this over any other store bought brand. It's relatively expensive but worth it.",

    "I have had many low-carb breads and by far this is the closest to the \"real thing\". The taste says it all. I will surely be purchasing more flavors of bread. Thank you Sola for keeping me on Keto!",

    "I cannot believe this is low in carb and healthy. I am enjoying every slice without the guilt. It’s worth every penny. If you are on a low carb, or any other kind of diet for a healthy lifestyle, this has to be the number one item on your grocery list.",

    "SOLA Sweet and buttery is by FAR the best keto bread I’ve ever tried. It’s absolutely delicious. Just a simple slice of toast with butter is the best addition to my breakfast or snack to feel like I am absolutely not missing anything at all! toasted is best! Make sure to freeze the bread and take it out as needed since it will go bad fast if you do not store in freezer",

    "May be a bit pricey compared to others, but if you purchased the ingredients and tried to make it yourself, you would spend the same. At least this way, you save time and know it will taste good.",

    "Took forever to get to my house. Taste like cardboard",

    "Walmart sells this same bread for 4.77 a loaf and you can get it delivered if you don’t live next to a Walmart. My favorite low carb bread.",

    "Delcious low carb bread",

    "I love everything about this bread! It’s fresh baked deliciousness is perfect for deli sandwich’s, French toast, grilled cheese or a slice right out of the bag. I follow a keto diet, and Sola helps keeps me on track. No need to cheat when I can eat BREAD!!",

    "It's amazing if you toasted it taste even better",

    "Great bread for low carbing",

    "Taste",

    "Won't order again.",

    "The bread taste good! My only issue us I didn't realize I was buying bread for slider-size sandwiches. Lol I think the square inches per slice is approximately 1/2 that of a regular slice of bread.",

    "This is great bread ...  even if you aren't watching your carb intake this bread tastes amazing.  I keep 2 loaves in the freezer and rotate them out as needed.  This is a wonderful product for those who miss bread.",

    "I buy this all the time so that speaks for itself.  It is a very good low carb bread that I use for grilled cheese, french toast, whatever.  It is delicious.",

    "Absolutely delicious! Freezes well and keeps the carbs down! 10/10!",

    "This was a good substitute for low cal bread I eat.  It was really surprising toasted with butter & jam.......very good!!",

    "I only buy this bread so far on my keto journey! But it is not cheap! I like it cold or toasted.  It holds up better for a sandwich if it's toasted!",

    "Sweeter and moister than zero keto bread",

    "This is the best bread bagels hot dog rolls hamburger buns I have eaten it never raises my blood sugar",

    "Overpriced...overhyped\nFool me once?\nNever again\nI don't want to give it one ⭐ even but y'all are making me",

    "This bread is the best low carb bread I've ever tried. No comparison with any other. Toasted, you can't even tell it's low carb. I can't eat carbs, so for me, it's worth to spend a little money and have some around for sandwiches or breakfast.",

    "This low carb bread is great tasting and has the same texture as wheat bread.  I love it.",

    "I was hoping this bread would taste good since it is very expensive.  However, it is very small and does not have a very good taste.  I would not recommend this bread.",

    "The bread is quite expensive but is very low in carbs and fiber. It also tastes good.",

    "This product arrives frozen and I thaw it in the fridge and it is soft, buttery, and even tastes great without toasting.  While costly those of us restricting carb intake, it truly is a blessing.",

    "Great tasting, great texture, long lasting....good for your health",

    "The bread has a funny smell when toasting it so I took a closer look at the label. I’m not sure what erythritol, inulin, natural flavor, distilled monoglycerides and xantham gum are or why they are in bread. Maybe preservatives or flavor enhancers. This would be good occasionally, but I don’t know that I want to put those things in my body regularly.",

    "First off this bread is very small in size and the whole loaf is very small.  Also the bread has a peculiar smell to it that makes it difficult to eat.  Doesn't taste good!  I won't buy this again.  Not worth the money either.  Total waste of money.  Had to throw away.",

    "Delicious",

    "Y’all!! This is. Y far the best keto/low carb bread I have tried! On keto for two years now and it works great for me. I don’t eat low carb bread often, but man, sometimes you just really want a sandwich or grilled cheese!!!! The other breast I have tried have either been super eggy or nutty 🤨 but this bread will make you feel like you are actually having a piece of bread! Worth every penny to me ♥️",

    "Bread taste great but just and FYI I guess I missed read but I thought it was low carb , gluten free and it is NOT  gluten free quiet the opposite:).  But other than the cost TOO HIGH it’s a good tasting bread.  Definitely not worth the money dough if it was gluten free yes",

    "This bread tastes like store bought bread . It is the best bread I have purchased since doing Keto.The only negative is the price.",

    "This is definitely the best low carb bread option I've come across (and I've tried many.)  Yes, it's crazy pricey, especially considering the fact that they keep shrinking the size BUT... in my opinion, it's still worth it as an occasional quality \"carb fix.\"  If it keeps me on track with my food, I'm willing to fork the money over.  I just won't buy it as often as I would if the price were reasonable (then I'd stock up!)\nIt's great for a grilled cheese, toast, or a almond butter and jelly (i make my own strawberry chia jam with erythritol.) It's a lifesaver on days when I really want something like that instead of.... more eggs.\nThe other thing I like about it... I'm big on portion size, so even with normal bread, I \"trim\" crusts heavily.  I lived in the UK before and this isn't much bigger than what their \"normal\" sized bread is.  It was great for learning portion sizes for my own eating, and this helps me stick to that.",

    "Thanks",

    "I like the texture and freshness of this bread. It’s the best keto bread I have tried.",

    "Hands down the best tasting and softest Keto bread!!",

    "Easy to order and have shipped. Fresh and tastes great. I freeze one and put one in the fridge since I space out my bread consumption. Two loaves last a long time for me.",

    "I like very much. I would keep buying it.",

    "I was very surprised that I liked this bread so much. No grainy taste like some of the other keto friendly breads.  I will definitely keep this bread as a regular bread.",

    "Hands down the best Keto bread I’ve ever had. The slices are tiny (like a half of a normal bread slice) and at $10 a loaf, it’s a tough pill to swallow, but hopefully the more people who buy/ production the more affordable it will get. It definitely makes life on keto more convenient. Looking forward to trying their buns.",

    "I've tried several keto/low-card breads and i feel Sola is one of the best. I prefer the bread fresh out of the bag, however it is decent being toasted. Be sure to use a little butter or cooking spray to the bread before toasting. This helps it from drying out since it has a high fiber content.",

    "A bit pricey and shipping is slow but it’s awesome tasting bread that’s also low carb so we will continue to buy.",

    "I love the flavor!",

    "Pros:\nBlood sugar: I consider 2 slices of bread one serving. I am a type 2 diabetic and incredibly carbohydrate sensitive. 1 serving of two slices of this bread DID NOT appreciably raise my blood sugar levels. I found this to be par for the course as others have said the same.\nFlavor: I consider it good. I was never really a bread connoisseur and this bread seems to be inline with other varieties of wheat or high complex carbohydrate breads.\nFreshness: The bread arrived fresh in the packaging. I was away for the weekend when they arrived and I managed to pick them up after having sat in the package receiving area of my apt building for 3 days. I froze two of the loaves and continued to use one and there were no issues.\nPackaging: The bread was not crushed or warped. It arrived in pristine condition\nCons:\nSize: These slices are approximately half of what you would get in store-bought bread. This isn't necessarily a deal breaker but it felt misleading in some way to not identify that. Other reviews have pictures I do not need to add more; Which leads in to my next con.\nPrice: This bread is double the price of store-bought bread for half the size. It isn't economical. I paid $30 for 3 loaves.\nKETO Warning: I found that this bread is fine (FOR ME) to remain in a state of ketosis if I had a maximum of 2 slices/day. Any more and I would go over my allowance. If you are buying this bread thinking you can eat it for 3 meals/day and remain in KETO, that isn't going to happen. After educating myself more on how to stay in ketosis, I understood better that you may need to do some trial and error to see what works for you.",

    "This bread is delicious  but costly....why are are all the low carb foods so expensive?",

    "Sorry. Did not like the taste. Product was ok but expensive",

    "This delicious bread has made staying on the keto diet so much easier. My grown boys eat this as they to are on keto.",

    "I bought the seeded bread. It tastes just like regular bread.  The slices are smaller but the bread is delicious.  It toasts like regular bread and tastes like regular bread.  I will buy it again",

    "Taste is awesome and low carb",

    "We tried some of this bread on a whim… it’s on the pricey side but it’s delicious…. Had it as toast with butter and it really nipped that bread craving I was having! Most recently used it to make blt’s….  ABSOLUTELY DELISH! Only downside is that it was so good that the family tore into it… now we’re out $54 for another order (of 6 loaves)!",

    "The texture and the taste was less than expected",

    "Amazing low carb bread. I might even like it better than ordinary bread. It’s pricey but worth it if you can’t have bread",

    "Great service. Fast delivery and always fresh",

    "Was pleasantly surprised at the taste, texture and freshness",

    "Used it for sandwich",

    "Sola bread products exceeded my  expectations as a low carb bread option both in taste and texture. I tried every low carb bread alternative I could get my hands on only to toss them in the trash due to their tree bark like taste and off putting weird texture. I found Sola and life changed .. Seriously! It taste great and can actually pass for that regular bread taste and texture that us Keto Warriors remember and long for. I test Ketones and can assure you that Sola bread if integrated into your diet wisely will not throw you out of ketosis. Buy it and don’t look back.",

    "We have tried so many Keto breads, either dense or cardboard.\nSola bread is the best we have found.",

    "This is the best keto bread I've ever had it taste sooooo good I like making grilled cheese with it.",

    "Pretty good",

    "After being disappointed so many times in GF and Keto breads, I am thrilled about this product. Like most, it's better toasted. For grilled cheese, it's excellent!  Hint: 1) Use lots of butter, but be careful. It burns easily. 2) The slices are small. But at 2g net carbs per slice, you can make two sandwiches for a very satisfying and guilt-free lunch or dinner.",

    "Currently eating grilled ham and cheese sandwiches!! So good! I put a lot of mustard because I wasn’t sure if I would have to hide a weird flavor. Not needed!!!",

    "I've tried many keto breads,  but by far this is my favorite! I'm obsessed with it 😍 😋  It taste very delicious and it doesn't have that cardboard texture or taste to it it's so good. 😋",

    "Excellent taste and extremely fresh",

    "Great low carb high protein bread.",

    "I've tried many low carb breads, and this one by far is the best! It is a bit pricey, but worth it!",

    "This is expensive but if you're keto and really missing toast, brown this pretty well and you will be in heaven. Smells different in the toaster but quite tasty. These are \"palm size\" slices. Also high fiber and keep me feeling full a long time.",

    "This bread tastes ok but it is very small compared to normal size bread.  So yes. Carb count should be low.  At this price it is much better to get low carb tortillas for meals.",

    "Let me just say. Wow. Super impressed. I’ve tried a gazillion different low carb breads and nothing came close. In fact all the others tasted like chemicals. The worse offender was the one that Costco sells. Gross. This Sola bread was amazing. Taste and texture both on point. Tried it toasted as well. Delicious. I’ll use it sparingly because it’s not cheap but I’ll be ordering more for sure.",

    "Have used this daily for months. Great for our low carb diet! Toasts well and tastes good.",

    "I've ordered this bread 3x already. The price isn't great, but it does last a long time if not eaten all at once. The flavor of the bread by itself is alright, but it does compliment whatever you decide to have it with. I usually have it for breakfast. I like eating it with cream cheese, or making it into french toast or Monte Cristo sandwiches.",

    "I like the texture of the bread. Felt it was very. Pricey though.",

    "The bread is tasty and actually has the consistency of bread. It is very expensive.",

    "I made toast , sandwich, toasted and added peanut butter",

    "A low-carb solution to dietary restrictions that tastes great and does the job.",

    "First time writing a review which is funny because I always depend on reviews when I order something! I’ve been on a keto diet and this is DELICIOUS. The Sweet and Buttery reminds me of King’s Hawaiian bread. Great with just a pad of butter or as a full sandwich. I’m really impressed!",

    "Bread tastes great and does not cause high blood sugar for me (I am a type 1 diabetic). Wish it was a little more affordable because I love it!",

    "Nothing beats this low carb bread👌🏻",

    "Not much flavor. A little to much like plain white bread.could not give the last loaf away.",

    "Best low carb bread ever!!!!",

    "Love this bread.. second time buying waiting for bagels..",

    "Pricey but Sooo worth it if you are Low Carb, Diabetic etc. This bread tastes great! Great as toast, sandwiches, French toast and grilled Cheese!!\nI will buy it again soon.",

    "A little expensive but you order bread and you get bread. The flavor is great and the texture is awesome",

    "Taste is OK but over priced",

    "Gave me the worst diarrhea so sick from it",

    "Flavorful.",

    "I am diabetic, I need something like this but sometimes this bread has a funny smell and sometimes leaves you with a phony taste.",

    "French toast\nBLT",

    "Good for low carb diet. Taste very good. I use it for toast and French toast and sandwiches.",

    "While being on the Keto eating plan, I was struggling with not being able to have bread. Now my struggles are over! Sola bread solved the problem! I usually order the 3 count. Being able to take out one loaf at a time from the freezer is very handy. The texture and taste are great!",

    "Just received the order today, immediately placed 2 in the freezer and made myself a turkey / pesto sandwich, first impression is this bread slices are tiny, about 2/3 of a conventional bread slice. THE FLAVOR IS TO DIE FOR !!!!!! OH MY GOSH .... not kidding you. The bread is more dense, so it made me feel like I had eaten a normal sandwich.",

    "I love them. I am in ketosis and I love bread. This one makes it easy to stay within my macros.",

    "The consistency and flavor tasts a bit like buttered potato bread. Not as soft as regular bread you get at a grocery store. And Smaller than I thought it would be. Still an interesting flavor. Definitely worth a switch to if you are trying to cut carbs down in your diet, like I am.",

    "took a long time to get here. slices are very small but the flavor is good",

    "The slices are approximately half the size of regular sliced bread both in terms of thickness and length.  It was very fresh and tasted great!  I feel it was overpriced, but for those that are in a rush and not into baking, it is an ideal solution.",

    "this is a great sub for real bread and great for keto diet ...I love this bread it is a little pricey but other than that it's good",

    "Good taste and texture. Tastes like regular bread and much better than other keto breads with weird flavor and texture.",

    "For a low-carb bread it taste just like regular bread a little bit expensive but well worth it",

    "the bread is ok but the website mislead customer to believe these are full slices.I can get a low carb loaf at walmart for 3-4$ same carbs but 1 large slice. Should make size of slice more clear.",

    "Value for money - bread is very expensive.",

    "I didn't really expect to much from this bread. I have tried others but this is great. Will for sure be buying this again!",

    "I’m on keto.  Love this bread!!!",

    "Good to taste",

    "Have been using another brand of bread. This was recommended by a friend. It is so much better! It was soft and fresh when I received it. Promt shipping. Will be ordering this bread from now on.",

    "This bread is absolutely delicious no sugar heart hardly hardly any carbs delicious I wish it was a little cheaper but it is what it is",

    "Bread was fresh. Not bad",

    "Too good to be true!  My wife and I ordered this product, skeptically hoping it would at least be half-decent. Imagine our surprise when we got the seeded loaf and it was absolutely delicious! You will be surprised how good this bread is! Enjoy",

    "Chose to order this because the overwhelmingly positive reviews, and I was not disappointed. This keto-friendly bread doesn’t just taste like bread, IT ACTUALLY TASTES LIKE DELICIOUS BREAD 🤯 I’ve tried other keto-friendly bread that taste like actual cardboard but this….O…M….G!!!! I absolutely love the flavor, texture, smell…this bread is it for me. Also made grilled cheese sandwiches for my picky-eater nieces and nephews and they said it was, “good,” which is kid language means freaking awesome; plus they each ate all 2 sandwiches. I haven’t been living this keto-life for long, so I’m still very familiar with what normal food is supposed to taste like, and this bread is it.",

    "🥖\nSuper bueno y suaves a la vez lo recomiendo al 1000😝🥪😝",

    "Very good product freezes easy and great for toast ect like a good bread finally for Keto",

    "I have tried many no or low carb breads and this is the best. The pieces are small but it’s a fair trade to get to eat toast again and stay low carb. Best ever!!!",

    "I’m on this low carbs diet and intermittent fasting so I try this bread for my eggs sandwich... I like it!",

    "This bread was so soft. I thought it would taste horrible being low carb but it was delicious! I put 2 in the freezer!",

    "This is by far the best low carb/keto bread I have ever tried and will definitely continue to buy! I have cooked and made a lot with it like toast, french toast, air fried, pan fried, sandwiches, and everything comes out amazing. I have noticed with other keto/low carb breads that they crumbly when cooked and this bread hold up! Great product!",

    "I love the bread. Great flavor.",

    "I found this bread after purchasing this online at my local grocery store in the freezer.  It was $3.99 a loaf--quite a savings.  I have purchased Aldi's Netzero bread and love it--also $3.99 a loaf.",

    "Been dying for bread for over a year. finally a keto bread that actually tastes like bread. It's outstanding.",

    "This. Bread. I usually do not write a review for many items, especially...bread. But I think this might be the best commercially produced bread I have ever purchased. It is so good that I read the ingredients to see what was in it that must be bad for me. Seriously, it is perfect.",

    "It's not as fluffy as regular bread.  But I'll take it.",

    "This is the best thing I found to help me with the Atkins diet.It is really good.I can now have sandwiches,plain or toasted.Best thing I found.",

    "I really enjoy this bread! It’s low carbs are great for a Keto diet.  Love it as toast with my eggs in the morning!  Usually ships quickly but remember to refrigerate! I freeze it until it need it.  Much better than most keto breads.",

    "This bread is very good. I will be ordering 3 more soon. I toast it either put Cream cheese on it or organic peanut butter.",

    "really good bread but how much you want good bread to pay this much for three loaves?",

    "OMG... this bread is freaking amazing, we love it. Flavor and freshness is perfect.... will continue to order ♡",

    "Since I went keto, the thing I miss most is bread. There are decent-enough replacements for sweets, pasta, and even bagels, but any kind of bread has been elusive for my low-carb needs. I finally bit the bullet and spent the steep price for 2 (smallish) loaves of Sola, and I'm hear to tell you that even though it is expensive, it's the best low carb sandwich bread on the market! I just finished a homemade brunch of French Toast and it was easily the best low carb French Toast I've had. I can't wait to have toast with my eggs again, or even make a sandwich to enjoy. I'm even going to use these slices for burgers.\nNow if I can find a low-carb loaf of french bread!",

    "Arrived even faster than I was expecting. This type of Sola bread is my absolute favorite. My local store stopped carrying the seeded bread and I was so happy to find it on Amazon! :-) I toast it and add keto friendly jam and sugar free peanut butter. Makes a stellar low carb treat. The bread stores beautifully in the freezer. I just put frozen slices straight into the toaster.",

    "Absolutely love this bread! So soft! Great taste and texture. Using for sandwiches, toasted and untrusted! I'm so hooked!",

    "Will buy again fresh and good taste like real bread.",

    "Expensive and just ok",

    "Thank you..Thank you..Thank you. Finally a low carb bread that tastes, smells and feels like Bread! Grilled cheese sandwiches..here I come! So good you can eats this plain. I can stop searching!\nI bought the sweet Oat...I'll be buying more.",

    "Tamaño normal pero el sabor lo supera\nCada cuerpo es diferente ok así que este opinión es personal. Bueno este es el mejor pan para los que somos keto no me saco de cetosis y me comí dos sándwiches tiene. Sabor a pan Bimbo definitivamente estoy  tan tan emocionada de volver a comer pan 🍞lo ame lo amo y lo seguiré amando",

    "I love sola bread. If you are on Keto this is your bread. The bread we all know we should stay away from on keto, but if you just need some bread this is your go-to. only 2 carbs per slice. What are you waiting for? Order it!",

    "This the best Leto bread I tasted! No eggy taste!",

    "This was awesome. Price isn't too awesome, but the texture & flavor is great. I'd definitely buy more & would like to try bagels, hot dog & burger buns if they exist.",

    "This is the most delicious keto bread EVER! All the others are eggs or tasteless,  but SOLA has flavor and texture that make it THE WINNER🏆",

    "Personal preference of course didn't care for it in a sandwich but ok for toast with sugar free jam was fine.",

    "The best low carb bread ever",

    "OMG! I am a very picky person and absolutely love bread which is the only problem I have when trying to do a low carb diet. This bread is absolutely freaking amazing. Yes, the bread is smaller than regular bread, but it tastes just like bread! It’s so good, I’m ordering the hotdog and hamburger buns. The only problem is the high price so I gave it 4 stars instead of 5.",

    "Nothing",

    "This bread is delicious, but it made my sugars high like it went from 165 to 265 really quick I don’t understand why , I guess I won’t be able to eat it anymore oh well ! But it’s delicious and I froze it so it wouldn’t go bad overall good quality and taste , bad for my type 1 Diabetes 😢",

    "Great low carb bread. Price is a bit high though. I found it in d as upermarket for 4.99/loaf.",

    "This would be literally slices of buttery happiness if another bread maker didn't produce some Keto sandwich slices that arr not quite as yummy but still really good for half the price. Every Keto product we have crushes the budget, so we have to be judicious.  HOWEVER, if your money grows on trees, this bread is the curl-your-toes-I've-missed-you-so-much excellent.",

    "Arrived fresh.\nTastes great!\nWill buy again",

    "It tastes like bread. no strange texture or taste",

    "I'm obsessed with this bread even though it's way overpriced I ate through my three loads and under a month and then promptly ordered a second box of three loaves.  it says the box was shipped here May 4th its May 16th and I still have yet to receive my order. so sadly though I love the bread I will not be ordering another one because it was $30 for a big fat nothing.",

    "This is some good low carb bread...just wish it was a little cheaper 😉",

    "The bread is taste in flavorful",

    "This bread is pretty great.  Lowest carbs per slice I can find anywhere, and it tastes good! Great for keto!",

    "The size was smaller than expected..not \"sandwich size\" as I thought.\nSomewhat chewy, even after being in the toaster..but taste is good.  Use Every morning for breakfast and now I don't worry about carbs.  Overall, very good product.",

    "I love this bread, flavor, freshness and the value for the price is the best. The best bread I’ve eaten for a while!👍🏼",

    "Wonderful tasting bread.  No after taste of any kind.  Great texture",

    "‘Nuff said 😋",

    "I was very satisfied with the product. Great taste and so fresh! A bit pricey, though.",

    "Excellent flavor and excellent for my diet!",

    "Delicious. Tastes like Portuguese sweet bread without the carbs. It is pricey.",

    "This is the only bread that I can tolerate for whatever reason — it tastes so good. I really hope this company is in business for a long time. My issue is just trying to find it in stock at my local Publix chains. I wish there was a Prime option for Sola.",

    "After a fifteen year search for diabetic friendly bread, this bread is absolutely fantastic. The texture and smell and mouth feel and satiation are all there. If you never tried it, I highly recommend that you buy it and try it. All my other bread brands that are in my freezer I will convert to bread crumbs. This bread is great as toast and for sandwiches and for turkey stuffing. There are several flavors and I love them all.",

    "the bread was good but almost 10 bucks a piece so 3 loaves for almost 30 bucks is high",

    "very yummy. makes very good avacado toast.",

    "I really like this bread! It tastes great!",

    "Kinda a small loaf. Pretty expensive. Tastes good though.",

    "I love it!! Tastes great & only 2 carbs per sliced",

    "This is the only keto bread I will ever have. It taste so good that you can’t tell it’s keto. The Bad side? You might end up eating too much!",

    "Delicious healthy bread!! Light in calories and extremely light in carbs, perfect for those on Keto / Atkins or just following a low carb diet!",

    "Way too small and it doesn’t taste like real bread. It has a weird smell to it.",

    "Taste great",

    "I love this bread. Great for keto diet- totally life saving for quick sandwiches. The last 3 times I've ordered this though, it has come completely crushed.\nThis product IS NOT a returnable item or even eligible for a refund. This bread is EXPENSIVE which I don't mind paying as long as it comes in an EDIBLE shape!",

    "Great product and now able to eat bread again without so many carbs. Love it!",

    "i receive my product on time  , and it was fresh and i was satisfied with it",

    "I've tried several different low carb breads and this is by far the most tasty.  It tastes and feels and smells like regular bread.  It's wonderful as toast or in a grilled cheese sandwich.  It's a little pricey compared to grocery store bread, but I'd choose this over anything there because it is really better tasting.  This has now become a staple in this house.",

    "I’m not one to write reviews. After doing some research and reading all the reviews. I made the decision on o purchase the Sola Sweet and Buttery Bread. Two loaves for $24.99!!! But after reading all the reviews, Sola seemed to be a better choice but the price sucks! Everything I read, most reviews said it tasted best toasted. Some even complained that it was chewy and doughy. So when I received the bread I planned to eat it toasted. So I opened the bag and was immediately hit in the face with the delicious scent of bread. I grabbed a slice, and it feels like bread! I then took a bite and.... OMG this bread is so dang good! I think it delicious! I’m so excited to be able to finally eat bread again!!! The price sucks but I will definitely be purchasing more in the future!",

    "Costs WAY TOO MUCH. It's a decent keto substitute,  but I'd rather save over $8 per loaf and eat my Aldi bread .",

    "Like this bread for keto.  Seller is always prompt & often get product earlier than promised..very happy!",

    "Sola bread is the best \"keto\" bread I have tried thus far! The \"Sweet and Buttery\" is my favorite flavor but unfortunately I can not find it in my town. But no worries with Amazon! It arrives very fresh for me to enjoy and I don't have to leave the house to get it. Bread is important to me and eating Sola bread makes me feel like I'm cheating on my Keto journey. It's that good!! Most ketogenic foods are pricey but it's the price I'm willing to pay for weight loss and better health.",

    "This bread is very good. It arrived without any issues. I have used it for toast, and sandwiches. It's a little pricey, but I've found anything Low Carb cost more.",

    "the bread wrecked my stomach. I wanted to like the bread, because how amazing would it be to be able to make sandwiches on keto? but no, its basically pure gluten.",

    "I’ve tried a couple of “keto” breads in the past and this is by far the best one I’ve had. Even my daughter and mom didn’t notice the difference. It is a bit pricey but in my opinion, it’s worth it.",

    "The bread tasted old. I wasn’t sure if that’s just the taste or if it’s really because there’s no expiration date, which is weird.",

    "This is the best low carb bread ever!",

    "I LOVED the taste, but had to switch to carbonauts, because this one does not have enough fiber for me.",

    "Absolutely delicious! I like that they are slightly smaller than a regular slice & they toast up well, my primary mode of eating bread.\nIt doesn’t taste exactly like traditional bread, but better, to me.",

    "Best low carb bread we have had. Slices are a little smaller than normal bread but texture/taste is good. Bought several loaves....",

    "Being a type 1 diabetic, Sola is the only low carb bread I eat. The texture is amazing. I get 3 loaves at a time and even after defrosting a loaf, the bread tastes fresh and worth every carb.",

    "I've been using Sola bread for about 3 mos now and really appreciate it!  Love it's flavor and texture, along with it's serving size.  It's the perfect sized slice for those of us who don't need the calories in the larger supermarket breads.  Per the companies instructions, freeze the loaves for at least a day and it stays beautifully fresh and soft.\nYes, it's a little pricey, but in my estimation it's worth it.  The flavor is unbeatable by any bread, but exquisitely so when it comes to lo carb.",

    "I am so sorry for the negative review, but the order took 8 days to be delivered, the size was too small, and the bread left a bitter after-taste. Unfortunately, returns are not accepted with this item...there goes almost $30.",

    "This keto breads are really amazing. It does taste like real bread with lower carbs. Buttery flavor is the bomb!",

    "Bread is very tasty but loaf is way too small as well as the slices of bread. Kind of a tease especially at this price.",

    "Tastes just like regular bread and was fresh when it arrived. I'd like it to cost a little less, but it's worth it since I can't eat regular bread.",

    "Best keto bread ever! Very filling and soft, no weird aftertaste",

    "Great buttery taste",

    "Very soft and delicious. Was meant for our diet, but the kids love it too",

    "Sola bread is Very delicious I found it more tasty then regular flour bread",

    "Good alternative for diabetics",

    "Horrible",

    "It really taste good.... it’s fresh and stores in the refrigerator for a week or more.",

    "You won’t go wrong with this brand, excellent taste, and texture. No rubbery taste either, it’s hard to tell it’s not regular bread. Buy it, you’ll be hooked!",

    "Great taste!  Use for toast and french toast...the best we have had yet since going low-carb!",

    "That is delicious bread! Highly recommend!",

    "This bread is low carb and very good.",

    "This bread was delicious and stayed fresh for at least a week out of the freezer.",

    "This good tasting bread!",

    "Pretty decent flavor comes fresh however the pieces are smaller than I expected",

    "Great bread",

    "Best bread I’ve had since embracing KETO\nIt’s soft and flavorful Makes great toast and holds up nicely for grilled cheese A bit expensive but worth every bit",

    "Love the bread. Need to make more affordable",

    "The best low carb bread I have tried. I have bought it several times. The loaves freeze well.  I thaw the bread by pulling out a few slices and leaving them on the counter in a bag.",

    "This bread has a chemical after taste and it stinks after toasting it. If it can last for 2 weeks outside the fridge, what chemical preservatives are mixed with it? Pretty scary.",

    "I have tried so many low carb breads - not of them made the cut except Sola. The slices are small but - I just have open faced sandwiches and can stay on my low carb diet without missing out!",

    "I love this bread it tastes great. When I get the 3 pack I put two and a half in the freezer and let the rest out. I’ve made tuna sandwiches, pb&j and chicken sandwiches. I so prefer this to Dave’s killer bread which I like a lot. Enjoy.",

    "Great consistency and Didn’t feel or taste like cardboard.",

    "Sola Bread is delicious it does not taste like low carb bread at all.  My only issue is that the slices are tiny, other than this is a winner.  I've already placed a second order.",

    "The taste is great. Have every morning",

    "Shipping was weird it was sent by sola through ups delivered to my local post office then delivered to me. Like why? The taste of the bread was good but the slices were tiny, the average slice of cheese was larger than the bread slice. Other than that the bread was tasty and it helps me stay low carb. Will buy again.",

    "Smaller than normal bread but it taste good and makes me full and satisfied with only 2 slices . I will buy it again.",

    "This is great toasted!  It has everything in texture and taste as bread.  Very pricey.  I won't buy it regularly.",

    "Everyone needs to get this bread. It’s so good. I’m better than regular bread tbh. Worth every penny. Cooks/toasts great also. The taste and texture is amazing. 10/10 would recommend",

    "Fooled me taste as good as bread",

    "So delicious and good. My new low carb bread",

    "Bread slices are small bit not to bad on taste.",

    "Wow this bread is great! I was eagerly waiting for this bread to arrive and when it arrived I opened the package right away and the bread looked so fresh. I ate a slice without putting anything on it and it tasted so yummy.\nI got 3 loaves and put 2 in the freezer and the other one is outside since I just got it yesterday but will put it in the refrigerator today. I made tuna sandwich and it tasted great. I haven't eaten a bread in a long time as I am on a keto diet. I am so happy and satisfied with this bread. Yes it's pricey but I am willing to spend the extra money for my health. I will definitely be ordering more.",

    "I prefer Healthy Living Keto",

    "Delicious",

    "Stays fresh for over a week without refrigerating and great flavor.",

    "I  would have given this five stars if it was not so expensive.",

    "Love love love it",

    "This truly is the best keto, low carb bread that I’ve found. Does not taste eggy at all. Does not have that odd aftertaste. Even my husband, who is not keto, loves it. It is now the only bread I buy.\nThe individual slices are slightly smaller than the average ‘big name brand’ bread found in supermarkets, but  the difference is minimal. I always have a loaf in the freezer because I don’t want to run out.",

    "Good bread. Does not spike my blood sugar. Will be ordering again.",

    "Delicious low carb option! Great keto diet option. Definitely best toasted. We have tired sweet and buttery and sweet oat. Both delicious! Make great grilled sandwiches. And really good dipped in flavored bread oils. We freeze 2 loaves when they arrive, and just rotate out of the freezer into the fridge as needed. A little pricey, but worth it!",

    "So, so, so, YUMMY!!",

    "Eggy, strange texture, very chewy. Taste is okay, but I wouldn’t buy it again. I tried it as regular toast, as a sandwich, and I made French toast with it. Pretty bland and chewy. I’m going to try making my own low carb bread.",

    "I’ve tried many low carb Keto friendly breads that fell way short! Tasting more like cardboard. This smells, looks, feels, & more importantly TASTES great! Yes the slices are on the smaller side. But I’ll sacrifice size for authenticity. Try it...you’ll enjoy that sandwich, piece of toast, or burger!",

    "This is the best keto bread available! It is on the smaller side, yes, great texture and flavor and long shelf life, get it you will be glad you did! I was hesitant because of all the bad reviews my kids loved it as well!",

    "A bit expensive. Had good flavor. Smaller size slices  then regular bread but I  can actually have a sandwich now and again. Will buy again.",

    "So the #1 rated review on here claims that regular white bread has 13 grams of carbs, so SOLA isn't worth it.  What they fail to mention is that included in those 13+ (depending on the brand of white bread) grams of carbs, is no added fiber, and added sugar.  SOLA has added fiber and no added sugar.  So when you look at NET carbs, SOLA is the clear winner.  Have fun eating your regular white bread....I'll stick with my SOLA.",

    "Very expensive  but low carb",

    "I like this bread. Nice and lite. Smaller in size than Sandwhich bread but its just enough to fill you and keep your daily nutrients on track.",

    "I absolutely loved this bread! I’m very skeptical about low carb/keto products because more often than not they taste horrible or have a very bad texture but this is fantastic and I highly recommend it!",

    "This bread is vary pricy, small (each slice is about half the size of a regular slice of bread), had little or no taste, and  the consistency  was similar to cardboard.  Would not recommend.  Just buy low carb/calorie bread at the grocery store.  Don't waste your money.",

    "I am a sandwich junkie! But I’m also trying to live the keto diet. Other low carb breads I’ve tried taste like cardboard. Not so with Sola Sweet and Buttery! It not only tastes like real bread, it completely satisfies my periodic sandwich cravings. And don’t believe the reviews on here alleging that the carbs are high. They are incorrect! Every slice of Sola has only 7 grams of carbs, 4 g of which are insoluble fiber and 1 g of sugar alcohols (sweetener).  That is only 2grams of net carbs per slice!  And wait until you have that first BLT or grilled cheese! Yum!  This is keto done right!",

    "I'm a foodie, love bread, even own a bread machine. Doing Keto have not had bread in a month. This bread will pass :) thank the Keto gods !  At almost $10 a loaf I was concercend but I will reorder and eat bread for life !",

    "This a good keto substitute. I was craving bread and this did the job. Highly recommend.",

    "The flavor , best taste if you’re in a low carb diet .",

    "This is the best tasting keto bread I've found! Great value!",

    "Taste too good to be true, So it’s probably not as keto friendly as I wish it was, but I didn’t put it to the test either. It’s a great low carb cheat if nothing else! Great for toasted cheese sandwiches!",

    "This bread has only 2-3 grams of net carbs per slice.  Yes, the slices are small.  But it satisfies for the desire for toast in a big way!",

    "Tastes like “real” bread unlike any other Keto friendly bread I’ve tried at a good price.",

    "Best keto bread. Tastes good",

    "This is, by far, the best keto bread I have tasted. I e bought so many that taste awful, but the Sola Seeded Bread is delicious! I won’t buy anything else. The only problem is that it is three Dillard’s more expensive online than in my grocery store. Amazon needs to evaluate its pricing.",

    "Taste a lot like real bread.",

    "Overpriced on Amazon.  But shopping during the pandemic was restricted for us, so we paid the price.  The product is very tasty and enjoyable.",

    "Love the taste love the idea that I can have a sandwich with very little carbs stays very fresh in the refrigerator for weeks",

    "Best low carb bread ever.",

    "Wow.\nI had low expectations for this bread, just because everything (including other bread options) I seem to buy that’s Keto or low carb is grainy, or just plain gross. This bread is a game changer! I always crave sandwiches (or honestly any kind of bread) and this has made all the difference. Makes great French toast too! Almost the same density of potato bread. So good! Buy it! It’s worth the price.",

    "Yuck! It tastes a tad better than a lot of keto bread - in other words, it was a step up above cardboard.  Sorry, but it did.  If you really need bread, as I do sometimes, it will do.  It will work better if you toast it but you need a spread of something on top or it’s not even worth it.",

    "Let me start off by saying this - I’m usually just a review reader. BUT honey I just had to comment on this bread.\nBOMB.com.\nThis tastes just like potato bread. It’s soft and fresh. Add some butter onto it and it taste just like the real deal. Satisfies the craving for me. All around amazing, don’t hesitate just buy!",

    "Taste was good but it felt like a lot of bread it was too thick wish it was lighter it was too dense",

    "One of my favorite breads my kids even eat it",

    "These guys don’t need my positive review but here it is anyway. Overjoyed to have a bread I can ENJOY, not just eat, on a ketogenic diet. So far I’ve only bought the Hawaiian style. Soft, moist, and slightly sweet, you hardly feel that you’re eating a low-carb bread. It never seems to grow mould either, which is both wonderful and slightly disconcerting...but I’m not going to stop buying it. My ONLY complaint is the price...over $9 per loaf!!!!! But they’ve nailed a superior product and have got a captive audience. I hope to try the oat some day....",

    "I was trying to find bread that tasted like regular bread. I have tried other \"Keto\" bread & I tried real hard to like it but wasn't able to get past the lack of flavor & weird texture.\nThe only part that is a downer is the price. The instructions that come with the bread says to put it in freezer & pull out as needed. That is a great idea especially because of the price. Waste not want not!\nThank you for making this bread.",

    "Very good bread I have tried different one but this one is the best i have tried but it is a little expensive",

    "I cannot live without bread. Keto wants me to live without bread. Pfft whatever! I find my happy medium with this bread. I have tried many breads and this has been the brand I always come back to. Yum.",

    "Slices are small, but taste and texture are great. Sweet and buttery is the best flavor so far.",

    "Great flavor.",

    "This bread is a blessing! The slices are on the smaller side but flavor is good. When toasted it has the best crunch. The cost is higher but ideal for times when you don’t have time to make your own.",

    "I have been having trouble finding this in the stores\nWas happy I found it on Amazon, I wont worry about not finding it agai .\nThis is the best tasting bread I have had in a long time",

    "Very delicious like that I can make sandwiches and toast without worrying about a bunch of calories and carbs.",

    "This bread is great! I really don’t understand all the negative reviews with the exception of the moldy bread. If you’ve ever bought healthy breads they’re typically not the size of traditional American bread loaves you find on the grocery store shelf. I’ve had the Golden wheat and this time I ordered the sweet and buttery. Since the sweet and buttery is only 2 Net carbs per slice I will continue ordering that one and it’s honestly delicious. So far I’ve made French toast, corn beef sandwiches, pb& j, and grilled cheese. I was one of those low carb people who’d rather go without a food than try to eat a replacement that isn’t anywhere near the real thing. So I haven’t eaten bread in a long time. This Sola bread is bomb and I’m so happy to have bread back into my life. Oh the possibilities! I love bread!",

    "This bread tastes good but very small slices for the money. Bread was very fresh and no mold like I have read on some other brand of low carb breads.",

    "No taste. Kiss my Keto is much better. Bar Keri bread is Wio smart food.",

    "Terrible, the bread is not baked all the way through. There is mushy unbaked parts in the middle of the bread. Tried to toast it to make it edible but didn’t do anything. I wouldn’t buy it.",

    "On Keto - I miss bread like items - this is truly delicious - so much so that I am writing this for others searching for  a replacement - I got the seeded - and it really browns in the toaster and tastes fantastic. My husband could not tell the difference. Enjoy!  I will next try the others from Sola!",

    "I’ve had a few different brands of keto bread, and I have to say this is by far the best I’ve had. It’s soft, not stale like a lot of the other keto breads. The flavor is really good and my hubby approved too!",

    "I love this bread. Great bread when you don’t want all those carbs.",

    "This is an excellent product.  I really wanted to have French Toast again and now I can.  It does for a bit more and the loaves are smaller, but still worth it in my opinion.  The flavor is excellent and the bread is soft, fresh and well packaged.  I will definitely order more.",

    "First, this is a low-carb, Keto bread, so it would be unfair to compare it to regular bread.  And like most other low-carb breads, the slices are slightly smaller and the loaf is smaller than regular bread. But the smaller slices, only make it easier to add a skirt to your Grilled Cheese!\nBut, in comparison to the two other low-carb breads I’ve tried, this is the best out there...so far. Others are hard and woody or flavorless and don’t present well.  Think “sawdust bread.”  But this Sola Sweet and Buttery was soft, if only a little chewy, tasty, and was great plain, as toast, in Grilled Cheese, and as a plain-Jane PBJ!  Haven’t tried it in French Toast yet.  This review couldn’t wait - I’m that excited about it.",

    "Tastes great!",

    "Y’all!!!!!  This bread is crazy good!!  Purchased the Deliciously Seeded.",

    "Why does this product need to have the most unhealthy oil in the world with the highest amount of inflammation causing omega6",

    "This bread is by FAR the best keto friendly bread I have ever tried! I will definitely be ordering again!",

    "Delicious",

    "I read the negative reviews and I guess some folks don’t realize that you subtract the fiber and sugar alcohols. At 3g (sweet oat) per slice it is delicious with a real bread mouth feel and satisfies my carb cravings. Yes...the slices are smaller but it makes a great sandwich and tastes better than most regular breads.",

    "Best low carb bread I tasted in 5 years.  Delicious.",

    "Great bread with a slightly chewy texture. My wife and I love it while we're doing Keto and when we're not. Arrived fresh and fast. Highly recommend.",

    "As close to real bread as Keto can get. Nice to have something besides lettuce to anchor a sandwich. Makes OK toast. Seems expensive, but in line with other Keto brands.",

    "Over priced. Doesn't toast well.",

    "Amazing. Had no idea there was such a thing as keto bread! I froze mine and then thawed in fridge.",

    "This is amazing ... must buy and try it",

    "The bread smell horrible after toasted,  like stinky feet!! And tasted sour.  I don’t know if mine gone bad or it’s just like that.  I tried not to toasted it and eat like cold,  the smell is not that strong but still has the sour weird taste.  Tired to contact seller, but no response at all.  Don’t waist your money.",

    "Made sandwiches, toast, breadcrumbs, croutons! Very good low carb bread. I use when on keto",

    "This product was stale and cost 4 times more than at the store.",

    "Very tasty for low carb bread.",

    "This is by far the best low carb bread I've ever had!! This specific flavor is a hands down winner!! I've had two other flavors from Sola that are sold in my local grocery store but Sweet and Buttery kind is not. So unfortunate because this flavor is the best. Even my picky teenage son loves it and was eating just the slice by itself lol. Soooooo good and worth the $$!!!! Very fast shipping too. Arrived way before the expected delivery date. Thumbs all the way up!",

    "Loved the freshness and taste of this low carb bread.",

    "This is not Keto. Evidence was the fact that i was kicked out of Ketosis as soon as I started eating this - no more than two slices per day. Urine test confirmed. As soon as I eliminated this from diet, back to ketosis.",

    "Like wow I never thought I would like a keto bread product this much. It tastes like proper bread! I've turned it into a grilled cheese sandwich, almond butter and sugar free jam sandwich, and also made sugar free cinnamon toast with it and everything was just like I had made it with normal bread! With this bread I can give up normal bread for good no looking back!",

    "I bought this item at 3 different times.  This third time (January 2021) that I bought it, the loaves were mishapen and smaller than the prior two times that I bought it.  Not consistent with the quality that I had received before.",

    "Too expensive!",

    "The flavor of this bread is pretty tasty. I haven't refrigerated it as I am a nomad/van dweller full time. It hasn't gone bad so far in 3 weeks. The pieces are at least 25% smaller than the average piece of bread. If u want portion control its the perfect size but not a good value. For the same money u could buy full size, Keto approved loaves.",

    "I've been Keto for over two years and have lost almost 80 lbs.  But I missed sandwiches.  Other breads have a weird raw flour like taste to them.  But not this bread!  I came fresh and perfect. Looks like real bread.  I bought the 3 pack and immediately froze 2 loaves.  It's a little expensive, but I gave it 5 stars for value as this is the only processed \"keto\" bread that totally nails it!  Will be a regular customer!",

    "First off, let me say this..Reviews help us all and what some of base our actual purchases on. I am one of those type to read atleast 50 reviews before I make a purchase. In this case with it being food, to each their own taste buds I know! However, The only thing I feel this stuff, I can't even call it \"bread\" because the only star I am giving is for the shape of the loaf, small and rectangular..similiar to the 1/2 loaves you see at the market. Appearance, yellowed..like potato bread, crust..very darkened brown..like chocolate brown..texture..like a sponge-not kidding you, literally like a cellulose SPONGE. Taste....I couldn't get past the fell on my lips..TERRIBLE. Had I closed my eyes and never seen the slices..I could have described exactly what I have above. Unless you are REALLY desperate for EXTREMELY HIGH PRICED..OVER-RATED artificial sponge..JUST SAY NO TO THIS! It will do one thing for you...it'll will RID your entire appetite. I have consumed so many different types of low carb, and carb free items in my lifetime (Keto ..before anyone ever really knew of KETO) It's pretty much the lifestyle of most I know now. This item should not be sold with the slightest thought that you will receive bread. Sorry 10 Thumbs DOWN! OH, btw...I purchased the buns also..same way! Spent $50 on 2-1/2 loafs and 3 pk -buns..ALL NON REFUNDABLE! I attempted to reach out to the company to possibly send back in exchange for their maple pecan granola in which I love and is totally delicious. No reply as of 2/14/21. Amazon doesn't refund or credit the purchase..their policy on this bites...Simply because you can be receiving something out-dated, have bugs in it, etc..and you are just out of pocket on food items. Atleast offer some type of compensation. This enables the consumer to try such high cost speciality items without a complete loss. Makes us not want to shop for specialty items and take the chance. I'm sure the ratio to like/dislike etc would benefit companies in the positive..as the opportunity to try other products made by the company, such as I had with the granola. Just a fair and honest opinion here.",

    "I just finished a sandwhich with two slices of this bread. I buttered and toasted them on the stove and I truly could not tell a difference between this bread and any other spliced bread. It almost feels like I'm cheating on my keto diet, it seems so much like real bread. Wow. Came super fresh, I keep two in the freezer and one in the fridge.",

    "the soft texture is what we miss from bread.",

    "The best low carb bread I’ve ever had.",

    "So good!  I haven’t had a BLT in 3 years of keto before I got this!!  Very impressed.\nAlso disregard that first review, it’s 2G net carbs per slice, that person has no idea what they are talking about.",

    "I hate I wasted my money on this bread. The amount of calories and carbs you get from consuming one TINY slice makes it totally not worth it. And the flavor of the bread isn’t even that good. It’s pretty flavorless. Not to mention, it is way over priced and you can’t just order one loaf. I really wish I could return these loaves and get my $30 back.",

    "The bread slices are small, but they taste like actual bread which is a hard find for keto products.\nThis has been a godsend on this diet because none of the recipes I've tried come even close to this one.  Product arrived in excellent condition, I put it one loaf the fridge and 2 in the freezer to preserve freshness. My rating is 10/10!",

    "Its around about $9 a loaf which is really pricey, so I keep it in the freezer and only eat it once or twice a week.  I highly recommend it if price is not a problem.",

    "I have tried a couple of low carb bread alternatives.  I've tried making my own from Almond and other alternative flours.  I've tried other brands.  I had more or less had given up on ever eating a sandwich again - without feeling guilty -  until I tried the Sola breads.  This is BY FAR the closest thing to real bread and certainly fills that void in the Keto/Low Carb diet.  It eats like real bread, it toasts well, and tastes great.  Of the Sola breads I've tried, \"Seriously Seeded\" is the best, especially for texture reasons; there is admittedly a \"kitchen sponge\" like texture to the bread (I assume from the high fiber content) that I find more noticeable in other flavors.\nNow, most of the analysis I've seen says this bread is only 'barely' Keto friendly because it contains wheat that has been processed to remove many of the carbs.  This violates both the general rule to avoid wheat products and processed food.  However, they usually conclude that this as an occasional alternative should not impact your Keto diet.\nAs usual with many diet products, the price is high (I can find it for a lower price at my local grocery store).  But, unlike many other diet products , you won't be disappointed by this one.  After the first bite of a real sandwich using this bread you won't regret the price.",

    "Great to toast or to fry! Love this bread! Taste is great and I love I can make sandwiches again!",

    "I've tried them all and this bread is by far the best keto bread I've tried. I just made french toast with it. Holy Moly. I know it's expensive, but if you are wanting bread and you're on keto, this is the bread you should get. It even tastes good untoasted.",

    "Not only is this bread a superior product but their customer service is second to none.",

    "It’s a good product and it’s a good low carb substitute for bread… But the price point seems a little high. That being said, it did fill my bread craving.",

    "Very good bread",

    "No fathead dough for me... no make bread in a cup... NEVER again- now that this bread is being delivered to my doorstep! Delicious and Keto Friendly",

    "I froze it upon arrival.  I take out 1 piece at a time and toast it.  It's really good!  I make avocado toast or peanut butter toasted bread.  Great flavor.  I wish they had it in stores!  It's a bid pricey for bread but I like that it's low carb and tastes good!  Next I will try the 2 carb per slice bread.",

    "I mean it’s keto bread so not much was expected but when I was making my family sandwiches with it I toasted them on the stove and upon doing so this weird hair like substance started burning off the bread like stringy tiny hairs were coming off of it. Idk what they make this with to cause that but We were pretty weirded out by it lol I mean, Maybe we got a bad batch or something but for the cost I wasn’t super excited with that.",

    "I bought this “sweet & buttery” bread because the photo and description showed 2 NET carbs per slice, when in fact it is 3 NET carbs - see my photo. This matters when you are counting them closely.",

    "This is my favorite low carb bread. Perfect soft texture, the tast is AMAZING. I like the l good small slices for portion control.",

    "I AM SO THRILLED to FINALLY have a low carb bread!!!  The seeded bread is delish. I was surprised by the petite loaf sizes, but honestly, they’re just the right size to also add an element of portion control.  I’ve only eaten the bread toasted... spray-buttered with an egg at breakfast and to eat real sandwiches again is heaven.  I’m so burned out on wraps.  And I have NO problem with the price.  When you think of the cost of unhealthy things you never think twice about buying that you’re now NOT eating on a low carb program, it’s a no brainer.  I promptly popped the two other loaves in the freezer and they’ve got a new customer for life.",

    "So happy I got this bread. Just what I needed. So happy to finally have a bacon, egg, and cheese sandwich. Seriously dont wait, but the bread. The slices are small, but if you are on keto you can really make a good sandwich and the small bread isnt a factor.",

    "This bread tastes amazing. It’s a little smaller than regular bread but, it’s great if you are counting carbs and want bread that tastes like bread!",

    "I was not disappointed with this bread as far as flavor, but I will be trying a cheaper brand. I don't think I can bring myself to pay this much again.",

    "The wheat is the best low carb bread I've tried!\nA bit expensive, but good...especially toasted!",

    "I usually don't write reviews, but this bread is excellent.  It has great texture and great flavor.  I just wished the bread was slightly the same size as a regular bread loaf.  But overall, well done.",

    "I tried to like it as it was expensive, but it’s definitely not for me! I wasted 25.00 in two small loaves of bread.",

    "This is the best Keto bread I've tasted thus far.  I will be buying more!",

    "Very expensive, but if you are craving bread on a keto diet, this works pretty well.",

    "This bread is small, yes, but I think that helps with portion control and the mental shift that requires. Toast this for an open faced tuna melt or use it for making grilled cheese--perfect.",

    "Bread was delivered quickly and not smashed in shipping.  I am getting back into keto/low carb and this bread is great tasting!  I was apprehensive about ordering because every keto cookie and bread has been grainy tasting and I get sick of wasting money.  I ate tuna fish sandwiches last night,  so, toasted the bread, then BLTs tonight, toasted bread again.  I felt like I was cheating lol, so, much that I didn’t miss having potato chips with my sandwich lol  I named a “chips with sandwich type”  I haven’t tasted it not toasted, but, grainy is grainy, toasted or not.  The bread is thick like normal bread, but, the size is smaller, probably like an inch shorter, around.  I will totally be buying more and if they come out with new products, I will definitely try that too.",

    "The flavor is amazing but this is overpriced. I didn’t realize I could buy this at Kroger for much less.",

    "Excellent low carb option. This bread has helped to keep us on track with our low carb lifestyle. We enjoy using it for BLTs, toast, turkey clubs, etc. I also made a low carb bread stuffing with it. Highly recommend",

    "I LOVE THIS BREAD!!! This is the absolute best keto friendly bread out there. Best toasted",

    "I have tried other keto friendly brands but they never quite nail the texture of real bread.  This comes pretty darn close.  I just ate toast with butter and stevia-sweetened raspberry jam and I couldn't taste any difference between this and the \"real\" stuff.  I'll likely be buying this on a subscription.",

    "Taste is pretty good, but let’s be honest. The three loafs of bread are equal to 1 regular in size. The reason this bread is low in carbs is each slice is half a regular slice. So your eating tea party size sandwiches",

    "I'm so happy I purchased this bread. Being on a low carb diet is so hard but this makes it easy! I'm eating my sandwiches, grilled cheese everything I enjoy with bread without the guilt!",

    "These are delicious, just wish they would be a bit cheaper. Compared to other low carb breads, these are the best, taste and consistency wise I found so far.",

    "Best Low Carb Out that i've had. Highly recommend. down 20 lbs and this will make my low carb journey way more enjoyable",

    "Very fresh",

    "I received my bread last night & couldn't wait to try it for breakfast this morning. It's delicious. I had my daughter try a slice. She was surprised and enjoyed it. It's the best bread out there for keto or low carb diet.",

    "You can have you bread and eat it too!  I’ve tried a few low carb breads and this one is the best!  It’s a little expensive but if you are committed to investing in your health it is well worth it!  I just ordered the hamburger buns and am excited to try them!",

    "Like it",

    "I LOVE THIS BREAD",

    "This bread is very good and fresh but the loaf is very small. As you can see in the picture I attached, I made two sandwiches on the 6” plate. It’s like one sandwich is about the same as a haft sandwich on regular bread. I would pay between $5 to $6 but not $10 a loaf. The second photo shows a regular slice of white bread and a slice of the Sola bread.",

    "This bread is really, really good toasted, grilled, fried etc...Someone said \"don't be fooled\" well total carb is 9, net carb is 2 (YOU NEED TO SUBTRACT THE FIBER Y'ALL) That being said, price is high on-line.  I get these loaves for $5.99 at safeway.  And she also said a regular slice of white bread is 13 carbs???? What bread are you looking at?  regular white bread ranges from 18 - 30 and if it is Sour dough goes even higher.",

    "Texture closed to regular bread. Toasts like bread, time is a bit different. Price isn't the best, but as Keto foods expand, price will drop.",

    "The VERY BEST BREAD I’ve had in two years!!!  LOVE the flavor and texture!  I’ve tried many recipes for keto friendly bread and this is the only one that works. I received it and toasted a piece right away to try it then toasted a second piece just to make sure and it was AWESOME!  A little pricey but worth the money especially if you haven’t had bread in a long time. A very good buy!\nSo far I have made French toast that was awesome and grilled cheese bacon sandwich which was to die for. You must try this bread!  I NEVER leave reviews but this deserved one.",

    "I like your bread overall but will not be purchasing again as it is not GMO free.",

    "Love the texture and flavor.Perfect for my Low carb low sugar diet. I will be buying this bread again.",

    "Good texture.",

    "It’s great to be eating sandwiches without compromising my diet choices again! These loaves are a great substitute, albeit expensive. If you can swing the price and are on a keto diet I highly recommend it.\nI had a shipping issue where the first batch did not come, but after a few back and forths with Sola customer service they resent free of charge and now I’m happily noshing away at their product.",

    "Good quality!",

    "It’s pricey but worth every penny! The sweet & buttery is the best flavor! Best keto bread I’ve had and I have tried a lot. Just ordered my mom some and just placed another order with it. Can make stuffing, French toast, etc and still eat healthy!",

    "I was shocked at how small this \"bread\" is, almost 4\" square, really! It's laughable. It has a spongy like texture. Plenty of bread recipes online that are better and cheaper. Stay away from this \"bread.\"",

    "I love grilled cheese with this bread.  Add a little meat sometimes.  Yum!  The only problem is I am on a fixed income and it's a little on the costly side.  I'll continue to treat myself every once in awhile...",

    "BEST Keto bread I've ever bought/tasted, and I've tried several 🙄. Toasted Yummy 😋!!  Good stuff, just ordered some more.  Definitely recommend 💖",

    "Better than expected but, still has a little after taste that doesn’t agree with me. Better if toasted.",

    "I have been on Keto now for about three years and I tell you the hardest thing about Keto, for me, is staying off the bread. I know, it's completely dumb but I love bread. I've tried a lot of the Keto bread and a lot of them are pretty good. I've even done the Keto bread from Aldi, but honestly, it's not very good. This Keto bread though is my all-time favorite. I am so stinking picky with my bread and especially with my Keto bread and this one is the only Keto bread that ticks all my bread boxes. The taste and texture are spot on to normal bread. It toasts and fries up like normal bread and just tastes amazing. There's no weird after tastes, it's not so thick and dense that you feel like you're chewing thick sponges and it doesn't make me go to the bathroom like I've not been in over a year. If you're on Keto, you know what I am talking about, lol. This bread is just the bee's knees and honestly, the only problem I have with this bread is the price. Being Keto can be so pricey and this bread is proof. While it's not as expensive as some of them, it's still high priced and I really wish it were cheaper but I am totally willing to pay it when I can to have such good bread every now and again.\nOh, and it freezes perfectly too. I get the three-pack and throw the other two in the freezer, and while the edges so get a bit harder for my liking, it still tastes great and honestly, if I am making toast or a grilled sandwich, you can't even tell.",

    "Keep the box, it may taste better! If you like Whole Wheat, this is the bread for you! As you can tell, I'm not a whole wheat fan.",

    "I am very fortunate that I ordered three shipments last time.\nI tried to order more yesterday, but you had sold out.\nFortunately my wife found the last shipment in our back up refrigerator\nIt seems to be working for my low carb diet",

    "I didn’t like it! It tasted nasty to me . It was really small! I couldn’t even make real sandwich out of it. But the good part- was it was fresh when I got it. But I don’t think I’ll purchase from seller again. Highly disappointed",

    "This bread is DELICIOUS! It taste liker reg bread slices are small but thick.",

    "Soft, 😋 delicious!",

    "I have one word to say about this bread “YUMMY!!!”",

    "Delicious. Is pricey but if you've ever attempted baking your own low carb bread, it's worth it. I keep extra loaves in freezer.",

    "The true test of bread, for me, is whether I can eat the heel or not. This bread was good! Soft. Just a hint of sweet.  It’s no King’s Hawaiian. But. In a pinch it’s amazing.\nFor those looking at carbs. Don’t forget to subtract the stevia/erythritol.",

    "As advertised",

    "The single bread size is incredibly small compared to a typical loaf, and tastes overly buttery.  Over priced for size and resulting  3 loaves!",

    "It's like it's been sitting out for a few days.\nVery disappointing usually VERY fresh.",

    "Amazingly close to regular bread. I’m in heaven thank goodness I found this. Keto had me craving bread so badly this helps so much.",

    "Very fresh and tasty",

    "The slices of bread are TINY.  They taste good but I couldn't fit a burger on one.  The loaves are about half the size of a loaf you would buy in a store.",

    "CONS:\n- Delivery takes way too long and has too wide a range of possible delivery dates\n- Delivered in box that is not Amazon, and does not say \"perishables\" or \"food\" on outside of box\n- Does not notify you when its delivered since Amazon doesnt handle the deliver (its USPS)\n- Deceptively SMALL size! Each slice is MAYBE 3.5x3.5inches. A bit bigger than a standard sticky note! The loaves are not that long either, maybe 8 inches? So that really hikes up the cost to amount of food ratio even higher.\n- Price\nPROS:\nTASTE - Pretty much identical to regular bread! No aftertaste whatsoever, has full flavor.\nTEXTURE - Pretty much identical to regular bread, slightly on the dense side\nToasts lovely\nTastes good on its own (buttered toast) or in sandwiches, etc\nReally does have only 2 net carbs per slice compared to 21 net carbs in my normal bread - INCREDIBLE!\nMy biggest complaint is that, given that the only bad experiences with this bread (according to other reviews) is that it sometimes arrives moldy, so the company is obviously aware that freshness is critical to this product... I think shipping should be a priority. It was 5 days between when I ordered it and when it arrived, but it was shipped via UPS, which estimated a wide, 5 day window as to when it would arrive (Anytime between Dec 10-15). Unfortunately, this meant that I did not receive any email notification that the package was delivered as I would normally receive promptly when amazon delivers a package; and The package was not identifiable... it was a plain brown box (much smaller than I imagined..) with no label saying \"food\" or \"perishable\" or anything else identifying. So with all the other packages arriving for Christmas, the package got shifted aside into the garage by someone else, I had no idea it was delivered since I received no email, and the package wound up sitting outside in the heat for 2 full days! When I happened to log onto amazon and look at my orders page, I realized in horror that it listed the bread as being delivered two days ago! I had planned to bring it inside immediately and put most of the bread in the freezer due to the obvious increased perishability. So much for that. Thankfully the bread still looked completely fine so I went ahead and froze most of it anyway and left some in the fridge to eat shortly. I was ready to give this a 2 or 3 star review for the shipping alone, but after we tried the bread I thought... all the trouble is worth it. Taking a sandwich down from a whopping 42 carbs to 4 carbs is worth it, even if I have to pay too much and even if I have to deal with long, inaccurate shipping, and even if I occasionally get a moldy pack.\nSELLER:  Please find a faster way to ship this product to preserve freshness. Please label the box \"PERISHABLE.\" And perhaps see if there's a way to automatically notify customers via email or text when the parcel has arrived. This would make me a much more enthusiastic customer ready to recommend your product. Otherwise I can only recommend with several reservations. I do have to commend you for making such an amazing tasting bread without the carbs. Truly incredible!",

    "This bread is so good. I can’t believe it’s keto, it tastes like regular bread. I use it for sandwiches, toast, etc.  I can finally eat bread without gaining weight!  A dream!",

    "I'm thoroughly impressed with this keto bread! Many I have tried tasted terrible, but Sola sweet and buttery is fresh, tastes fantastic and worth every penny.",

    "I’ve been on a lo carb for over a year with bread being the one thing I missed the most.  I loved the three loaves I bought but the price is too night for this little loaf. I can’t justify spending almost $9 for a loaf of bread.  I hoped for a coupon when I bought it but there wasn’t one.",

    "First of all the bread taste really good almost cant even tell its keto bread but it totally stops there I feel cheated the size of the bread is soooo small I'm talking like the size of an english muffin and its 3 carbs per so one sandwitch is 6 carbs witch isint really that keto considering how small it is you would be tempted to use 4 peices of bread like I did because they are so small I will not buy again Taste Was really great but just not worth it for me",

    "The best keto bread ever",

    "I have been quite happy with this bread.  I have tried others and was not pleased with them.",

    "I'll buy again",

    "Tasty. Good size bread.",

    "I received this today and I could not wait to try it. I read all of the other reviews most of which said you should probably toast it first so I did. It was phenomenal! I am on the keto plan, and I have not had bread in a while so this really made my day! I had a chicken and spinach sandwich. If you’re doing keto you really want to try this bread!",

    "This bread is expensive but if you are trying to go low net carbs this is the best route. I tried making homemade low carb bread “keto” recipe but it was awe full and this taste possibly better than regular bread. The texture is very nice, soft and fluffy, very fresh right out of the box, shipping was faster than predicted. I love it!!",

    "While I really like this bread, I am very disappointed with the way it’s sent to the consumer. As you can see by the photos, it’s very hard to make a sandwich with this bread. And, I sent photos to the company and they never responded back. They did respond at first but once I sent the photos, never heard back",

    "It's great to be able to eat a real sandwich occasionally when following a Keto diet!  It is expensive but if you are looking for a good option for bread while doing keto, this is it.  Arrives promptly.  Only problem I have is keeping my husband from eating it all before I get any!",

    "This keto friendly bread is tastes as close to “regular” bread as I have found.  I’ve re-ordered it at least 4 times.  It’s a bit pricey and that’s why I didn’t give it more stars.",

    "We ordered this product as it is low Carb and wanted it for Thanksgiving .All 3 loaves look like rejects the photos tell the story ,not fully baked and flattened , and at almost $10 .00 per loaf we expected better !",

    "I have tried a few of the Keto/Low Carb breads that are available on Amazon, this is my favorite so far.  It is a little pricey and I had to buy 3 loaves, but it does have a really good texture and flavor.  I use it for sandwiches and toast and don't notice a lot of difference between this and normal bread.  I put it straight into the freezer when I received it and I just take out the slices that I will be eating to thaw as needed, so freshness has not been a problem.  I will definitely buy again.",

    "It was such a relief to finally find a product that lived up to its claims to be low carb, delicious, and nutritious.  Thank you. However, too many times I’ve purchased loaves that were moldy.  This has happened to me regardless of whether I purchased online or in my local grocery store.",

    "I’m a chubby guy who eats too many carbohydrates.  I love bread and potatoes like a good Irishman should.  I was very hesitant when ordering this bread as I assumed it would be like eating paper. When I first opened the Amazon box I saw that the loaves were smaller than I expected as the slices are smaller than regular slices. I was surprised by the texture as it has a bread-like texture. I’m happy to say that it tastes pretty good and I’m happy I won’t have to go without a healthy bread alternative.",

    "If you’ve tried other low carb breads and hope this one is going to be better. Nope, it’s as yuck as all the others.",

    "The taste of the bread (?) was good.  It was so smashed up and small that it could hardly be classed as sandwich bread.  The cost was ridiculous!",

    "Tasty",

    "Bread is great! You can find it a lot cheaper at Costco or HEB.",

    "This was so good. Closest thing to the real thing",

    "This bread is amazing!  I couldn’t tell it was low carb.  Highly recommended!",

    "The bread was fresh and tasted great",

    "Tasted and had the texture of cardboard. I toasted it and made grilled cheese. AWFUL",

    "This bread is amazing!!!! I was afraid it was gonna taste like nothing but WOW! I am amazed and definitely buying this again! The flavor of this bread is soooo good! If you're a beginner on keto this is definitely a great substitute for bread.",

    "This was a great find. It is fresh with a beyond delicious taste. You miss nothing by buying such a quality prfuce. Love it !",

    "This is very good (I chose the sweet flavor). Good when making french toast, but slices are a tad small for a sandwich. Cost is a bit steep...Not something I can afford to use as everyday item.",

    "It was tasty and fresh, but too  expensive",

    "Didn't have a lot of flavor",

    "see above",

    "This bread is so delicious!  When I received my package the bread was fresh and not squished at all.  I've eaten it plain, toasted, buttered, it's just delicious.  It's pricey but well worth every penny.  I will be ordering again.",

    "Best Keto bread I've eaten yet.  And I've tried a few.  This company really did a good job!!!  I will continue to buy from them, the hotdog and hamburger buns are just as good!!!",

    "For Keto... it's the best!  Expensive!",

    "I would add 10 stars if they’d let me. It’s more delicious and filling than any regular bread. So so so so good and for the idiots that don’t know how to deduct fiber from carbs...it’s actually substantially low carbs and AMAZING flavor!!",

    "Previous poor reviews tipped me off to the obvious.  This \"low carb\" bread is no different than regular bread with two exceptions.  Outrageously expensive and slices half the size of regular bread.  Take a pass and just purchase regular bread.  Thank you.",

    "I know that it claims to be low net carbs, but something in this bread makes my blood sugar spike. Maybe for someone who is not diabetic this might work, but unfortunately not for me. Also it is slightly expensive for a loaf with smallish slices.",

    "Actually love this product. I can get the bread I miss so much with keto with low carbs and it tastes really good.",

    "We love the freshness and flavor of this bread.  My hubby and I have tried other bread and not been satisfied with the taste.  We r doing the keto diet so we are limited.  This bread is wonderful and fits in our diet!!  The cost however, not so much on the budget!!",

    "My go to during my low carb days. I love bread and this definitely gives me the fix I need.",

    "It was as advertised",

    "A good tasting high fiber (4 G per slice) bread.",

    "Love this bread, a little expensive.... but what isn’t when you’re trying to low carb it? Recommend",

    "I do love this bread , it’s not the same size as a  regular loaf but I make a big sandwich with it.  It’s perfect for me! I love the flavor and how soft it is. The only con for me is that I have to order and it’s not available in stores.",

    "Low carb, and tastes as good as regular white sandwich bread. It was fresh and soft when delivered. I ordered the two pack, and put one loaf in the freezer since I likely would not eat two loaves of bread before some would go stale.\nWill definitely buy this again.",

    "It arrived timely and tastes great!",

    "I love this bread. I've missed toast so much since starting a low carb lifestyle, and this satisfies that craving. Must low carb and keto off the shelf items are chalky and taste like cardboard, but this is a life saver.",

    "Best flavor and freshness of keto friendly bread so far, and that isn't saying a lot since most are over priced and taste like cardboard.",

    "Keto Great low carb bread. Folks, it’s 3gm of net carbs! That’s excellent. “Net” is when you deduct the fiber carbs from the total carbs.\nGrilled cheese with this bread never tasted more delicious. I just it for egg sandwich as well. Try it with spread. So good!",

    "One of the most disgusting things I've ever tasted. The taste actually stayed in my mouth for hours after. I cannot believe people could ever like this. Texture is a rubber ball. Awful.",

    "Great flavor. If you love grainy breads this is a must without the carbs.",

    "not much flavor. Expensive",

    "I wanted to like this so bad but I just couldn't . But I cant return it so I will try and use as much of it as I can.",

    "It tastes delish! It's a specialized item but worth the cost. Being on a keto plan its great to have toast with an egg.  Yes, the slices are smaller, but 1 slice does the trick. Anxious to make French toast.",

    "This bread is so good. It is perfect for those doing the keto diet as well. I know most reviews say that it’s best toasted so that’s what I did for a while. However, I lately have been eating it straight out of the bag. I make a sandwich with it, usually peanut butter. I like it better not toasted. Obviously, you can eat it however you like but just saying it is good both ways.",

    "I presumed that because this was touted as a Keto Product that it would be grain free.  However, Wheat and Wheat Gluten are #1 and #2 ingredients.  I'm not even sure its possible to have as low a carb count as claimed with wheat being so prevalent in this product.\nThey also do not allow returns.\nVery disappointing",

    "I did not expect the bread to taste this good.",

    "So happy to be able to eat sandwiches again makes life so much easier meals are so much better when you can eat a sandwich and not feel like you’re blowing a healthy lifestyle",

    "Delicious low carb bread! They are small slices but that is okay!",

    "Purchased both the Sola Seeded loaves (2 pack) and the Julian Keto Bread (3 loaf pack which is the minimum).  Side by side comparison done.\nSola tasted great out of the package slathered in butter.  Tasted great as a cold sandwich with mayo/mustard/turkey.  Tasted exactly like toast out of the toaster.  Grilled well.  Very little bread smell out of the pack and the slices are on the smaller side, but I used to eat Alvarado bakery bread which offers smaller slices so this did not bother me.  It took 9 days to arrival (via Surepost) and at $23.99 it was well worth it.  I wish I had sprung for the 3-pack at $27.99 (which I have now ordered!).  **Important to me was that this Seeded loaf had no sugar/no Stevia.\nKeto bread smell was AMAZING but tasted awful.  The texture was not bread-like (nor cake-like as others have commented).  It never would actually toast without the edges burnt to crisps.  Grilling was equally dismal as it does not become buttery crispy.  Cold out of the pack sandwiches are unpleasant and have a strange taste I cannot pinpoint other than to say its not \"bread-like\".  At $39.99 and waiting 16 days to receive =  HUGE letdown.\nEveryone is different for taste, texture and budget but do yourself a favor, try SOLA in addition to any others.  You might be as thrilled as I.",

    "I have been eating sola bread since I started my low carb lifestyle and never had a problem until my recent order. All 3 are squished so bad that the bread is so small you can barely make a sandwich with it. Its already small and very expensive so I expect high quality when spending so much on bread.",

    "I really wanted to like this bread. It's just not good. Don't try toasting it, it makes it inedible. The texture is terrible. The slices are really small. Overall, a waste of money. I have a loaf still in the freezer I'll probably just throw out.",

    "Great tasting bread with only 2 carbs per slice. There are a lot of seeds in this bread. It’s a good size for toast and making sandwiches. Glad I made the purchase.",

    "Good bread but a little to expensive.  I buy the golden wheat from the store a lot cheaper.",

    "we LOVE this bread!!! it has soo much flavor with low carbs!!",

    "This bread is a must on keto. I am addicted to it. It should be toasted for the best flavor, but it is hands down the best keto bread I've tried.",

    "I'm giving just 4 stars because it was smooshed upon delivery. There were a couple pieces at each end that were ok, but the rest were unusable for sandwiches",

    "I liked it....",

    "I love this super low carb bread! It doesn’t taste like cardboard at all. The texture is the same as bread. I’m very happy there is finally a keto friendly bread that’s similar to the real thing! The only downfall is it’s so expensive. However I don’t more than 2/day. Let alone I don’t eat it everyday. Regardless of real bread or not, when I put at the very back of the fridge, they last for  months!",

    "So I recently started a keto diet and have been looking for alternatives for some of my favorite carbs. Bread was definitely at the top of that list. This product is amazing!! It tastes like regular bread with no weird aftertaste or anything. I even tried it plain with butter to be sure. It obviously super expensive for a loaf of bread but I guess that is to be expected. All in all this was a great buy.",

    "Bought this hoping that I could eat this bread & some what stay on my diet after surgery.  I eat bread with butter to help soak up the anesthesia after surgery so that your not so nausea's.  I tried this bread as toast, grilled cheese & of course plain.  You can really taste the difference or lack of taste in this bread & the bread all so arrived really dried out.  The loaf is really small & so are the individual pieces.  This bread is not worth the almost $10.00 a loaf price & since you can't return it, I'd think twice before you buy this bread.  If you really want to try out low to no carb bread, go to an Ali & try their bread for under $5.00 a loaf.  It's alright but this bread for me won't work.",

    "Nice substitute for bread considering it’s lower carb",

    "It is expensive but keto goods usually are. They taste really good just remember to not eat to many in a day like me.",

    "Bread was like rubber had a not a good taste",

    "Really like this bread.  Now can have sandwich when on keto.",

    "It tastes terrible. I couldn’t finish 1 slice. Maybe after a long time after not eating real bread, I’ll try it again.",

    "This is a very good low carb bread. It is very sweet (think King’s Hawaiian flavor). It is very small and thin, so that definitely is a downer. But, it’s bread, so I’ll take it.",

    "Loved it...soft and good flavor...the down side a bit spindy... but all\nthe low carb foods are",

    "have ordered many times, and is the closest I've had to normal bread, heck  I prefer it.  And that's that.",

    "Very good and moist",

    "Not good for me.  Kicked me out of ketosis.  I'll stick with the Aldi keto bread.",

    "I have tried a lot of low-carb breads in my search for a decent substitute. FINALLY! I love this one. It's a bit chewier than regular loaf bread, but the flavor is good and it holds up well. The slices are smaller, but I can live with that and just compensate with a taller sandwich! A bit pricey, but low-carb is a must, so it's worth it to me. Am about to place my second order.",

    "like it very much .. good flavor, lots of seeds... KETO friendly",

    "I have the same concerns as a fellow reviewer (Karen O’Brien, April 2020).\nMy family went keto for my diabetic father who loves bread so stumbling across Sola seemed like we’d found the holy grail. We find the taste amazing and the texture is identical to normal bread when toasted. I’ve ordered Sola religiously, at times 2 orders (6 loaves) at a time.\nAfter taking a closer look at the ingredients, we’ve decided this will be our final order with Sola. They recently changed their recipe from using soybean oil, which can lead to clogged arteries and heart disease when heated, to olive pomace oil. I had to Google this as I’ve never heard of it. Olive pomace oil is made from the remains of pulp that is left over after Extra Virgin Olive Oil is produced. Unregulated olive pomace oil sometimes contain harmful components known as polycyclic aromatic hydrocarbons (PAHs) like benzopyrene, which research has shown to be highly carcinogenic and mutagenic!\nWe consume this bread on the daily and in the interest of our health, I don’t feel that the ingredients of Sola Bread is fit to be consumed long term. In addition, the quality of the bread has deteriorated in recent orders, with bread that is clearly under-baked in our latest orders (see photos - all 9 loaves looked like this). For $10 a loaf, I hope Sola can work towards building high quality bread with healthy, non-GMO ingredients, that‘s fully baked upon delivery.",

    "Love this bread but not the price- $9 for a loaf! But it’s low carb and doesn’t taste eggy.",

    "its on the small side. dont expect your sandwiches to be big",

    "This bread is good but high priced.  We enjoy it and have ordered it twice.",

    "I am on the Keto diet, and purchased the Sweet & Buttery bread, it is delicious!!! Well worth the money! I will be checking for more Sola products!!!!",

    "Froze two, using 1. Stays fresh and is good flavor. It is smaller than most loaves of bread, but that's to keep the carbs down.  Nice for hamburgers, grilled cheese, french toast and sandwiches too.",

    "would not recommend",

    "It’s a little pricey but if your local grocery doesn’t sell it, it’s worth every penny! Years ago I bought a different brand for 3 times the price and it was disgusting!!! This is the only bread I’ll eat now- I love it toasted with cream cheese and seasoning and with peanut butter!!",

    "This bread is really tasty but a bit on the pricey side, but will definitely buy it again!!",

    "Great bread couldn’t really tell the difference! Soft and has a good taste to it unlike some of these other diet Breads. The slices are a bit smaller than your average loaf but I guess that’s what keeps it low carb! Overall they are good but pricey!",

    "Love the bread but it is a little costly for such a small number of slices.",

    "I haven't ever tasted bread like this.  Texture and appearance was right on.  Taste and odor not so much.  Couldn't eat it.  Fed it to the squirrels.",

    "I highly recommend this bread. It is expensive but well worth it!",

    "I was SO disappointed when I received my loaves of Sola Bread.  I purchases a two pack of the bread from Seller \"Sola Sweet\" for $24.99.  The pics on the website made the bread \"appear\" as full size, even extra large, loaves.  I had to add pics to this review to show you that I do not exaggerate when I say the loaves are mini-sized; only slightly larger than the width of my smallest kitchen appliances!  I can not even comment on the texture or taste because I am SO pissed off by the blatant deception.  $12.50 ea. for a so-called loaf of bread that might make you 6 or 7 sandwiches... Really?!?!  Where's the truth in advertising??  I have no problem paying a FAIR price for a product, but this is ridiculous!  So sad what's happening in our country today... people, companies and corporations literally sell their souls for the dollar.",

    "This bread is the best low carb bread ever.",

    "This is great bread. If you’re on keto, this will keep you going. I highly recommend it, just beware it burns easily if you make a cheese sandwich 😃",

    "The bread arrived on the estimated date and is very fresh.  There is a lot of sodium compared to the other ingredients and the slices are so small that one slice is the size of the palm of my hand.  Yet there are 5 grams of protein per slice and 150 mg of sodium but only 60 calories.  All in all, I will not order this product again.",

    "I can’t express how happy I am to have finally found such a delicious, low carb bread to fit my low carb/low sugar lifestyle! My disease has limited my diet so much since I was diagnosed, & sugar & carbs trigger a major inflammatory response for me! So needless to say, I am absolutely thrilled & overjoyed with the flavor & texture of this Sola Sweet Oat bread! It actually makes you feel like you’re able to eat a sandwich again because of how reminiscent it is of real bread. I simply wish it was slightly cheaper, but only due to the fact that I’ll be buying a ton of it from now on! Lol. 5 stars for sure!! :)",

    "I have epilepsy and the Ketogenic diet has always helped with seizure activity.  But must say I love this bread.  Great taste and price for the bread is so great!!  I usually order 3 loaves, but they were out of stock.  Will next time.  So yes this bread is a must to try!!",

    "The bars that came are really good. The granola reminds me of no bake cookies. Tasted great. The bread....NO! There is no flavor. It is super tiny. Better off buying 647 bread. Normal size and is 6 net carbs. You’d have to eat 2 of these micro sized slices of bread. These would suffice but there is o much more out there that’s better.",

    "This bread is delicious! I can’t tell it’s low carb. It is a little smaller than regular bread.",

    "The bread has a nice buttery taste & arrived in a very timely manner ...it is costly but I will prob purchase again ...",

    "I tried this Sola bread in the buttery  and the SolO low carb country white. I like this Sola bread better. It tastes more like regular bread. The Solo brand was a little too chewy for me. Both of these were shipped very quickly- much quicker than they originally said. The Sola was in a foam insert to keep cold. The Solo wasn't and my carrier just dropped it on the porch and didn't even ring the bell so I don't know how long either was sitting on the porch. I froze right away and just pull some slices out as needed and thaw for about 20 seconds in the micro. I'm glad to have this for sandwiches.",

    "I have tried products in the past and enjoyed them.  So this time I thought I would place a larger order and when package arrived was covered in dead and live ants!  And with a no return policy.",

    "I bought the sweet and buttery bread. I have yet to taste it on its own. But toasted, it tastes just like bread. It’s so good I’m glad I found this. Of course it’s smaller than a normal loaf of bread which is understandable because it’s less carbs and more than likely if you’re looking into buying this, you’re needing to cut down on carbs in the first place.",

    "Weird flavors and slices are very tiny . I bought 3 literally gave them away to my neighbor.",

    "Omg I’m keto haven’t eaten bread in 7 months this bread at 3 net carbs is delicious it’s expensive but worth it made all my Favorite  French toast cowboy eggs sandwich and grill cheese yummy will buy again",

    "Great for that keto bacon & avocado or tuna fish sandwich on toast craving.  Awesome product, but questionable value for the price.  Close to a dollar a slice when you break it down.  I'll still use it, but not as often as I'd like due to the high price.",

    "This has a very nice flavor to it.  I was pleasantly surprised.  Tastes like a regular slice of sweet oat bread.  Will purchase again.",

    "Keto to bread best for sandwiches i did not like the wheat bread it is tough, and taste is not what I expected will not order it again",

    "The bread is good.  Expensive but passes. In the picture it is comparing to a regular cheap white bread. size is very small in my opinion. So the carbs really are not THAT much different than regular white bread if you actually look at serving size. Still a good option for those that don't have the time to bake your own keto bread.",

    "I initially got sent the incorrect item but then the seller rushed sent the bread and let me tell you.. it was worth the wait! After verifying that it was nice and fresh ( because of all the moldy reviews here), I immediately put 1/3 of a loaf in a ziplock bag for the fridge, and threw the rest in the freezer.\nI had so much fun eating sandwiches, toast, and even threw some cream cheese on a slice and had with breakfast. Now i don’t do Keto, however i do try to reduce my overall carb intake and this works just fine. Looks like this is going to be a staple in my diet for years to come.\n* I’m still nervous about getting moldy bread so I’m keeping my fingers crossed on that one.",

    "oh You can see the price is expensive. But before I go further, yes I would by them again. The flavor is good but not the same as regular bread like some have said. It’s not as fluffy. But it’s still good and the best I’ve found for keto, as a regular bread alternative. It’s thick like cake bread, and the bread is really small. It’s like a shrunken piece of bread. Which would be fine if it cost a normal pricing. But being expensive and being a tiny bread is not a good combo.\nBut like I said, I would order again and I do recommend if you are on keto like me. I’m gonna try a different flavor next time just to see what the other ones taste like.\nI wasn’t going to, but I guess I’ll do a photo comparison. Because me saying tiny bread sounds weird and doesn’t give a good visual lol.",

    "My daughter brought the bread, before me, so I new how good it was, will definitely buy again, on keto can have cheese toast, or French toast, what more could I want.",

    "Sola bread is a wonderful find! My husband and I received our first order today, and tried it right away. It was very fresh, and looks, tastes, and smells very much like regular wheat bread.",

    "Taste is great for low carb. Not great when comparing to regular bread of course but definitely edible and comparable to a wheat bread. i really wish it were about half the price but worth it if you're trying to stay low carb.",

    "Product was well packaged and on time. Sadly, the bread has a \"chemically\" taste. If you cut off the crust (leaving about a 3\" square), you could reduce it by half. At $9 a loaf I keep it in the freezer in case it's all I have...last resort.\nI don't often write negative reviews, but the taste was so strong that even w/egg salad. etc. I  couldn't past it. SRY.",

    "Yes it’s 3 grams of carbs per slice, and the slices are small but either way if you are living the keto lifestyle, you shouldn’t be having too much either way. I like it, more so when it’s toasted and either with some cream cheese, a sandwich or just toast. The only reason why I gave it 4 and not 5 stars is because 1 of the 3 loafs I received, half of the loaf was moldy so I just ended up throwing it away.  However, I’d recommend this to those of you who are on a low-carb diet and crave bread. It is pricey but I’d say it’s worth it. I got the sweet and buttery flavored loaf.",

    "I got the bread today and made a grilled ham and cheese sandwich.\nHere's my take on it: The bread tastes like traditional bread, which was awesome. The texture is soft and spongy.  The actual size of the bread slice is smaller than \"regular\" bread, which is totally fine! Seems that you can make breadcrumbs and croutons with this bread too!\nTomorrow morning I am going to try French toast! can't wait to see how it turns out!\nNote: French toast was really good! Also tastes great toasted. Perfect for my keto lifestyle.",

    "I enjoy being able to eat bread again however, the small slices are difficult to build a quality sandwich.  Great for toast.",

    "Flavor was good and I put it in my freezer right away to preserve bread. I just tossed it in the toaster when using it. The slices are really small. Over all not worth 27$ for 2 loafs. Maybe if slices were a bit bigger. Not sure if I’ll re purchase but it’s good if you’re looking to spend that kind of money on a loaf or 2.",

    "I have been using the product for some time. So far, I have purchased it at least 3 times. It freezes and defrosts very well. There is not change in the quality of th bread or the taste after freezing or defrosting. Another reviewer commented that it tastes best toasted, this is TRUE. I have made tomato, avocado, cheese and so many other sandwiches. The slices are small, but keep in mind that if you counting carbohydrates this makes sense. I have also tried the Keto Bread by Julian Bakery. It's also a great product, but it doesn't taste as nice as Sola. The price is almost double. I would have given the product of 5 stars, but I knock off a star because of the advertising. For those of us with a background in nutrition, I am almost certain you can only subtract the fiber if its 5 grams or greater. I could be wrong. There may have been a change to guidelines that I am not aware of, but after doing my research I did not read anything that told me otherwise. For those of you that are diabetics, please keep this in mind. Now in comparison to regular bread, this is a better and healthier option.",

    "For those who’ve been on anti inflammation diets for a long time, this is a godsend.\nIf you’re still accustomed to big pillowy Italian bread (that I adore and dearly miss) this won’t feel like a 1:1 conversion for you.",

    "This bread is great. I order it by bulk on the site now.",

    "Not worth it has 4 carbs and mostly they just cut the size from regular bread for that size regular bread has 4 carbs and it’s not this expensive",

    "This is a great bread!  As soon as they arrive, they go in the freezer and I eat them in a month or two.  I have never had a mold issue or any other issue for that matter.  I can finally eat eggs and toast again!",

    "I was shocked when my order arrived, and how small each loaf actually is!!! Look at these loaves of bread in comparison to the TV remote control!!! I had no idea these loaves of bread are so tiny! For the price, I was expecting full size loaves of bread.",

    "Taste like real bread",

    "I follow a low carb diet, so bread is something I really miss. This bread is delicious and does in fact taste buttery by itself.  I love using it to make cinnamon toast, sandwiches, and as a substitute for hot dog buns sometimes lol When toasted, the outside is crisp but the inside is still noticeably soft and \"bouncy.\" I will say that the only thing bad about this bread is that it's so good that it's easy to overeat. At 3 net carbs per slice, it's easy to reach the 20g net carbs for keto if you eat this too often. The bread slices themselves are about 2 inches by 3 inches, so it's pretty small and very tempting to have another slice. The price is steep, but if you really want that bready goodness try it and treat yo'self. Slap some Kerrygold butter on a toasted slice and tell me it's not good. :D",

    "Honest review here. The loaves are much smaller than I expected but that’s my fault for not reading the package. I initially made a grilled cheese with the bread and didn’t care for the flavor too much. But this morning, I toasted some in the air fryer and added butter/garlic salt and ate it with my eggs and it was delicious. It needs a little extra flavor and the air fryer helps toast it to a crunchier level which is crucial in low carb diets. Overall, I find 12.50/loaf a little overpriced but am not dissatisfied with the product.",

    "The bread arrived early, was very fresh, and well packaged.  It is a good replacement for regular bread. It toasts well and the texture is fine. However, I find the bread too sweet, it interferes with the flavor of whatever I put on the sandwich. I will try another brand the next time.",

    "I will not be buying these again, I feel that they had an odd spongy texture. And are so expensive for the 3 small loafs you receive.",

    "expensive and taste and texture of cardboard",

    "Awful!  The smell and the taste is awful!! It's pricy but I would have gladly purchased more had it at least been edible. YUCK!  There is another Keto bread that Amazon sales I'd buy that over and over annnnd over again before I would EVER buy this product again!",

    "very good",

    "Love the sweet & buttery!! Toast it and add some avocado or a little peanut butter...delicious! Or even make a grilled cheese. This was a great find!",

    "Wouldn’t buy again, so expensive and I can find lower carb bread at the store.",

    "The taste was ex celebrity!",

    "I was skeptical after trying other Keto bread brands, but this bread is as close to regular bread that I’ve found. It actually tastes good! Smaller in size than regular bread, but I am thrilled!  All loaves were fresh and not molded.",

    "Good bread. Too expensive. Thankfully, Costco now carries a very good low carb bread at a much lower price.",

    "A little expensive but great tasting.",

    "Keto bread is never delicious, but this is decent. The pieces are TINY, but this is good in a pinch if you want a piece of toast with your eggs or just need a quick snack. I do need to slather it in a ton of butter, but that's keto right? I ended up freezing 2 of the loaves and keeping the other in the fridge. Lasted quite a while in the fridge. If you're doing keto and really craving bread, this may help a little bit.",

    "I love this bread. It arrives fresh and freezes well.  It is also delicious. Perks up any sandwich.",

    "Best tasting low carb bread I’ve had. Will order again!!!",

    "Sadly doesn’t taste as amazing as I was hoping but 🤷🏻‍♀️\nMy first ever keto bread. Regular bread is definitely better. Hopefully the next one I try is bread worthy.",

    "I have had several keto approved breads and they are usually tolerable and more or less taste like a sponge. BUT THIS BREAD IS EVERYTHING! It actually tastes like you are eating REAL bread. I am on a keto diet and I often miss having things like sandwiches or French toast and this bread made it taste like I was not on my restricted diet.\nMade for great croutons and used in my keto meatloaf.\nWonderful product.",

    "This is somewhat expensive, but is good and also low carb, which is what I like.  I am pleased with this bread.",

    "Great to have a low carb option for the occasional grilled cheese sandwich. The loaves are a bit small for the price but totally worth it if you have a bread craving!",

    "Great taste",

    "I love sandwiches. On a low carb diet it was a dream. I like all the breads. The bread toasts well.",

    "Pricey but delicious. It is very satisfying to the Carb deprived.",

    "I really enjoy this bread. It's a great option when you don't want to bake and just need a quick grab and go food on keto. It makes great sandwiches and is good as toast too. I prefer this to any other keto type bread I have found so far.",

    "I didn’t like the taste or texture. I didn’t feel it was worth the money",

    "Taste exactly like normal bread (Sweet and Buttery). Only downside is the side of the slices and the price. But if money is no object for you this is efficiently the way to go!!!!",

    "Omg I can’t believe I didn’t try the bread before!",

    "I love this bread !! Nothing else to say !! It’s amazing!!",

    "After doing well on keto for nearly 4 months, I've recently had major keto burn-out. For the past few weeks I just lost complete interest in my keto menu. Meat, fats, eggs and veggies just taste wet, greasy, boring. I can't finish a meal so my stomach is growling a half hour later. I'm always starving and exhausted. Last few days I've resorted to extra fat bomb nibbling, which has stalled out my weight loss. The worst part is I'm constantly craving bread. I've tried switching up my menu, adding more variety, fiber, etc., but bleh. I had just about given up on my keto diet.\nAs a last resort, I ordered some Sola bread. It finally arrived and I could hardly wait to try it. I made a grilled tuna melt with butter. I thought I'd died and gone to heaven! I can't believe it's only 3g net carbs per slice. As I was eating it, I enjoyed it so much I thought \"I don't even care if it's not low carb - it's so satisfying!\"\nAnyway if you're doing \"no grain\" keto, keep in mind this bread does contain grain flours and gluten as well as soybean oil. So the strictest keto dieters will not approve. But! As a treat I doubt there's serious harm. My two-slice sandwich did not knock me out of ketosis, so I feel pretty confident/comfortable that I can enjoy this bread a couple times a week when I just NEED bread (and those almond flour/fat head buns just won't do). I can get through most of my meals knowing I will not longer have that depressing \"I'll never eat bread again\" feeling. I can't wait to try french toast or a breakfast sandwich.\nThank you Sola for saving my diet! Delicious!",

    "Amazing! Please realize that you are factoring the fiber out of the total carbs. Any reviews complaining about the number of carbs are factually inaccurate.  This bread has made my keto diet so much easier.  My son even likes it.  Think awesome grilled cheese! Shipping has been faster than expected.  I am hoping that with more users the price will go down.  We are restricting our purchases based on price alone.",

    "I like the taste and the texture.  Toasts well. I keep it in the fridge and it doesn't dry out.  All in all, the best low carb bread that I had tried.",

    "I actually liked the taste and texture",

    "When I started KETO what I missed most was sandwiches, hotdogs and burgers. Now I don't. I have had one small issue with Sola they shipped the wrong product but quickly corrected it. I have been ordering bread and buns for months and have never received a moldy product. They now have hotdog buns and they are great. Some people have complained about the price. I say don't! Everything you purchase that has KETO on the label is over priced. It is the price of being on KETO and eating all of the foods you like. Keep it up Sola I am still buying. :)",

    "Sorry but this bread is not good at all, I made French toast out of it, and it was very soggy, and I cooked the heck out of to help with the texture.",

    "It is so good - makes fantastic toast!  I keep a half loaf in fridge then put the rest in the freezer and pull out as needed.  I can’t tell the difference when I make sandwiches or grilled cheese.  Try spreading with low sugar peanut butter then sprinkling with Lily’s chocolate chips - a great treat!  I have bought Sola bread many times and have always been happy with it.",

    "Disgusting taste and just isn't like regular bread, it's more like a fruit cake.",

    "Food item delivered to a mailbox. Exposed to the elements for whatever days it takes to the buyer to get to mailbox. Not acceptable. Food should be dropped off at front door.",

    "Quite small, quite pricey. But they toast very nicely and taste wonderful!",

    "AMAZING!!!!!",

    "My fav keto bread!!! The texture, taste and consistent is extremely similar to regular white bread. I have tried soooo many other keto breads from other companies and from making them at home. I've come to the conclusion that nothing compares to the quality and taste of Sola! 😍😍😍",

    "A little expensive for bread, but a good taste. I freeze until I'm ready to use.",

    "very yummy, guilt free",

    "Low carb because slices are so small",

    "I was extremely nervous about ordering this bread but I read several great reviews about it so I took a chance. It arrived days before the tracking number had predicted so when I got the package I was completely shocked. Based off the reviews many people said the bread is much better when toasted or grilled so I decided to make a tuna melt. When opening the bag a wonderful smell of butter hits you first, when I squeezed the bread it had a good texture as well. After making the tuna melt a little on the dark side to see how crispy the bread would get I would say it’s satisfying. When biting into it it gives a small crunch and as you chew it crunches a little more, nothing like regular bread but enough to satisfy my crunch need. I would purchase again.",

    "Price too high",

    "Best bread for a diabetic! The bread is number one for me. I will re-order.",

    "No complaints",

    "One of the loafs came in with mold on it.  They did offer to replace the loaf if Insent pictures, but after seeing how moldy the loaf was, I just couldn’t eat any of it.  Check your loaves carefully before eating.",

    "Love the taste of the bread and the low carb factor however it is a little expensive.",

    "Very good. Great for sandwiches",

    "good glavor",

    "Great taste & texture. Perfect for Keto. Almost too good, hard to not eat the whole loaf. Love it, my fav bread. Wish price was lower.",

    "Love it!",

    "This bread has pretty good flavor; it has a slight after taste but nothing to offensive. The slices are small and thin. If you want a \"small\" sandwich this may be what you want. I do not object to the size or flavor; the problem for me is the texture, carbs and the calories. If you are okay with white bread there is a brand that has larger slices with fewer carbs and fewer calories and a significantly lower price. As for the texture, both brands have a slightly chewy texture as though they had been left in the  microwave a little to long.",

    "Finally! A Keto bread worth eating. Came super fresh, took a week and well worth it. It's a little \"spongy\" but has a trud bread consistency, not crumbly,  great flavor and as close to regular bread as I've found.  A little pricey but as I'm eating virtually no bread, it's worth it. It toasts great and I enjoyed it in a proper breakfast  with my soft boiled egg this morning. Will definitely order again.",

    "A fool and their money will soon part ways. One of the stupidest purchase that someone in my house-made.\nUnbelievable, yes that is right $24 for two small loaves of bread.",

    "The bread was ok I just didn’t like all of the seeds that were in it. The slices are a lot smaller than “normal” slices of bread. It also arrived in a timely manner and luckily it did not mold and I’ve had it for three days and it’s still fresh and soft. Overall I would recommend this to anyone who is trying to eat healthy or low carb.",

    "I am excited to have a sandwich with good bread. This is amazing.",

    "Not what I expected. I spent quite a bit of money for something we did not enjoy. The first bite seems ok but as you bite more into the bread, it has a weird taste. Looks like bread but the taste and texture are just way off. Pretty disappointed.",

    "Wife asked me if this was witchcraft cause this bread is so good",

    "Baby bread over priced just go to the store...",

    "Let's just get the bad stuff out of the way.  9 bucks for a loaf of bread. 9 BUCKS. SMH. Now that we've covered that, the bread is good. It's a game changer for low carbers.\nYes, the bread is little. I saw several complaints about that. The bread is cheese slice size. It's not like munchkin size. If this bread were a person, it wouldn't be Kevin Hart. The bread would be Jon Snow. Compact, yet badass. And does size really matter here? Put a bunch of meat and cheese in there and move on with life. It's like a half inch difference people.\nMoving on, I don't even want to know what's in this bread. I started to look at the ingredients but decided ignorance is bliss. When eating my first sandwich, I didn't feel deprived of anything or like I was eating fake bread.  It was a legit food experience. If you can afford it, buy it. If you're desperate for bread like I am, you'll like it.",

    "This is the best low crab bread out there, and I've tried many. The texture and taste is so good! This company is great to work with too! I had an issue and they responded really fast and made it right within two days.",

    "It tastes very close to ordinary bread. It is soft when eat fresh upon delivery. I put two in the freezer and will last me for many weeks. It will lose some softness after freezing but acceptable.",

    "This bread is very tasty and smells good when it's in the toaster.  I like all of the Sola Sweet products.  You can't beat them if you're looking for taste.  It is a little pricey though.",

    "I love this bread, which I discovered when I started a low carb Keto diet.  While I love the bread, the slices are smaller than traditional bread and the cost is a lot more expensive.  Still when I have a craving for bread, this is my go to choice.",

    "Tasted just like I remember  buttery bread . Ive been on keto 2 yrs now and havent quite found a good substitute so I skipped it . This bread is well worth 3 carbs per slice it toasts up nicely. it is a little pricey but It is delicious  Thank you😃",

    "Wow!  I can eat bread again!  I was so pleasantly surprised by how delicious this low carb bread would taste.",

    "This bread has been the best low carb bread I have been able to acquire, but it's expensive (almost $10 per loaf after taxes and such)! It's pulled from a freezer and shipped to you after it's been made. Once it arrives, it's thawed out, but still fresh. Afterwards, you can put a couple of them back in the freezer and the one you leave out will stay fresh for a while. Haven't tried toast with it, but we have made French toast and it's hard to tell the difference. Throw on some powdered Swerve and some low carb sugar and you've got breakfast! Thanks, Sola!",

    "You will not miss regular bread. So yummy",

    "From the moment I opened up the package, I knew this bread was going to be a winner. It tastes amazing, toasts nicely and makes great bread crumbs. I have been on keto for months and missed having a simple sandwich for lunch or toast for lunch. This brand is the best of everything that Ive tried. I would have given it 5 stars across the board if it was not so pricey. Nevertheless it’s 1000% worth it.",

    "Small loaf and slice are half the normal size.  Not worth the price!",

    "Worst “bread” I’ve ever had. Toasted 1 piece and threw all 3 bags out. Save your $$$. This stuff is disgusting.",

    "This bread was DISGUSTING. When it arrived it smelled so good I thought it was promising. I made a grilled cheese with it and I can’t even describe the taste but it was soo nasty. I’m really not sure what the hype is all about. Not worth it for the price.",

    "Lo carb Am diabetic",

    "Legit BEST keto bread I have ever tasted. Small, but so flavorful. It’s so good!!",

    "I've ordered this bread multiple times as my family is keto and we have been looking for a low carb bread. The bread itself is delicious, and even though its very expensive I'd be willing to pay it except for one thing. In looking at the nutrition label I was focused on the macros - and I neglected to look at the ingredients.\nThen - I started breaking out in a rash all over and my body was very inflamed and had digestive issues, extensive enough that I needed to visit a doctor and took weeks to eleviate. As a result I took a look at the ingredients - wheat gluten, soybean oil, tapioca starch wheat flour, rolled oats, soy flour, soy lethecin, enriched wheat flour, guar gum. For me, this bread contains some of the unhealthiest ingredients Ive encountered in a long time. Years ago I cut out a lot of processed foods from my diet specifically because a lot of them contained some of these chemical additives but its been years since Ive seen all of them in one food. I'm not strictly gluten free but I do find that unless I'm eating organic wheat or oats that the chances of it being GMO or processed in roundup are pretty high and I feel like crap consuming it over time. Also - soy is a cheap additive for processed food, but for a lot of women like myself soy messes with my hormones.\nId ask the owner of this company (who Ive read is a chef) is it possible to create a low carb bread that doesn't have so many unhealthy chemicals and ingredients in it? Given how many cheap and \"dirty\" ingredients are in it, why is it so expensive?",

    "For being a low carb bread, this product is great. The cost is extremely high for what you receive. These are not normal loaf sizes and even though the product is great, I just don't feel a loaf of bread should cost that much personally. I will buy again though because there are not a lot of options for low carb bread. It is definitely better that a couple others I have tried.",

    "I ordered the sweet and buttery flavor. Arrived fresh and tasty. To me, tastes like sweet wheat bread. The loaf and slices are small. As many others have mentioned, it tastes better toasted or grilled and buttered. A decent option if you don’t have the means to make your own low carb bread",

    "***update to my previous review***\nAlthough the bread did arrive molded, customer service was superb and quick to respond. I ordered the Sweet Oat flavor after my sister raved about this bread. While it was disappointing for the bread to arrive molded, I tried the bread that my sister ordered, and it was delicious! I will order more in a different flavor to try again because I think it’s worth it. My sister has never had a problem with the wheat bread molding and she said it lasted 2 weeks in the fridge for her.  She’s only ever had issues with the sweeter flavors.",

    "We love this bread! Delicious...",

    "Thanks you",

    "The total carbs aren’t necessarily low here but the net carbs are great if you are watching carbs or are on Keto. The slices are smaller but filling. I think the taste is great (only tried the golden wheat). The only complaint is the high price. I buy in packs of 3 and keep the other loaves frozen until I need them. This is a go to food for me in Keto and the best low carb bread I have tried so far. I will keep buying!",

    "Just awful!!! So full of mold!! Yucky!!!!!!",

    "Had a weird taste - if my eyes were closed and someone gave it to me to eat I wouldn't recognize it as bread or anything else I ever ate before.  Not a fan.",

    "Liked that it arrived fresh. Tasted good toasted and untoasted. First time having this bread. Tried it because my other bread was out of stock. Would buy it again.",

    "Eggy flavor at first but you get use to it",

    "The sesame bread is fine, but this seeded bread has an off taste or smell. Bad batch? Expensive, and not returnable.",

    "Expensive but the taste is much better than other low carb choices.",

    "Delish!! Awesome bread",

    "Great",

    "OMG! This bread is amaze-balls! I have been eating low carb since waaaay back when Atkins first came out so trust me when I tell you that I have pretty much tried every low carb product ever produced. Low carb bread has always been hard to come by and the ones that were out there weren't very good. I didn't expect much from this bread having tried so many over the years but WOW was I blown away. I actually ate 2 piece straight out of the bag before I even got around to making a sandwich. If you've ever tried those semi sweet Hawaiian rolls, this bread tastes a little like that but not quite as sweet. It may seem a little expensive but when you consider that good quality high carb bread is $5-6 and most low carb bread in the stores is around $10, this lands somewhere in the middle. The pieces are a little small but I'm find with that because it helps keep my portions I check. Used last night on a beyond burger sandwich and this morning again on a veggie sausage, egg and cheese sandwich. Worth every penny. Eating low carb never tasted so good. Will buy again and again and again.",

    "I was nervous about placing an order for 3 loaves of bread I never tried before for $30! But, I negotiated with myself that I can freeze the bread and slowly eat them for the next 6 months without sacrificing any of the goodness. I received my order yesterday, and the taste test did not disappoint!\nRight off the bat, I was concerned at the denseness and small size of the bread. It felt as if I was holding a slice of pound cake. My second concern was it instantly began to brown out of nowhere in the toaster and I had to quickly intervene to save my slices. This can't be good, or so I thought.\nI tried it without butter first and it was great!! I was eating the Oasis flaxseed brand since it's readily available in my neighborhood markets. They're literally rocks when toasted and at 6 grams a slice, but the Sola bread was soft on the inside despite almost burning the toast and for half the carbs! I compare it to a slice of wonderbread from childhood. I spread some butter on the slice and it was pure joy.\nReally happy with the purchase as it's going to make my keto diet go a lot easier during the lockdown. Grilled cheese, avo toast, blt's, tuna melts every day.",

    "Ridiculous price gauging for a tiny piece of bread. I purchased two bags total 6 loaves of this kind of bread. However, it is way smaller than the regular sandwich bread. And the price is gauging. I am going to report to the Amazon for hoarding.",

    "I have been doing without Carbs for months and was thrilled to find a low Carb bread, after tasting this, i will continue to do without bread.",

    "I HAVE TRIED OTHER LOW CARB BREADS AND I DISLIKE THEM.  THIS ONE IS ACTUALLY GOOD. I like it most when toasted. I only have used this while in the office and I get hungry. I toast it and either add avocado and boiled egg..or flavored philly cheese. tastes good.",

    "I would suggest for maximum shelf life or freshness to find out what dates they have outbound shipments actually picked up,  Ot's annoying to see \"Shipped\" mean, \"Shipping label created\", where it's not picked up for 2 to 3 days later.\nThat said, bread arrived fresh and very tasty.  About 3/4 the size of a normal slice of sandwich bread.\nWish it was less expensive, but I will probably buy again.",

    "The first time I receive my bread it was amazing, pricey ,but good.  So,with no hesitation I order again.  When it came in I put it straight into the freezer. The other day I pulled a loaf out to see mold all over it, so in the trash it went... checked the second loaf and yes... MOLD... all over it. This is sad, because it was hard enough to pay this pricey amount for 2 loaf's of bread to be moldy.",

    "Good news: I finally found bread that doesn’t upset my stomach.  Bad news: I can’t afford to buy it very often!\nNo reason for it to be do expensive!",

    "Healthy and soft and seeded. Makes the craving hope away.",

    "Taste is pretty good. To those that are saying the slices are thinner and smaller...of course they are. Low carb dieting is also about portion control. I think the flavor is decent. It came to me very well packaged and fresh. And arrived many days before they said it would. I’m pretty happy with this. The price is high. But so are many keto items. The quality of ingredients is high and the price has to reflect that. I’m pretty happy with it. Bought the 3 pack and froze 2 loaves.",

    "The entire loaf of bread is slightly larger than a dollar bill. This is the biggest rip-off by far. Images of the loaf are a fraud. There is so much loose plastic around the loaf you can't even read the bag properly. Ingredients suck is a sham. There is no way that the star rating is true on this product.\nCheck out the video I just uploaded with the loaf next to a dollar bill.",

    "This bread is really small. It get soggy when buttered for toast. It will do in pinch but not my first choice.",

    "This really does taste like regular bread ! Idk how they did it but I’m so happy they did makes my keto life much easier!",

    "The flavor and quality of this bread is great. But the loaf is very small, which results in very small slices that are approx. 3 inches square. Since I do low card, I like to pile on heavy with the meats and cheeses or whatever and these small slices make that difficult.",

    "Taste was ok but one loaf was so dark it was almost burnt",

    "Very good keto bread",

    "Loaves arrived on time and fresh! I was concerned after reading other reviews that the loaves would arrive stale or possibly molded but I had no issues, the 3 loaves arrived fresh, soft and by far the best tasting low carb bread I’ve tasted so far!!! I’m ordering again now, my 12 year old son loves the taste- thank you Sola!!",

    "I didn't like it",

    "Love this bread. Low carb and tastes great. For someone that needs to keep a strict low carb diet this is a dream come true. Although I must say it’s a bit pricey.",

    "For this to be a low carb bread it sure beats regular carby bread! Cant tell the difference!",

    ", two of the loads that I open had mold on them. The third one I didn't even open just threw away. Do business with this company or buy this product at your own risk",

    "Tastes good and less carbs , but much smaller than a typical slice of bread . Size alone would make it low carb . Way expensive for what it is .",

    "Really bad-has an odd stale or artificial taste. Slices are very small, loaves are very small & overall, way overpriced",

    "The bread is good but it's very pricey!",

    "Very good and good taste but expensive",

    "LOVE IT!",

    "To expensive and gross!!!! The flavor was off. Would not recommend would not buy again.",

    "There are some pretty good low-carb products out there these days -- but even amongst them, this is a standout. I'm sitting here eating French toast, enjoying the heck out of my breakfast -- a happiness I thought incompatible with my runaway blood sugar. Sola doesn't spike my sugar and it tastes great. It's best toasted, grilled or cooked in some way, but I see no problem with turning a regular sandwich into a grilled sandwich!",

    "I keep in freezer & take out as needed",

    "I loved that I outdoor have toast and a sandwich.  Thes slices were smaller than a slice of regular bread but I got used got used  to that. It well Worth it to have a quick sandwich like the rest of the family. The bread is easy to fit into your daily quota of carbs. I will continue to buy it.",

    "It’s a non homemade Keto bread. Let’s me have a sandwich, toast with eggs. I like it! If you’re expecting Home Pride taste then you will be disappointed for sure. If you are excited about having a bread that meets your needs, then you are already going to like it. I’ve ordered 9 loaves. Everyone is different,",

    "Loved the flavor and freshness of this bread.",

    "We love this bread. It's a great low-carb alternative to wheat bread. Tastes great and lasts longest than that bread.",

    "Taste great for keto diet.  Little pricey but still pretty good.",

    "Typical of low carb bread, this is “thicker” than normal bread.  But, it’s delicious!!  There is a slight sweetness to it that you can just taste, but which doesn’t interfere with the flavor of what you’re eating it with, even if it’s just butter.  I’ll definitely try more of theirs!",

    "I enjoyed it very much",

    "I will not order again as I did not feel that the quality was warranting the price.  I guess I will stick to making my own.",

    "This bread tastes like \"bread\". That is all I ask for when trying to be on a low carb diet like \"Keto\". The three loaf combo is a expensive though. It was available on Costco for a while where the pair of loafs were $8.\nI order this on regular basis. It is delivered within 3 to 4 days and arrives fresh.",

    "Great taste. Toasts well. Makes a mean grilled cheese sandwich!",

    "this is the best bread i have ever eaten",

    "For the price of this bread, the size if the loaf and the tiny slices of bread, it isn't worth the money! To each his own but it's too pricey for what it is. The taste is nothing like regular bread. I have been doing keto/low carb for several years and made better and bought alot better from private makers. Will not buy again",

    "Omg! Finally! a bread that taste good and I can still eat while living a low carb lifestyle. What a god send. I am a fan and I will be buying again!!!!!!!!",

    "The low carb count and the flavor and texture of this bread has made my continued success.",

    "Instructions above do say to freeze immediately. I've had this in the fridge for months and it still taste fresh everytime, when I'm craving bread I pull this out and throw it in the toaster. Tastes great, highly recommend. It's totally worth the money if you miss bread!",

    "I liked the long storage life.",

    "This bread does the trick, I toast mine and the consistency works better for sandwiches, I even use for hamburgers, freezes well, worth a shot if you're willing to spend the money.",

    "If you’re doing keto or a low carb diet. This is the perfect bread. It’s so soft and tastes delicious. The slices are on the small side and it’s expensive. But it’s sooooo worth it. I’ll definitely be ordering this once a month.",

    "The bread was fresh. I didn't care for the taste. I'd rather have a half a slice of good bread that 1 or 2 slices of this. When I put it in the toaster, it didn't toast well. The crust burnt easily while the body of the slice was still soft. I tried this many times. I am now using the 2.5 loaves I have for bird food.",

    "I was super concern about this product. Its expensive but its worth every penny. Tastes really good, the package was a very good one as well. Buying this on a regular basis now. I wish I can have coupons or special sales on this.",

    "Love that I have found bread I can eat (and not have to make) on the Keto diet. It is delicious!",

    "Hoped for an acceptable replacement for bread due to diabetes. This was pricey as specialty items often are. The flavor and texture were somewhat distant from bread. It might be a good choice if you could not find a better solution, but I have tried some that were. As flavor and texture are very much a matter of opinion, please take this review with more than a grain of salt.",

    "This is the most flavorful keto bread I've tried. Good 'raw' and excellent as toast.\nHighly recommended.",

    "I like that flavor of the bread.",

    "Excellent with some almond butter or any spread. Great for those on keto. Small slices help with portion control.",

    "Very good taste.",

    "The first low carb bread that doesn't taste like cardboard. YAY!",

    "As we all know, eating healthy isn't cheap, and this bread is pricey at around $.50 per slice..and these are REALLY small slices (about 1/2 the size of a 'normal' size slice of bread). Only other negative is the long shipping time, as others have mentioned.",

    "Wish these cost as much as a regular loaf of bread! Very good and carbs are low!",

    "sooooo, the low carb nightmare that anyone faces trying to get bread. This bread actually tastes good, but it is so tiny it fits in the palm of my hand!!! definitely NOT worth the money. Wegmans sells a great low-carb bread called 647, twice the size and 6 net carbs, better tasting too.",

    "I must admit I was somewhat skeptical when I purchased this bread. Most of these low carb breads taste like cardboard.\nThis was a pleasant surprise. This is some good tasting bread. Aside from the outrageous price, this is the best tasting keto bread I’ve ever had.",

    "Would definitely buy again",

    "Very good low carb bread. Wish it was lower price.",

    "Just as bad as every other keto bread I’ve tried. Bad taste and after taste. My goats won’t eat it.",

    "Although this expensive, it is amazing!  It tastes like regular bread, my kids cannot tell the difference!  At only 3 net carbs a slice, I can have a sandwich for lunch and toast for breakfast.  It has changed my keto life :-)",

    "This is the best low carb bread I have ever tasted... Is quite expensive but excellent flavor....",

    "This is the best bread alternative I’ve tried so far. Try it toasted with butter and cinnamon “sugar”.\nMakes a good sandwich after a year without edible bread! Will definitely purchase again!",

    "They ship it frozen so it is so fresh when you get it",

    "I used this product for breakfast toast and enjoyed the taste and crunch.  I plan to order it again when I need more.",

    "I liked the taste for a low carb bread...wish it cost less",

    "I like everything about the bread. It tastes great, remains soft, and toasts well. It is just essential that you keep the bread frozen until you are ready to use it. It will remain good for a long time.",

    "Delicious.  Is it practical to eat an entire loaf a day? No.  This is great for when you are jonesing for bread.  I froze my stash and keep it in the fridge when I open a new loaf.  It is spendy so I plan to use it as a treat to help keep me on track.",

    "I love the flavor, texture of the bread, just wished slices were a bit bigger and the price lower.",

    "Really good but really small",

    "It tastes just like soft yeasty wheat bread! YES! Will keep buying!!",

    "Pictures look like a regular sized load of bread, but in reality these are 1:3 scale.  Great if you wanted to make sliders as an appetizer but useless in reality.  So when you take into consideration the carbs for the size of each slice, you're much better off with regular whole wheat bread.  Plus this bread taste awful.  So there's really no benefit to eating it.",

    "Finally a low carb bread that taste great! Love my sandwiches  again. Even though the slices are small the taste is great.",

    "It has a strange taste and texture.  It does when you really fancy a sandwich but I find it very expensive.",

    "Arrived fresh and soft. Slight after taste but worth it to be able to have toasted cheese sandwiches. Makes acceptable French toast also.",

    "This is how my loaf was delivered. Was opened and had a hole in many of pieces and was smushed, almost as though someone had opened it or a mouse got into it. Very disappointing for how much money was spent on the product.",

    "Best bread ever",

    "Most any bread would have less calories at the portion size, the loaves are so tiny and they cost 9 dollars a loaf",

    "Like others stated, the bread tastes great, but one of the loaves was already molded. Keep all info including the packaging before contacting them, you’ll need all of the numbers. They did give me a partial refund and I kept what wasn’t moldy.",

    "The bread was hard and stale. Tried to return and it wasn’t eligible. Very disappointed.",

    "How have I not found this bread before now? The texture is spot on. The flavor is unremarkable, but so are 90% of store bought breads. (I purchased the sweet oat) The size is slightly small, but no smaller than Pepperidge Farm loaves. It perfectly holds a cheese slice. I just had my first grilled cheese sandwich in three years. Looking forward to summer and BLTs. Even just a piece of real toast with eggs in the morning is something to look forward to.\nI’ve baked dozens of bread recipes that come out dry, eggy, disturbingly moist, off color, or some weird combination. It’s nice to know a respectable low carb bread is available and I don’t have to bake it.\nYes it is expensive to purchase via Amazon, but it keeps me out of the local Walmart - always a plus. Purchased three loaves. Two went directly to freezer. Half of the third went in freezer, other half in fridge. It came perfectly fresh even though it sat at USP for two days. Will be sure to order on Sunday evenings in the future to help avoid delays.\nFor those crusaders who don’t have a firm grasp on chemistry and it’s effect on biology, or that wheat gluten is different than wheat starch, there are 3 net carbs per slice and it had no appreciable effect on my readings as compared to consuming the same amount of carbs from another source.\nYes it’s expensive, but if not consumed daily it’s well worth at least having on hand.",

    "Tastes terrible. Not really love carb you can buy same at grocery stores",

    "I have been strict keto for more than a year and this is my first \"bread\" in that time. It is AMAZING! I have only eaten it toasted,  but it has a wonderful texture and flavor in that capacity. The loaves are the size of Pepperidge Farm cinnamon bread, so t hgv e portions are normal sized. I highly recommend, though it is expensive! I just ordered my second delivery and I know that I will be ordering regularly!",

    "I loved this bread, I had two slices and just tested my ketones, I am still in ketosis after having this bread. Great taste and texture. Nicole at the customer service was very nice and sweet, she answered all of my questions. Definitely will buy more in the future.",

    "Excellent taste and it freezes well.",

    "The bread was so small. Less calories but not very filling.  Rather expensive at $9.00 a loaf",

    "Great Keto friendly bread!!!  Love this better than some others I've tried.  Also better tasting than making your own.  It also toasts just like regular bread.",

    "Yes, expensive. However, for people who need new carb, sugar free brrad for health reasons..its wonderful! Ill spend my money on this bread. The taste is perfect and freezes great.",

    "Started Keto and have tried a few low carb breads and I keep coming back to this one. Good taste and texture. I like that it is packed really well. I can just put it in the freezer without individually wrapping it. Ships quickly. My only issue is the price.",

    "Can't get over how soft it is.  I bought it for toast, but think its even better in sandwiches.  Pricey but I have reordered several times",

    "For what you get for this item it cost to much it doesn't tell you the ozs so watch what u get when it comes to bread.\nBut it does taste decent for Keto bread.",

    "This product is delicious but the price is a bit high.",

    "Love the product but for the 3/4 loaf the price is pretty expensive. Will look for alternative bread replacement. Will go back to my wraps. More for the money.",

    "Tastes great and very satisfying. Would buy again",

    "This bread tastes great! Little smaller than your average bread slice size, and certainly more expensive, but it’s texture and taste is exactly like normal bread. You’d never know it was not a normal loaf off the shelf. Definitely recommend!",

    "Taste great",

    "The flavor was pretty good, but the slices are very small, about half of what a normal slice of bread would be, maybe 3-4 bites per slice, and each slice is 4 net carbs!\nThe the entire loaf is also just about half of a regular loaf, so you are paying $9 for half a loaf of bread.\nIt’s easy to say 4 net carbs per slice when the slices are tiny.",

    "The bread came on time, as described. My problem with the batch I received is that the crust was almost black, the loaf looked nothing like the golden color in the picture. The crust did taste overdone. A slice of the bread is already small in size, a little over half the size of a regular slice, so cutting off the crust makes it almost a cracker size. It's too bad, because the interior of the bread is great. I'll order one more time, hoping this is just a one-off, if I get 3 black loaves again, I won't reorder. PS, I did contact the company and got an unrelated response about damaged packaging with no follow up.",

    "This bread is great for sandwiches!!",

    "This bread is really expensive but it served its purpose.  I wanted a little bread in ny keto diet and I can have 2 slices of this.",

    "I love this bread. It is very good and tasty for a low carb bread. It’s is pricey though, and last order I received bread was burnt like black all around the crust. I was shocked they sent me their product like that.",

    "Good bread when craving bread when on a low carb diet.  Just small loafs little but I buy it for a treat when I’m craving bread.",

    "This keto bread is. The. Best.",

    "Like test. Like bread quality. I think little bit costly.",

    "add a little peanut butter and taste fine",

    "The taste is amazing, and the bread is unbelievably soft/ moist/ chewy. I ordered a 3 pack; kept one in refrigerator, 1 in freezer, and 1 on the counter. The bread did not lose softness or texture by storing any of these ways. I used it to make normal meals requiring bread (grilled cheese, toast, French toast) and the results were better than expected. In no way could I tell (nor could anyone else) that this was a reduced carb bread. 5/5 stars for all categories (with exception of ‘price’ category as the price point is around $9 when buying the 3-pk). WILL buy again soon & maybe try another flavor.",

    "Taste good for a low carb alternative",

    "I've ordered this bread a couple of times because it's actually delicious and a wonderful little size and taste for keto grilled cheese sandwiches. That said, this last order I received was horrible. Both loaves are burnt and don't have the soft, pliable texture and feel that other ones I've received have. I wish I could return them or get new loaves because usually they're good but this time, they just didn't cut it. I wish I could recommend this company higher because it's usually the best-tasting low-carb bread I've found, but if this burnt loaf phenomenon keeps up, I'm taking my business elsewhere. (Because we all know these loaves are way too small to tolerate burnt crusts... half the slice is disgusting and then the bottom half just feels sad.. I don't know.) Anyways, best of luck to you all. May your loaves forever be unburnt.",

    "The sweet and buttery flavor is very good. Closest consistency to real bread that I’ve tried with low carbs. They are about 1/3 smaller than a regular slice of bread so I do think it’s a bit overpriced for what you’re actually getting. But I love that it is not made with almond flour! :) I will buy it again!",

    "Just like real carb bread....made turkey sandwichs",

    "WAY overpriced but really good for Keto Diet",

    "The freshness and the teast",

    "My daughter does Keto and I bought this for her because she sometimes misses toast with breakfast.  She said it was good, it was soft and she really liked it.  It is in my opinion absurdly expensive.  But it was a gift, so I was ok with the price for a gift, but neither of us are willing to pay that on a frequent basis.",

    "Very tasty",

    "Awesome keto bread!",

    "Absolutely the best bread for keto/low carb people. Once received I checked the loaves for freshness then put them in the freezer immediately. Best toasted with butter in the mornings or used for grilled cheeses.",

    "I wish there was more in the package",

    "It didn't taste very well.",

    "Love it toasted",

    "Tastes great! Wish it was more affordable.",

    "I got this as a sort of stop gab between real bread and getting off bread. They arrived just fine and I have been eating them. The test is not fabulous. It is soft and ok but the crusts are spongey and you definitely can tell you are eating low carb bread. In addition the slices are tiny. So clearly having a smaller slice will mean less carbs. Finally I am not at all sure about these being truly low carb. They have 8 carbs and presumably, they have less due to fiber. But if that is wrong by even a little the carbs I am eating is pretty much equal to a normal slice of bread with is about 14 gs. Add to that the inconvenience and the cost and it really isn't worth it.",

    "The taste, amazing! I've had other low carb breads and this one is by far the tastiest! The one thing that I wasnt expecting, was.how small the loaf was.",

    "This bread has the texture and softness of bread.  The taste is close to regular bread.  The slices are small.  I am very pleased overall. I wish the price was more affordable and it was available in grocery stores locally.",

    "I absolutely love love love this bread. it is pricy BUT worth  every penny.. I just put it in freezer and take out what I want when I want it!!!!!",

    "This is a reorder. The bread on the left is from my first order which I was very pleased with and just took out of my freezer. I received three loves that resemble the bread on the right today. There is a substantial difference in size and color and the order I received today the bread has an unpleasant smell. This is not a returnable item and I could not find contact information for the seller on my order to contact directly nor should I have to look very hard, so I am posting this review and will not purchase this expensive non returnable product again.",

    "Bread taste great!!! Worth the money especially if your keto!",

    "It was awful",

    "I used it for breakfast, lunch and dinner.\nIt’s very delicious.",

    "Delicious tasting bread for only 4 net carbs. This is a great bread for the keto diet and for diabetes since it has no sugar.",

    "This bread is expensive but worth it if you are doing a low carb diet. I missed bread a lot and now I can have it. It has great flavor and makes great French toast! I just ordered another three :)",

    "My favorite bread",

    "I can't honestly say that I loved this bread. The slices are small but the taste was fine. My problem is that it uses up my keto values too quickly. Because of this I will not be practicing this again. But it was not bad bread.",

    "This is the best low carb bread! I love the texture and the taste. I’ve purchased others that didn’t compare in any way.",

    "Great tasting low carb bread",

    "Too expensive for the chinchy loaf. It is like $9.00 per loaf.  It was kind of stale and ok flavor.  I will stick with making my own bread. I froze this for once in awhile sandwiches. Not really worth 6 carbs.",

    "This bread is fresh and delicious. I've recieved 2 deliveries so far with no problems.  It is great for our low carb lifestyle and satisfies that occasional need for a sandwich or toast. I highly recommend.",

    "I am going low carb, and this bread fits into that category, plus it tastes great. I buy 2-3 loaves at a time, and freeze the extra ones. I also keep the loaf I'm eating on in the fridge. Makes great toast, and the seeds give it depth.",

    "For what it is, it's okay. Toast was okay. Grilled cheese was okay. French toast was okay. Nothing out of the ordinary. It was worth a try, though.",

    "It's soft. I ordered the 3 loaves for $20+ dollars",

    "The flavor and texture of the bread is really quite inferior. The crust is really unacceptable and a loaf of bread. The body of the bread itself it’s OK. The sly sizes are easily wanna have the size our usual slice of bread. Next time I’m going to go and buy Sara Lee 45 cal bread and Collett a day.",

    "So good, best low carb bread ever!!",

    "Tasted like coconut. Superb texture.",

    "Going in I expected this to have a horrible after taste, but once I bit into a slice I couldn't believe it, I was in heaven. Flavor is so buttery and sweet it wasn't dry or crumbly at all. Very soft and moist. 100  out of 10 would purchase again",

    "Freeze or refrigerate then eat or toast and eat and you",

    "When you can find it locally, it is half the price I had to pay on Amazon.  But it's very good for low carb bread.",

    "It's a great bread I love the flavor and texture. Makes great French toast and sandwiches. Will definatly buy more of this only I'll have to buy more then I did this time around. Can't go wrong with this bread the whole family will love it.",

    "I only received 2 loaves instead of the ordered 3 pack and paid the price of the 3 pack!!!",

    "Slices are very small but the taste is very good!",

    "This was ok at best.  No matter what I tried it wouldn’t get crisp.  If it makes any sense... it was chewy or doughy.  It’s better then nothing but for the money it’s not worth it.",

    "Bread is as good as the hamburger buns. Highly recommend this brand of low carb bread. Taste as good as a regular bread\nBest low carb bread out there!!!! Thank you!",

    "Great taste and texture. Satisfies my cravings for bread. I am low carb/keto and love making toasts and sandwiches with this bread",

    "We love this bread. It is a little expensive.",

    "Hard crust was disappointing",

    "I LOVE BREAD! DUE TO DIABETES, MUST CUT BACK ON CARBOS.",

    "Small slices, but very good!",

    "It was nice eating bread again.",

    "I've had a few low net-carb breads and this one—by far—is the best. It looks, feels, and tastes like regular bread. I order three loaves every month!",

    "Toast for breakfast",

    "The bread is pretty good for low carb. Be aware, however, that the slices are much smaller and thinner than a regular piece of bread.  I still liked it, though.",

    "Amazing flavor,  wonderful texture.",

    "They accidentally sent us the wrong bread, the “sweet oat” kind. It was still very good!",

    "The Sola sweet and buttery bread arrived in perfect condition.  I was excited to get this as I was missing bread on the keto diet.  I opened it and it looked just like bread.  It smelled like sweet and buttery dinner rolls.  So far so good.  Then I tried to eat it.  I thought it was good for the first few bites.  It almost felt like bread in my mouth.  About halfway through the first piece (with a hamburger mix topping) I noticed I wasn't breathing through my nose while eating it.  Then I suddenly couldn't swallow another bite and had to spit it out in the trash.  It almost has a \"fishy\" smell while you are eating it, but that's not exactly it.  I can't really explain it.  I still have it in my freezer, I might try it again when I recover from this experience.  I wish I didn't have 3 loaves of it.  This one had great reviews so I'm very hesitant to try any other very low carb bread.  I'll probably just live without bread or bread substitutions.",

    "Nasty",

    "This bread is a little bit pricey, but it is well worth the money if you are trying to stay low carb. The taste is pretty good and it seems like real bread. I make grilled cheese sandwiches, french toast, or just eat it with peanut butter and I can't tell the difference.",

    "Ok, so like most Keto products this bread is expensive.  Still, if you are craving bread then it is a must buy.  Tastes great toasted.  Looks, smells and tastes just like regular bread.",

    "Grilled cheese and turkey sandwiches for the first time in a year!",

    "It’s the best bread. Grilled cheese! My old fav PBJ! I’ve had them both without any guilt. The bread tastes great, holds up well and fresh and beats the other low-carb breads I e bought in the past. I’m hooked and ordering more.",

    "Tastes like regular bread!",

    "My favorite keto friendly product! This is my second order and about to reorder my next set soon! A little small but def taste the best and has no weird texture. Made sandwiches, grilled cheese, toast and French toast too! Wish it was cheaper though.",

    "The butter flavor in this bread is very artificial and very strong.  I have tried some of the other flavors and except for this one the others were ok, for low carb bread.  I will order again, BUT never the BUTTERY flavor.  Thank you",

    "Low catb",

    "It's expensive but when you're not eating carbs it's sure nice to have this bread and eat a good old grilled cheese sandwich!!",

    "Coming off a lowlow carb diet I thought this would be my saviour but the taste is different enough to have your palate wondering what kind of diet trick is being pulled now.  The texture is also a weird chewy soft that put my daughter off, which is saying something when it’s covered in PB&J. She won’t eat it and she’s not a picky eater. Finally, the size is WAY smaller than normal American loaves so, uh, yeah there's gonna be less calories and carbs.....but we didn't think the company would alter the ingredients to lower the carbs AND reduce the size.  I would have preferred smaller normal bread and not have the weird taste.  Pricing, taking this into consideration, is quite high.  If I didn't taste the 'astronaut' weirdness (remember the 70's and astronaut food?) or felt like grabbing three slices to make up for sizing I would have GLADLY paid higher to watch my carbs.  With these, the sacrifices all over just aren't worth it for me.",

    "Presentation means nothing when the slices are 50% smaller area than a regular slice of bread",

    "Too many seeds for me. Has great texture and flavor though. I will buy it again but from the store. Too expensive this way.",

    "I love this bread. It’s pricey but honestly worth it. My favorite is the sweet oat, after trying all others. Not really noticing a taste difference on any of them, but consistency to bread made with flour, the sweet oat wins.",

    "Love this bread!  I’m on Keto & my husband & I both LOVE this bread. I’ve ordered a 3 pack 4 or 5 times now. Just wish I could receive it quicker. (Ordered 2 other brands but they tasted horrible so we threw them away)",

    "Spongy texture was bad. Not a good value and now I’m stuck with 3 loaves of if!",

    "This bread looks good, but it’s tiny and has a weird toasted texture.  Too many carbs for for such a tiny slice of bread.",

    "I thought the bread smelled like blue cheese, not in a good way. When I got my breads, pkg of 3 , I put them right in the freezer except 1 loaf. Each bread smelled the same.As I got down to eating it ( stored in fridge) I noticed their was  black mold on the underside, Ewwwwww!!! These breads were NOT cheap, almost 10.00 a loaf. I am sad , doing Keto it's nice to have a sandwich once in awhile. I really wanted to like the bread. It also took about 10 days to get them.",

    "I'm doing Keto and really wanted a sandwich, someone told me about this bread. It does taste good, but it'n not a full on replacement for bread. It's pretty expensive and the slices are very small. The bread itself is pretty dense. The best thing to do is to buy in bulk and freeze.",

    "This is really very good. Overall I'm impressed with the taste and texture. Glad I found you!!",

    "Great taste! I love it!",

    "I kept going off keto until I bought this bread (sweet n' buttery). Absolutely delicious - taste, texture, appearance- of bread with 60 calories per slice and 2g net carbs. I am the pickiest bread eater ever, so I can't imagine some of the negative reviews. My husband, who is not on keto, loves this bread!A++++",

    "I bought Zero Carb bread and while it was nice to have bread with no carbs at all, you sacrifice taste.  This bread has 3 net carbs per slice, and the slice is smaller than your average slice of bread, but it tastes like bread, like good bread.  If you did not tell me this was a low carb bread, I would not know.  Love this bread.  I get low carb wraps at my local supermarket that also have 6 net carbs.  I am so happy I bought this so I can have bread vs. a wrap.  Now, I have choices.  Love this bread.  What I do not love is the price.  Not sure why they can't lower the price other than pure greed, as I highly doubt making this bread costs so much more than higher carb bread.  So, it's super expensive and I will only be buying it while I am on the keto diet.",

    "This bread is worth it and has made being on keto even easier. My mom had surprised me by ordering it for me before it was sold out and it was literally sold out less than 20 minutes of looking at it and now I know why. This is the first keto bread I’ve tried and it taste very close to bread to me. It smells amazing when cooking and taste great. I will definitely order this again. The only thing I disliked was that it didn’t have prime and I didn’t want to receive it and it have mold because it took too long but I received it in mint condition and am very satisfied",

    "Flavor of bread was good unfortunately only one loaf of 3 in the order was moldy. I would just like those replaced",

    "Great taste for low carb bread. The only negative is how small the loaf is. It’s a bit smaller than all the other LC bread.",

    "Pretty disgusting actually. Have tried plain as well as toasted with butter. Complete waste of $30. Have no idea how this has so many high reviews. Hands down the worst lo-carb bread I have ever tried.",

    "Tastes more like real bread than any other low carb bread!",

    "I loved it, it was sweet, good, and really hit the spot.  No more craving bread!",

    "It is the best low carb bread my wife and I have found so far relative to taste.",

    "Let’s eat sandwiches again! Helps to control my husband’s diabetes.",

    "Amazing taste",

    "The bread is very good. But for the price,  its expensive for my budget and you can only buy two instead of one loaf. But overall, it's a great product and my family loves it!",

    "REALLY SURPRISED HOW GOOD THIS BREAD WAS",

    "Na",

    "Just what I wanted",

    "I have been doing the keto way of eating for 2.5 years.  I do occasionally miss having bread.  I found this by accident, and love it!  The bread is soft.  The taste is not bad, its just \"different\"  I kinda wonder why it costs so much, but that would be my only complaint.",

    "Excellent!!",

    "I liked. If not the best one of the best tasting low carb bread in the market. Only thing bad is you get 3 paclets of the same. Variety  pack should be an option",

    "This stuff tastes horrible",

    "Great bread replacement! I started the keto diet but was really missing bread. Found this product and do not regret buying! I keep one loaf it in the fridge and froze the rest to preserve it. Best eaten toasted with butter. Keep in mind, it doesn’t taste as good as regular bread but it’s a good dupe when eaten with other things such as avocado or BLTs.",

    "Been using this brand for over a year. While the other flavors are the best keto replacement for bread and very good, this sweet buttery bread flavor is the closest to a sandwich bread taste and texture. Excellent.",

    "A life savor.",

    "BEWARE! This is not Carb friendly, they are lying.  I gained 30 lbs in 3 months",

    "It’s good but really pricey... anyways I would buy",

    "I was worried about mold so as soon as I opened the package I checked. Noticed some white stuff but it was just some powder. I wasn't fond of the texture or after taste, but made a grill cheese sandwich and it was GREAT!!! not the kind of bread I can eat as it so I will definitely to see what works and what doesnt but the grill cheese sandwich was pretty close to the real deal. This will be great for french toast and cinnamon and im sure as a cheeseburger bun. Prett pricey so its not something i will buy often but fir now I look forward to making sandwiches and makes it easier to stay on Keto.",

    "After trying various recipes for \"Keto Friendly\" bread and being disappointed because it either tasted too \"eggy\" or had a strong flavor from the psyllium husk powder, I decided to try this bread on Amazon.\nI am a little taken aback from the price (almost $10/loaf).  However, after the bread arrived and I tried the first slice, I was VERY impressed!  First, there is a nice scent of \"yeast-based bread\" and the texture is nearly identical to any traditional wheat based bread.\nThe flavor is phenomenal.  It can be used for French toast, sandwiches, or simply toasted with some butter.  I only wish that the price were a little less, but is well worth the money because of the flavor.  It is by far a great substitute for making \"keto\" bread yourself, or trying other brands (which I have seen reviews that they tasted terrible).  I highly recommend this bread if you want an occasional treat on your Ketogenic diet.",

    "I was worried this might not be as good as I hoped for but was very pleased with the taste! It is very good. The price is rather expensive though.",

    "A MUST HAVE for anyone practicing keto, missing the taste of regular bread! I received my bread in the mail today via UPS. The two loaves were securely packaged in a box. When I removed the bread from the box, it felt like REAL bread, extremely soft. The bread was not molded or flatten as stated in earlier reviews. I toasted some of the bread and added some peanut butter.  The aroma of the toasted bread was delicious. This is the best keto bread I have tried, thus far. It tastes, looks and feels like regular bread. Other brands fall apart easily. This is a must try for anyone who wants to put bread back into their meal plan. I’m looking forward to making a grilled cheese sandwich!  I will be placing another order.",

    "Love it..",

    "The bread was Okay but soooooo expensive. 4 carbs? Ok but smaller than a regular slice of bread. Nature's Own 2X fiber is 9 carbs per slice. A much better and CHEAPER choice.",

    "Similar to other  breads but low in carbs. Small slices accomodate  what you put on them. Not great for toasting. Moist, good flavor and freeze well. We buy 3 at a time.",

    "The best low carb bread I found. I will not try to make anymore they never taste right. This is a little pricey but it's worth it!\nIt's taken keto/low carb to another level for us.",

    "Best Keto bread ever! Wish it wasn't so expensive. (Their hamburger buns are amazing too!)",

    "Delicious!",

    "I was a bit skeptical,  especially when I received squished loaves, but I gave it a whirl anyway. I was so surprised. This is a great substitute for regular bread. I was very happy with the taste and the texture. Made awesome grilled cheese sandwiches.",

    "I've been on keto for a year, and this is the best tasting bread I've found.",

    "Very delicious bread.  This bread is outstanding, nice and soft, very flavorful and way too expensive.",

    "Received bread that’s stinks of mold. None visible but gross crap. Ships ground 6 days in a warm truck made a mess of what is a rip-off as it’s not returnable or refundable by Amazon. Save your money if you live any distance from Illinois. Sola said they’d contact me then went radio silent. They suck as a company and don’t stand by their product.",

    "I've only had this for a grilled cheese sandwhich so far. For low carb, its pretty close to regular bread. Only thing is it has a spongy texture when you eat it. I'm not a fan on the packaging though. It's plastic within plastic. I took it out of the first layer and went to open it like a potato chip bag. Ended up splitting it so easily that the entire loaf just dropped on the ground. Wasted. 😔",

    "I’ve tried a lot of breads, even making it myself, and this is the best.",

    "Little too pricey",

    "This bread is amazing. I don’t know how they make it really taste and have the texture like real bread. Wow. Only thing is I wish the price was a little cheaper but nevertheless, i’m still going to buy more. Sweet and buttery tastes just like potato bread from my childhood!! :)))",

    "Forget the fact that this is very low carb bread and that is why I initially bought it… Bottom line is that this is some of the most delicious bread I’ve ever eaten.",

    "Yes finally a great keto bread",

    "Love this, best low carb bread ever!!",

    "Excellent product! Definitely helps me with my low carb lifestyle",

    "This is delicious which was really surprising. And it does not have more than 3-4 gm NET carbs--those who reviewed it as being high in carbs do not understand that fiber and sugar alcohols are not absorbed and so get subtracted from the total, leaving these VERY low in NET carbs. The texture, flavor, density are great and made my keto diet craving for an occasional sandwich or toasted cheese completely controllable. Even my husband (who LOVES carbs) likes it. And it does hold up great in the fridge and lasts practically forever in the freezer! (I don't go through it real fast  :D ). The height of the loaf is not like Wonder Bread but it is fine for how we should eat and so satisfying. I recommend this without any reservation. LOVED IT!",

    "Cost is little pricey and the loaf is a little smaller than a reg loaf but a lot less carbs (3 net carbs) ... taste just like reg bread!  GREAT alternative for a Keto diet!  Only down side, shipping is VERY slow (for what they are charging, you would think they would ship 2 day) ... wish they would fix that part.  Worth purchasing again~",

    "This brand was recommended by my favorite food blogger and I felt that we had similar taste, so I tried it. Turned out to be a great purchase. Even their no carb sugar, the vanilla almond cereal and burgers buns are all great!",

    "Too small. No wonder it has a few carbs.",

    "Great taste. I love this bread! I was trying Keto and the cravings for grilled cheese  was very strong. The Keto bread recipes didn’t cut it . None I tried tasted like bread.  I saw Sola bread on Amazon and decided to give it a try. Great bread only drawback is the price... $28 for 3 loaves is a bit steep!",

    "love th is bread helps stay on low carb diet will be odering for a third time",

    "Wasn't sure how it would taste, so I was surprised it tasted good for especially for low carb bread.  I liked it as much as regular bread, it was sweet and buttery tasting like it said.",

    "Looks and feels more like real bread but I couldn't get past the long list of unnatural ingredients.  Does make GREAT french toast though!",

    "Teeny tiny slices, not much flavor.",

    "Low carb and it taste great!",

    "It’s pretty small. But I kinda expected it from the reviews. But this bread is amazing! I gave it four stars because of the cost. Please make it cheaper lol",

    "Love the bread. Great flavor. Will buy more!!",

    "Wow this is amazing bread. I am so impressed. I froze the other two and ate one. Then thawed one and it tasted so fresh. I highly recommend this bread.",

    "This product is available at my local grocery store for the price",

    "Tastes good",

    "It's a tad expensive but when you can eat a sandwich on a keto diet that makes it worth it.",

    "This bread has a terrible after taste. I tried two different ways of using it and the taste still comes through.\nYou can’t return it.",

    "Best Keto bread I have found.",

    "The customer service is great and it is a high quality product",

    "The bread was very good but very small and expensive",

    "Wonderful product if you’re on keto and desire bread. This bread is a lifesaver when doing the keto diet.  Love the flavor & texture.",

    "Tastes great without the carbs. Made avocado toast, SF PB&J and more!",

    "Tastes just like bread once toasted",

    "After trying several brands of low carb bread, this far exceeded my expectations. It's now my go to when I am craving a sandwich or toasted cheese. Yum!",

    "LOVE THIS BREAD!",

    "I have followed a low carb diet for years. Over easy egg with toast has always been something I missed. I have tried other low carb breads that had lower carbs but were like cardboard.\nThis is the best. I will deal with the 3 carbs as this bread is delicious.",

    "This product was well over price. There are breads in grocery stores just as good and priced  better",

    "Very soft and tasty. Great on my lowl carb diet. My lunch is on this bread every day. It's actually good with sugar free jam too!",

    "This is a very good bread. It doesn't get very crisp when in the toaster but makes a great grilled cheese. When you are following the keto lifestyle it is a great way to cure your bread cravings.",

    "Really love this bread. So does my husband. Will buy again",

    "Taste great. Little expensive",

    "Just got the buttery and sweet bread and tried it\nOut.\nThe packaging says buttery and sweet but its actually very greasy and salty.\nSo salty that it hurts my tongue and throat a bit and left a salty after taste in my mouth for a long time.\nIt has a light and airy texture but not in the way a bread is light and airy, its more like a light and airy rubber sponge.\nI dont really recommend this one. I'm not even sure what to do with the rest of this bread now. Its inedible.",

    "I'm trying to cut carbs and have gotten my fix with this bread. Yes it's not the size of regular bread but regular bread has around 14 net carbs per slice. Where as I can have my 4 slices of sola and not feel ashamed for 12 carbs. Compared to only being able to have 1 slice of regular bread. It doesn't have a diet taste, it's soft, easily toasted, NO SUGAR and great customer service from sola. Don't miss out if you're trying to cut your carbs!",

    "Doughy texture...not pleasant...tried as toast but was just ok.",

    "I put it in the freezer right away. I had read about mold but don’t know if that’s still an issue but can’t afford to take chances.\nIt really had a wonderful buttery flavor. Seems less now that I freeze then eat but still great. Freezes and thaws great. Mostly just make it to have with eggs. Can’t wait to make a grilled cheese.",

    "Don’t buy this product this is not Keto",

    "I really hadnt missed bread but this makes really good Tuna melts.",

    "The taste was very good compared to other low carb breads! I loved it.",

    "Best low carb bread, hands down. Soft and buttery. It sacrifices nothing to be low carb.",

    "Not very good. Better if toasted.",

    "very expensive",

    "The box came smashed. The bread was so so. Not happy 28.00 For 3 loafs is a lot finished bread.",

    "To all the  naysayers ..... shut your mouth! KETO dieting uses net carbs not total carbs. This bread is a game changer. I can now have sandwiches, French toast etc.\nIt tastes great and is the perfect size",

    "Well I have to say this bread is pretty damn good! It was delivered fresh and undamaged! I made a grilled turkey and pepper jack cheese sandwich and it was amazing! Yes the slices are smaller than an average slice of bread, but they get the job done and coming in at 3 net carbs per slice that’s hard to beat. I ordered the Sweet & Buttery flavor. I will definitely order it again.  I feel it was worth the price. It really helps to diversify your Keto menu! Can’t wait to make French Toast with it!",

    "Definitely worth it",

    "I haven’t bought this on Amazon, but am able to buy it locally. However, it’s the BEST low carb bread I’ve had. My husband eats it because it basically tastes like regular bread. It toasts well and freezes great. We like the seeded varieties best, but that’s our preference. It’s not cheap, but for the convenience when you just want to eat a regular lunch or breakfast it really hits the spot. The slices are smaller than a regular loaf, more like the size of some Pepperidge Farm low calorie breads. They are not thin sliced though. I definitely recommend for the low carb life.",

    "As far as low-carb bread goes, this stuff is pretty darn good.",

    "I like it toasted better than soft. I've tried other low carb breads, and this is one of the good ones:-)",

    "Loaf is a little small price is a little high, but tastes pretty good especially toasted.",

    "Great tasting bread. Pefect for my low carb life...GREAT!!",

    "Best tasting low carb bred I’ve tasted.  I’ve tried a bunch of different brands and this is by far the best!",

    "What I received from Solar. What should I do with that bread?",

    "It was great just like real bread! Just a little small on size.",

    "Spongy, can't cut it very well . I could over look it if the taste was there, but strike out on all bases with this product.",

    "Good for those who are cutting there carbs",

    "I love this bread. I would eat it even if I wasn't looking for low carb. Love the seeds. Bread is the hardest thing for me to give up on a diet, so it's nice to be able to enjoy a sandwich or piece of toast. I have my husband and son eating this with no complaints.",

    "It is excellent product for Keto diet. Only issue is small slices.",

    "This breading the real one love the taste,this is my second time being six loaf,I also ordered from another company, so far I've been killing the solar bread,it taste so good but I need to alternate with the other brand that doesn't taste as good as the sola,Imy not in a strick diet  but want less carb in my diet",

    "It is an excellent low carb option. Is a little expensive",

    "Awesome bread",

    "I know this is a big concern for people who are on the keto diet like me so I’m gonna start by saying that despite there being maltitol in this, this bread WILL NOT kick you of ketosis. I made a sandwich with this bread for my lunch, tested myself four hours later with my urine strips, and I still tested for “moderate” ketosis. I did test myself right after a workout too but I doubt that had any impact. Keep in mind too that maltitol is one of the ingredients that this bread contains 2% or less of. 2% of a potato won’t kick you out of ketosis, so a little perspective here, guys. What I don’t like, like others have said, is the price (this bread costs a small fortune) and the size of the slices, they really are small. I got the Sweet and Buttery flavor and it’s really good so if you can get past the price and the size, get this! It shipped fast too.",

    "Delicious!",

    "Making sandwiches again",

    "Starting a low-carb diet and knowing that bread was one of my weaknesses I ordered this bread and the texture and The taste was horrible.",

    "Totally delicious! Doesn’t taste any different from regular bread and it doesn’t spike my blood sugars. I have had this bread several times now and I can see on my continuous glucose monitoring system (I have type 1 diabetes) that my sugars are stable after having it. So thrilled to have found this product and cannot wait to try the other flavors. :)",

    "Great product will try again!  Just a little bit on the dry side but was great tasting!",

    "The bread was a great alternative. I toasted it and made breakfast sandwiches, peanut butter and jam sandwiches, and burgers. The bread slice can fit in the palm of your hand. I wish it wasn't sooooo expensive, but it was filling.",

    "The taste for a low carb bread is great! No after taste, or gritty!",

    "Great bread for use in a low carb KETO diet. A little pricey and the slices are smaller than a normal loaf of bread but the flavor is very good. I have ordered twice now and they have been fresh each time. I freeze two and use the third loaf. Keeps well in the pantry.",

    "Product has some flavor. Much better than other brands on the market that taste like they are made from sawdust!",

    "This bread is everything I needed and more.  While another poster said the bread has only a few less carbs than regular bread, they aren’t subtracting the fiber and sugar alcohol which brings it to 3 per slice .  I’ve restarted the low carb lifestyle and I have so many more options with just having a Slice of bread once in a while.  I would love if the price were lowered, but until there is some kind of competition that doesn’t taste like a piece of dense sponge, as other low carb breads do, I can see how the law of supply and demand works out here .  This bread tastes just like the real thing and I couldn’t be happier.  The slices are smaller than normal, but again, beggars can’t be choosers.",

    "This is the best tasting low carb bread I have found.  The loaves are pricey, and the slices are small, but when you are really craving bread it can help a lot.",

    "The taste doesn't meet my expectations of \"bread\". I have made huge adjustments to my palate since I began keto but this is intolerable.",

    "Yes this is very expensive. But it is excellent. When you do keto diet it’s nice to be able to treat yourself",

    "Finally I don't feel so deprived, being on a low carb diet I never thought I would be able to have bread, and this bread is good!  Makes meal planning so much easier and having a BLT in the summer time is a game changer!!",

    "Pretty good for low carb but, small loaf and expensive.  I can eat half slice regular bread and get same carb at 1/3 the price.",

    "Wife says this is the best low carb bread around.  Pricy but delicious.  No regrets.  Would recommend and would buy again.",

    "If you haven't tried this bread yet, try it now! We have been Keto off and on for a year and one of the things that would get us off is the craving for bread.  Problem solved.  Of course,  we eat Sola bread in limited quantities but the occasional BLT or grilled cheese makes Keto life easier.",

    "I really don’t like the taste of this bread, I made frenchthoast with it and the only way I could eat it was with butter, Splenda, cinnamon, and a fat free syrup.",

    "You pay for everything you get. This bread is the best low carb beard I have tasted. Got the seeded and I love it! Also you take off the fiber from the carb count along with sugar alcohols. So it is only 4 net carbs per slice which is wonderful for the flavor..",

    "I can finally eat bread again.  Thank you.  I was recently experiencing symptoms of pre diabetes. I was told to watch my diet and that includes cutting out bread.\nAfter discovering these I ordered two immediately. Today after work I tried the bread.  Each slice is the perfect size for a moderate meal.\nLow carbs and a great taste. Thank you.",

    "Not worth the money in my opinion. The taste and texture is similar to grain bread. Great for people transitioning.",

    "This bread is really good for low carb.  Very pricey but hoping that comes down in the future.",

    "I was pretty nervous to try a low-carb bread option, but I am so glad I did! I toast it everytime I use it, and it tastes great. The texture is perfect. A bit on the pricey side, but worth it if you are looking for a low carb bread alternative.",

    "I’m often disappointed by Keto substitutes so I didn’t have high hopes for this. Boy was I wrong. This behaves exactly like bread and toasts/grills beautifully but I also have it alone or with some Keto banana peanut butter. I’m always working so being able to make sandwiches again has been a total game changer. I hope enough people make this a staple so that the price can go down and they can start offering prime shipping because it takes forever to ship.",

    "In my opinion, you should avoid the 5-star rave reviews left by some people. If you're reading those and think that you've finally found good bread to eat on your Keto diet, you're mistaken. As the saying goes, if it's too good to be true it probably is.\nFirst, the good things about this bread. It has a low net-carb count and can certainly fit well into a Keto diet from that standpoint. It also comes in very nice packaging and looks, feels, and smells exactly like regular bread.\nNow the bad things about it. The taste is, at best, average. When I made my first sandwich, I was able to get through two bites. I strongly disliked it and had to walk away. After a few minutes, I came back and tried it, if only because of the high cost of the product. I'm glad that I did, beca use after a while the bread was bearable to eat. It certainly wasn't an enjoyable experience, but I was able to get through it without much issue. After I tried some different things with it - grilled cheese, buttered toast, etc. - I realized that while this bread does not lend itself to an enjoyable sandwich, it makes for an excellent bread replacement in situations where you're toasting/grilling it and putting strong-tasting ingredients on it. In other words, it makes for an excellent carrier, but is not good enough on its own to be considered equal to real bread.\nThere are some other minor problems with it. The slices, as many have pointed out, are small. It isn't too small to use, but considering the price it is certainly a turn off. The fact that you have to put it in the freezer is also an issue, as it usually has some small pieces of ice on it when you take it out. I'm not used to thawing my bread before cooking, so that was something I had to get used to.\nAll in all, I would say you should buy this bread if you're on a Keto diet and are willing to spend the money for what is essentially a mediocre carrier. It won't replace bread, but it will allow you to pretend like you can still eat grilled cheese, have buttered toast with your eggs in the morning, and so on. But if you're expecting this to solve all your Keto cravings, you're going to be disappointed.",

    "Absolutely did not care for the taste of this bread.",

    "This bread so they call it tasted just like filling your mouth with Sawdust I tried it again with coffee and it still was horrible could not even hardly swallow it.",

    "Ots amazing just buy it!!! Toast it !!!! I'm so friggen excited!!!",

    "I was so excited to see my package had arrived! I instantly made me a ham and cheese sandwich with avacado! It was like christmas...havent had a real ham and cheese sandwich in months! Why isnt everyone using this bread its like gold to a person on keto..will continue to order faithfully! I know alot of people talk about the size of the bread, its smaller than the average slice but i didnt even notice it fill me up just the same! Order now!",

    "Yeah, these loaves are expensive vs. regular bread, but a must for Keto lifestylers.",

    "I like the taste, doesn't taste like cardboard like most diet or low carb bread !"

  
  ]}