{
    "Review": [
      "After ending my lease on a 2007 DTS I starting looking at smaller cars as my wife thought the DTS was a little to big for her. WE tested CTS BMW Audi and Jaguar before picking the C300 luxury, my wife loves it.I find the car rides very well and has a nice look about it both inside and out. I like the nav. system and find that all the controls are with in easy reach of the driver. We like the car so much that we are planning our next Mercedes and doing the European Delivery Program for that one. I do find the rear seat and truck are kind of small but then again I was use to the DTS. They could also put a little more wood trim inside but all in all we are very happy with the car. We have owned 3 BMW and 8 Caddys and a lot of others. WE are happy with our choice.",
      "THE GLK 350 MERCEDES BENZ IS AN EXCELLENT CHOICE , IVE EVER MADE , IM VERY SATISFIED W\/ ITS COMFORT , PERFORMANCE , QUALITY , APPEARANCE ,SPACE AND LASTLY THE VALUE FOR THE MONEY ! I WOULD LIKE TO RECOMMEND THIS SUV TO EVERYBODY WHO IS LOOKING FOR A \"DO IT ALL\" LUXURY VEHICLE .....ARNIE",
      "Great compact crossover value. Great gas mileage for vehicle type, with average acceleration for a six cylinder vehicle with rear wheel drive handling characteristics.",
      "the suv is awesome great handling on and off road , fast and responsive , totally its the best in its class",
      "The front part of the vehicle looks good but the rear part looks like Hyundai NF Sonata. The vehicle is very bulky especially the back part due to which vehicle takes lot of time to pick up speed on freeway. The vehicle drives same like Hyundai NF sonata, there is no need to spend so much money. It is better to buy a HYUNDAI.",
      "I traded my 2007 Escalade for this car. It is a lot smaller with a slightly better mileage. Not as comfortable or as luxurios as the Escalade. Leg room in the back seat is tight. Ride is fair, handling is good.",
      "I had a BMW before this car, it was fun to drive but it didnt have all that luxury I thought it should have. And I always thought that the Mercedes was all about luxury and comfort. Well they just added performance. I am very happy with my choice.",
      "Great car! Runs drives great. A bit of wind noise around the front door seals but I understand they are just that way. Great fuel milage. I have owned several Mercede's and they are excellent autos!",
      "I love this SUV. It's really a crossover smaller than the MK but of course larger than the sedan. My only complaint is space. The trunk space is sufficient but the passenger space is not. If you only have more than one child you may find this car wanting on space. Other than that....it's a Mercedes!",
      "Overall I love this car. After about 2 months of ownership I am fairly certain I will be purchasing another Mercedes after this one as long as they don't go generic like BMW or other making the body shape look like everything else. Performance is awesome and balanced well with a nice smooth ride. The only downer is the interior is a bit compact but keep in mind I am 6' 2\". I find most cars and even alot of SUV's just a hint too small for me. For the average person the size is awesome. It is low to the ground but for a car to commute 30 miles to and from work and occasionally have to haul the kids around it is perfect. Gas mileage is great!",
      "The C300 luxury edition is a much better buy than the sports edition for my money. I test drove both and I felt every bump in the road, and there apparently are many, when driving the sports edition. The luxury edition was like driving a living room down the road. Even though Mercedes is producing more C class sports edition, go for the luxury edition. No question.",
      "The car was exactly what I was looking for. The mileage was low and the interior and exterior were in perfect shape. The sale was great and I love my \"new\" car!",
      "My wife and I rented a 2010 Merecedes Benz GLK 350 4Matic for a weeklong vacation to California. We drove the car about 1200 miles in total, so we got a good feel for it. First off, the car was extremely well made...ours had 30k miles and almost no wear on the interior at all-impressive for a rental. The performance was surprisingly good for a car this heavy as well. Almost no body roll in the corners and more than adequate acceleration. In all traffic types we averaged 21.5 mpg-right in line with the EPA estimates. Overall this a great SUV, although it doesn't really provide any more room than a mid-size sedan (we got all of our luggage into a 2006 Corolla as well). I would compare it with other competing and less expensive SUVs before buying one, but this is still a fantastic car.",
      "I really thought there would be more to this costly vehicle. I seemed cheaply put together, completely lacked the excitement that I expected.",
      "I’ve owned 4 Mercedes in my lifetime and this is definitely the best one yet. Am 65 y.o. My car is a 4wd and you need it in Maine had lots of snow last year hear. if your looking for a big car this is it , but wont save you any gas money ! Well am off to look at the new ones to day 2012 , if i get one it will be my last one for me in my lifetime . if you do get one buy only new , don't play games on a use one .",
      "Excellent car- real luxury sedan If you have never owned a mercedes, then I have to tell you that you are missing one of the best cars around!",
      "Great SUV with nice features and excellent towing capacity.",
      "Good little SUV...Good on gas for the type of suv it is and diffently one of the best small SUV on the market. Cant wait for the snow to see how it fares up (which is why I brought this suv over the others) Its the little things that make Merc GLK stand out.. The disk brake close closer together when at higher speeds. Seatbealt braces for inpact. Air brakes when in nutral. ect ect ect So far I like my GLK and glad I choose it over X3 and RDX from the reviews I saw.",
      "The C300 is one of the best seller of the hole M-B line up.Only a few negates #1 premium fuel.#2 information center and navigation set-up complicated #3 tire wear at 20K the rear tires need to be replaced.Now the good things 22MPG,not bad from a 5000lbs Automobile,sport car like handelling, excellent brakes, more fun to drive then a barrell of monkey's.",
      "Great car! I have owned 3 other MB's and this one drives like a dream! Great features!",
      "We drove four other comparable models. There were a lot of things that went into this decision. For one outside item before I get to the car, the knowledge of the sales people was oceans better than most mainstream car dealers (Ford, Jeep, VW etc.). That was our experience here. This car drove much better for me than all the rest. Then little things start adding up. The steering wheel grips nicer. The electronics seemed better. But the biggest item was how it drove, just solid w\/ the gravity center spread out to all four corners. We just really like it a lot!! We did pay a bit more but we think it will hold its value better. I do encourage anyone to drive at least two or three models of other cars. We knew this was it one block from the dealer it was that obvious.",
      "Brought this car for wifes birthday, second mercedes we have owned. We both love the car, it is well built and has great curb appeal. The ride is smooth and has more power than expected. Would recommend this model to family and friends.",
      "I stepped up to this model from a 2008 C300 Luxury Sedan. The changes are subtle, small improvements all over, which only show up with use. Am very happy with it. Being a Sport, it is stiffer, which is appreciated when driving throu the mountains in Western NC It could use more power and the seal moulding around the trunk came loose",
      "We have been very pleased with the driveability of the MB GLK 350. It drives very smoothly and comfortably. The steering is tight and easy to drive. The amenities of the vehicle are quite complete. The only downside is the lack of cargo room when the seats are upright; however, that is the price you pay for this size SUV. Having driven Fords for the past 10 years, we are more than pleased with the MB and its manuveurability. Gas Mileage has been around 21+, so an added bonus not listed on the manufacturer's specs. Would recommend this car to anyone looking for a smaller SUV at a reasonable price.",
      "through my car owner's life i have had about 20 different cars. most of my cars were up-grades from the one before . my ideal end of the line was to be the owner of a newer mercedes= benz. This is now the case ,thanks to car\/max. this car is a dream come true for me . at age 80 yrs. i except this car ,beautiful and great performance, will be my last",
      "Absolutely great buy for the money. Superb form, fit and performance. Great power to weight ratio, handling in traffic and long distance comfort. A great all around entry level MB that has classy looks and feel for the road. Gas mileage is good, interior finish is better and performance is best.",
      "this car was a surprise gift for my wife.She adores it and loves to show it off.the front end styling is one of her favorite features as is the bluetooth which automatically syncs with her phone when she gets in. the seating is comfortable and the handling is better than average although the acceleration is a bit placid and there is a significant lag when you jump on the gas. All in all a great value for the money and CarMax made it easy and affordable",
      "I purchased a 2011 MB C300 sport sedan for my mother. She ABSOLUTELY LOVES the car! So do I!! It runs great and drives smooth. My mom says it makes her feel elegant and sexy. It's got great comfort and is spacious. Alot more spacious than my 2005 MB C230K. The car came with almost all available options except the lighting package. The panoramic roof is great for viewing the stars at night from all of the seats (passenger, driver, rear seats), the bluetooth system works great for a hands free device and the navigation is great for getting around in unknown places.",
      "EXCELLENT car, very sporty. good in gasoline. Love the purchase.",
      "I am coming off of BMW ownership for the past 16 years. I prefer the sportiness and handling of those cars. However, wanted to see what MB was like. The E350 is superb value as it is less than or right around the price of a new 3 series and it is more car. MB is smoother, softer ride but handling is every bit as good as a BMW. It's slow off the line, but it gathers speed well. A gentlemans express. The interior is arguably better, more jewel like and the tech is easier to use. Much more confident on the highway. It doesn't follow every rut like a BMW would. To sum up: more plush than a BMW without sacrificing handling and it's huge value.",
      "This is a great car. Now I know what they mean by German engineering. It is a joy to drive, its response is quick and easy, it feels very powerful but very smooth. It is now a real treat to glide through the 'round-a-bouts'. All the systems are automatic; the windshield wipers, the lights, the seat settings, the mirror settings, the steering wheel position, and probably more I haven't learned about yet. It is beautiful and luxurious and just my size!",
      "Two words that most aptly describe this car: pure exhilaration! I've owned over thirty cars and my 2010 Mercedes-Benz SLK 300 beats them all hands down. The interior appears cramped at first outward glance, but the body-contouring seat fits my 5'10\" frame perfectly. This six-cylinder car has impressive rapid acceleration capabilities and hugs the road as if it were on rails. The convertible top is truly a feat of German engineering at its finest. The Formula One inspired front nose is beautiful and slices through the wind with the gentlest of ease. I purchased this as a pre-owned vehicle as I do not care for the front nose of the 2012 and 2013 SLK models, which appears more like those on today's many newly domestic-made automobiles. The six-CD\/DVD navigation system, integrated Bluetooth phone capabilities, and voice command prompts add bells and whistles to the car's numerous bells and whistles. As I've stated at the beginning of this review, this car is pure exhilaration!",
      "The minute I viewed the car, it is what I wanted to purchase. The style of the coupe, and the mileage efficiency was and continues to be is excellent.",
      "Purchased the this vehicle two months ago, what a great way to go. I had a 1998 E36 BMW M3 years ago, and I loved everything about that car. The power delivery, comfort, technology, and European styling was just something that I couldn't forget. My wife and I just had our first born just a little over two weeks before purchasing our E550. I wanted to have a vehicle that was known for its first rate safety features, comfort, technology options, and storage space. Essentially, I wanted a car that had those unforgettable features that I had on my M3 but more for a grown-up taste. I've divided my review from interior to exterior as follows: Interior Cabin: lots of space (I'am 5'6\" btw) for front and rear passengers. Plenty of headroom for the rear passengers. I was able to fit my daughters car seat well, and this car came with slots to directly hook the car seat attchement hooks to. Lots of technology features like NAVI, backup camera, Harman Kardon 7 Logic Speakers, and keyless go (I had to purchase the Start\/Stop button at MB, since our car didn't have one). The leather isn't the softest in the world, but I don't really care too much for leather. All I can say is, at least it's easy to clean. All the instruments are easy to use and control. If you know how to use a computer with a mouse, you'll do just fine. Exterior: What can I say, this car definitely look way better than the previous model year. LED lighting on the taillight, and adaptive headlights in the front are just too cool!!! Our car came with Driver Assist (warns the driver if your not staying in your lane), the lights even adjust to the environments condition (high beam lights-up automatically in super dark areas, and turns off when passing on-coming vehicles). The best thing is the amount of power this car has on tap when you need to get out of tight traffic situations (5.5L V8 382hp). It's no where near AMG performance, and I am sure that there are more compact BMW 3-series packing just about the same, but for the amount of room and power delivery, this car was the best package for me and my family. Lastly, the trunk was large enough to store a stroller, and some small bags for medium to short distance trips. I hope this helps any parents looking for a nice family car that is loaded with safety features, as well as the ride comfort for whatever distance road trip you plan on taking.",
      "Ive owned my 2010 MB 300 4Matic for 2 months already, and rides very smoothly and impressive quality inside and out.. Only drawback is the horsepower of the car, had a V8 before this car, and this car has slow start but picks up pretty quick after that. If power is a big issue, try the C350, which most likely ill upgrade too, other than that, its a beauty...",
      "This car is the best we have had in the time we have lived in the USA",
      "This is a nice car overall, but lacks some things that you might expect from a Mercedes. Most of all, I am underwhelmed by its performance. I traded in a 12-year-old BMW 3-series that was much more responsive than this car could ever dream to be. The C350 has a terrible \"lag\" between the time you hit the gas when you're at speed and the time it grabs hold and accelerates to a higher speed, something I didn't notice on the test drive. Sound system is ok, but nothing special. Seats are comfortable, and lumbar support is a plus. The navigation system is kind of a joke-- doesn't even give street names, just says \"turn in 500 feet,\" etc. The video map isn't labeled with street names either. The car has a really smooth ride, comfortable back seat, and is beautiful to look at. I will definitely keep it a few years, then trade it in for a BMW.",
      "This is my second purchase of the ML350. This is a great Suv if you have children. It has just the right amount of room for them to be comfortable and it also has all the luxury that Mercedes Benz is known for. This particular model has most of the upgrades and the video system was a great new addition for my boys who are 10 and 13. I love the options I have for music, satellite, I pod\/I phone; MP 3; DVD; CD; HD Stereo sound and Memory card. Great on road trip with 21.0 mpg, and 18.0 mpg in the city. Comfort and luxury that's exactly what I wanted.",
      "Initially I diid not go to the lot to purchase a Mercedes. However, I tested drive several cars and when I got into this car I fell in love. The style, the driving performance the comfort is incredible. I love this car. The price was great and I am really happy with my new car.",
      "I used to drive Asian brands for more than 30 years and pretty much satisfied with them. Attractive design and affordable price attracted me to consider C300. As I research, I found this model was exactly what I was looking for. I am very happy with this beauty and enjoy everyday. Only one issue could be better is gas mileage.",
      "This is a comfortable big SUV that has reasonable economy. It needed to be serviced as soon as I bought it, which immediately cost me almost $1,000-00. At that time the Mercedes Benze service people replaced the steering wheel, which was cracked (under warranty). Otherwise it has run very nicely and both my wife (who is the regular driver) and I enjoy driving it. I would definitely recommend this vehicle and Carmax who were very easy to deal with.",
      "I like the vehicle very much. Being only a C-class, it really exceeded my expectations with the standard features. While it's a little slow off the start, it is quite comfortable, and handles extremely well on turns. Additional standard features that would have been a part of my wish list, would have included a backup camera and automatic high beam adjustment, both of which it did not come with. Other than that, I'm extremely happy with my vehicle choice. On the downside, the only frustrating part of my purchase has been my inability to create an account on the MBUSA website. Despite multiple attempts, and talking with customer service, I have yet to be able to set up an account on the Mercedes-Benz website.",
      "Great car, I got it at a great price with low mileage . It rides smooth and has great pick up! Great used car!!",
      "We nice looking car. It's elegant and stylish. I owned an 07 and now the 2011 is even nicer. All the gadgets are placed in the right spot for easy reach. I am certainly enjoying the ride.",
      "This is the second E350 I have bought but this is a wagon. I cannot tell you how much I love this car. Being a wagon with 4Matic it's a little heaver, about 400 pounds, so the gas mileage is around 23 average but out on the highway I expect to get around 30 as the other did. I have been looking for a wagon for about a year as they are very hard to find in Arizona. I have driven and raced many cars and I can say this one drives and corners better with the all wheel drive. I cannot wait to get it in the snow and put it through its paces.",
      "I am really enjoying the luxury of this car. Most importantly, I enjoy driving it and being a passenger. It's very cozy, classy and comfortable, I enjoy getting the attention because of the beautiful blue metallic color and it has the sports edition. Awesome. It's an eye catcher.",
      "Great car really can't complain but you would figure all Mercades would come with HIDs. Next car I would prob still stuck with Mercades but a different class still a smooth ride",
      "I simply love this car! You can feel the quality the first time you drive it. No tinny sound when you close the doors. Plenty of get up and go. Suprising amount of room, more room than 3 series Bmw, comparible room to 5 series. Not overwheming technology, to create confusion or worry down the road if it fails. The ride is stiffer, sportier than expected. Got the 4 matic but havent had a chance to try it in the snow.",
      "So let start off by saying I've owned BMW, Audi, VW automobiles and owned a Toyota RAV4 Limited AWD (to see if I liked driving an SUV). All of the vehicles encountered usual small problems (sensors, HID bulbs, rattles, etc.). Those problems were not encountered with the RAV4 and I especially like riding higher than a car. I stepped up to the midsize SUV in the MB with 4Matic (AWD) and I love SUVs even more (purchased a 2010 model from CarMax with 17000k miles). This larger vehicle provides even more comfort and definitely does not have the rattles... its so quiet now. The technology it came with is standard for the year it came out but it is also in great functional order. Leather seats are comfortable, especially on road trips, and spacious for me (big and tall self). Even my feet have more space! The ML350 gets approximatly 18 MPG (compared to the 20 on the RAV) but it has a much bigger gas tank... so I'm finding fuel costs to be just slightly higher due to premium requirements. The only dislike is the sun roof. A single push of the button allows it to open all the way (or partial) but closing it requires constant pressure on the button. And then it sometimes flips up so I have to close it again. My old Toyota didn't even do that. Single open and single close would be much appreciated. The newer ML350s probably have that resolved. Intermittent wipers are great and only click on with the sensors activated (intermittent or full depending on setting). Stereo is great as well as the bluetooth functionality for joining with my phone for calls. No issues to date (have owned for two months). It's really a phenomenal car. I only wish I could afford a brand new one!",
      "The quality of Mercedes has gone downward over the years. I've had a few of their cars and have seen the quality and reliability go south. Too many visits to the service department, even though it's covered under warranty. One shouldn't need to with a car of this type! Consider a Japanese American made car instead. These cars aren't what they used to be - QUALITY.",
      "I have had my E350 now for about 6 weeks and the car drives and rides like a dream. I was really surprised about the fuel economy on the car, I am averaging over 21 miles per gallon. I would recommend this model to anyone like myself who is on the road the vast majority of the day.",
      "I did my research on-line and was very pleased with the amount of car that I got for the money. It is comfortable and roomier than I thought. I am still learning all the gadgets it has to offer which is a lot! I love my new Mercedes!",
      "I love this car! It seats 7 comfortably and has lots of cargo space left over. The gas mileage is not great but I love driving the car so it's worth it.",
      "This car is amazing! It's even better than I expected; beautiful inside and out. Good on mileage too. Hope to keep it for many years to come.",
      "This is a well-made German sedan with the Premium 1 Package, providing all of the options that more people would desire. Don't buy the version without at least the P1 package. However, the one thing missing from the P1 option package is that it has the old Halogen Headlamps, versus HID or LED. Quality, fit and finish are solid throughout. DON'T buy without an extended warranty. I checked with MB and at ~ 9K miles, mine had a $12,000 AWD transmission replacement under warranty - imagine paying for this on your own at 50,001 miles.",
      "I purchased my Mercedes Benz C-300 Sport (9,000 miles) from CarMax five weeks ago. I returned to CarMax to trade in my 2007 Infiniti G-35 for a newer model sport luxury sedan. I drove the BMW 325i and the Audi A-4 before deciding to drive the MB C-300 Sport. The car has a very sporty look inside and outside - the sport grille with LED lights is a head turner. The first thing I noticed about the car was the craftsmanship and quality but there would be some trade offs. For starters, the MB C-300 has an awesome feel for the road if you like sport suspension and low profile tires (oversized on rear); however, it is about a second or so slower than the competition (Road and Track) so if speed is what you are looking for look elsewhere. I will say the difference in power is easily made up by switching to S mode or by driving it as a manual. A few other trade offs include gadgets such as no garage door opener on the rearview, no memory driver seat, no sunglasses holder ... all things I can live without. It has plenty of built in toys such as an ipod or iphone connection, usb, and extra 12v hub and the usual creature comforts one would expect from a luxury automobile. I love the cup holder configuration and the fact it actually stabilizes anything I place in it and keeps it out of my way. The dual center console is also nice. There is plenty of leg and head room also. The sunroof is large and a nice option. After driving the car for 5 weeks I have grown to love it. It is very quiet and has an awesome stock 10 speaker sound system. The driver information center is estimating about 22 mpg on a mix of city and highway speed driving. Best of all the maintenance is every 10,000 miles. Yes, MB routine maintenance is a bit pricey but you get what you pay for and plenty of perks. I took it to my local MB dealer right after I purchased it just to make sure it was serviced properly and still under warranty and it was - and - perfect condition bumper to bumper. Overall I am very pleased with my first MB.",
      "This car is a dream! smooth yet peppy when it needs to be. Just enough luxury to be classy but not too elegant to be a sports car. the craftsman ship is excellent the doors close like a tank this car is built rock solid. I like everything about it",
      "I HIGHLY RECOMMEND THIS CAR TO ANYONE ALL OF MY FRIENDS.Try it you willl see for yourself. It's like riding on cloud nine. I did not know until I bought one. I have bought many type cars nothing like the Benz.",
      "Wife's third Mercedes. Started with an M class, then an E class. This R class is the best one yet. Ride is much smoother with a more solid feel than the E class and much more room than the M or E. The car turns on a dime, parking is not the challenge I thought it might be. Back-up camera a great additive for safety. We have never been disappointed with owning a Mercedes but this one really is our favorite.",
      "overall good will be greatbif the drive is goodnand smooth",
      "good car, but has a few minor issues like starting hickups and tires shock a bit hard",
      "What's not to like. Mercedes-Benz has been a top car maker for some time now. The GLK was designed in 2009. I have admired the appearance since that time. But now as a owner, the ride is always a smooth and quite ride, The car has all the high tech equipment that you could want, you are able to use your laptop, talk freely with the Bluetooth devise, and curl your hair ladies, having a electrical outlet for that quick hair do. The backseats is what sold me. I have two little girls ages 7 and 8, they are tall girls, so having that extra leg room was a plus. Gas purchases is also cheaper than what I was paying before. The quality, performance, and the looks that you will get when driving a GLK is an indication that you made the right choice with your selection. I know \"I DID\". Thanks for allowing me to talk about my experiences so far.",
      "I absolutely love my Mercedes. I have always wanted one and now that I have one I love driving again. It is a super comfortable vehicle and it rides very well. I wish it got a little better gas mileage but I love it nonetheless.",
      "So excited driving my Mercedes C250. Purchase of the year. I absolutely love this car and my salesperson Tony was amazing.",
      "I love this car. It drives like a dream and is very comfortable and spacious. There are days when I just drive my car just because it drives so wonderfully and hugs the road. My C300 Sport 4 Matic came fully loaded and I love all of the features. There are several means of controlling each of the features which makes it more convenient and less distracting while driving. I definitely recommend this car to friends simply because of the style, comfort, quality of Mercedes-Benz, and the awesome luxury features. Love, Love, Love it!!!",
      "This car is the best purchase i have ever invested in. I went from a Ford Expedition to this car. Saves me alot on gas.",
      "I couldn't be happier with my MB ML350. The ML350 is my seventh SUV that I have owned and it is by far my favorite of all. It has plenty of power and yet performs very efficiently both in town and on the highway. I get around 24 mpg on the highway and around 18.5 mpg overall which is very good since I live in a hilly area. The ride is very quiet and the vision excellent. The back up camera and related system is extremely helpful and very accurate. For a mid-sized SUV, it has tons of cargo space and the back seats fold down and return effortlessly. The power lift gate function is one of my favorite little features that make the car super functional and convenient. The interior finishes provide a comfortable and secure ride; the electronic features are easy ti use and are better than any other car that I have owned including Range Rover. The size is perfect giving me plenty of head room but cargo space, and also has an excellent turning radius and is easy to navigate small parking spaces. Overall, I love my ML350.",
      "The C250 is not only an awesome car to look at, it is also an awesome car to drive and own. The Harmon Kardon sound surround sound system with media package is a must. The car has smooth lines a smooth ride and is as quite and stealthy as a jungle cat! The twin turbo has what it takes to prowl and propel you into the fast lane.",
      "The E550 from Mercedes Benz is all that you could ask for in a mid-size performance oriented car. I had a CLS 550 before and loved the engine so sought out an E550 with most of the available options. We have a wonderful MB dealer here and their customer service is unequaled. Cost for service on these cars is certainly higher than most of the Japanese models but less than BMW. The thing that made me choose this model with the driver assist package and distronic cruise control is that these safety features are truly remarkable. Mine has the multi-contour seats which I could have done without. They do give you a nice massage I must admit. I choose to buy the extended warranty from CarMax; they will bring most of the repairs to the MB dealer and at a savings from other warranties like Easy Care or the manufacturers extended warranty. I would certainly recommend it with the following notes: exterior styling is just ok; car takes hi test fuel; milage is not too bad; I get about 19 around town and 25+ on the highway. Starting in 2013 they changes the smaller V6 model E350 with improved milage.",
      "This is my first Mercedes Benz and I am pleased that I purchased it. The looks, handling and overall comfort are impressive.",
      "This car is a luxury model with smooth ride and fast as well",
      "My wife and I just love this car. It was not inexpensive but is well worth it. Its a beautiful car. You feel like you are ridding on air when you are in it. Great car and we are pleased with CarMax.",
      "I enjoy driving this car and the attention that it brings from others. I was surprised by the quickness! I own 4 other autos (which includes a GT Mustang Convertible) so, I do know something about quickness. I brought the E Class ( Black on Black with Crome Rims) and would highly recommend this car. The buying experience was stress free and enjoyable.",
      "I drove a Lincoln LS for 8 years and really debated trading it in as it will still in excellent condition. I finally gave up the fight after seeing the Mercedes C-250. I absolutely love everything about this car. The interior is roomy and comfortable with wonderful refinements. The car I bought is listed as Steel Gray, but has a blue sheen as well. It is absolutely beautiful inside and out. It drives like a dream! I would highly recommend this car to anyone looking for a luxury car without the luxury price. The 4 cylinder engine is much less than I had in the Lincoln (8 cylinders); but it has plenty of get-up and the ride is very smooth. The C-250 has lots of bells and whistles and it will take me a while to learn how to use everything; but it offers essential safety features like an SOS button, which luxury vehicles should have. The navigation is very extensive and something that I really wanted in a new car. I looked at many different vehicles before deciding on the Mercedes C-250 and know that I found the perfect car for me.",
      "I love my C300! My experience at CarMax was overall quite good. I got a CarFax type report and the salesman was quick to point out that the car was a previous lease. That's all I focused on as I reviewed the report. Somehow I missed the fact there was also a reported accident when the car was new. So far the car performs and looks great but I'm having it checked out this week at the MB dealership for some peace of mind. Also, there was damage to one of the wheel rims and when I was trying make my decision whether to buy or not the manager was absolutely unwilling or \"unable\" to make any allowances for it. Like CarMax says, you buy it as is and there is no negotiation. That's good for the most part but be sure you check things out right away so you can take advantage of the 30 day return if you find something out. I simply waited too long. Fortunately I love the car and overall I was happy with the deal.",
      "If you died and went to heaven in car, it would be in this one!",
      "I owned a Lexus ES 350 prior to purchasing the Mercedes Benz ML 350 and I am sorely disappointed with the vehicle. First, I expected the vehicle to have parking sensors since it does have a back-up camera and it doesn't. The doors do not automatically lock when existing the vehicle and I think it is sill to have an MP3 output in the glove compartment which only has a 1.5ft cord (impossible to use from the driver seat). The ML 350 also does not have the capability to link to a home garage system and fog lights do not have the option to automatically stay on with daytime running lights. I would think that Mercedes would have more features seeing that they are considered a luxury brand.",
      "Great handling vehicle with excellent acceleration. Drives more like a sports car than a luxury vehicle. The location of the turn signal often leads to accidentally activating the cruise control. Great looking vehicle!",
      "This car is an amazing driving machine. Prior to this I had the CLK 350. I miss the get up and go with the E350, but the ride is soooooo smooth. Amazing car!",
      "The 2013 Mercedes GLK350 is the best purchase I have made! I love this car. It is the perfect size for my family (we are a family of 3). It is sleek looking, great on gas, and for the price is by far the best SUV in it's class. I also looked at the BMW X3, Infinite JX, Acura RDX, and Audi. For the price this is best SUV and it's a Mercedes. You cannot get any of the other crossovers in it's class with the options, look, and wonderful performance for the price. Go Mercedes!!",
      "I purchased my Mercedes-Benz 300 at Car Max. I am experiencing a whole new way of driving with this European Vehicle. I would advise anyone to buy one and see for yourself. I am enjoying the way my car ride in the city and highway, not to mention the way this car will make others begin to rubberneck. Thanks so much for the experience. I will purchase a BENZ for life.",
      "For an intro to Mercedes vehicle the quality is definitely great. Usually intro cars tend to not only look cheap but are made poorly also. I was really impressed with this one and so were the engineers\/car gurus in our office (I think that’s a good sign).",
      "It's a good size and very comfortable. Can seat 5 and has a big area in the back for groceries, etc.",
      "This is my 2nd MB and I have bought both at CM. The buying process was easy- had to get my \"perfect\" car transferred which was no problem. About the car - I LOVE my 2011 C300 4matic. I had a C240 4matic and this one feels so much bigger to me. Not sure if it is the color (white) or the car. The ride is smooth - the seats are so comfortable - it has so much get up and go (unlike the 240) - and the style is to die for. I got white with tan interior. The only little thing that bothers me are the timed\/sensitive wipers. The lowest setting doesn't speed up if the rain increases. I find myself constantly adjust the setting. Other than that I love this car (did I tell you this was my dream car??). I love the luxury that this car offers (bluetooth- great sound system - heated seats - memory seats - etc) and the ride it provides. I am very pleased with the purchase and feel like I got a good deal.",
      "Great car for the price. A very easy way to introduce yourself to German engineering, specifically Mercedes-Benz.",
      "Sporty, Compact, Good safety rating, Modern interior, Luxurious exterior, amazing handling and V6 engine that be used both as Automatic or Manual shifting (E & S)! I just love it.",
      "The car handles very well, it good fuel economy, and if you keep it maintained they will run forever.",
      "It's stylish and comfortable with everything that one thinks of when they think of a Mercedes.",
      "I recommend this vehicle for many different reasons. It’s styling, prestige, power, comfort, etc. It’s truly an amazing vehicle if you’re in the market for a full size SUV.",
      "The vehicle is reliable and solidly built. I'm glad I made the purchase the salespeople and staff are exceptional and top notch.",
      "I walked into the dealership to get my Lexus IS250 convertible transferred from a different location to Orlando and saw this car displayed in the showroom. I was literally \"wow\"ed by the appearance and it was \"love at first sight.\" The price was about $6,000 less than the Lexus convertible but you are getting SO much more for the car. However, there is a bit of a learning curve and there are a few design flaws (i.e. the cruise control bar is right above the left hand multipurpose signal bar). It's extremely quiet and very comfortable. Performance wise, it's more of a luxury car than a Corvette or a Porsche. Not as \"fun\" to drive compared to other sports cars. Overall, I have to give Mercedes HUGE thumbs up for paying attention to even the most minute details. Before you buy the car, make sure it has as many options as possible. The more the option, the better to drive. Good luck and enjoy your new car. It's a dream to drive! *not to mention it being a head turner.",
      "Mercedes-Benz calls this car \"affordable luxury,\" and they are spot on. We purchased a 2012 C300 4MATIC Sport a few months ago and are really pleased with the vehicle - it is sporty, stylish and comfortable. The handling on the Sport model is very similar to a comparable BMW and the AWD inspires confidence in wet weather. It amazes me that the car rides so well and yet handles and steers with such precision. The acceleration is good, and you can put the car into \"Sport\" mode (versus \"Economy\") to make the car stay in gear longer for better performance. Another reviewer said he had trouble finding the hood release, and so did I, LOL. If you look under the dash where the steering wheel is, you'll see the red handle to pull. Once you get the hang of the Sat\/Nav\/Radio controls, it's a breeze to operate. I also love how we can get weather information on screen, including radar, based on our location (or any location)! If you like music, opt for the upgraded stereo - the stock stereo is only adequate, IMO. If you like a digital readout for the speedometer, you can add that using the steering wheel controls, as well as real-time MPG, miles to empty, etc. The steering wheel not only goes up and down but also \"telescopes,\" which is very helpful in achieving the ideal driving position. So much to love on this car! Even though I purchased this car for my wife, I love it so much I'm considering getting one for myself, although I'd probably need the extra leg room of an E-class.",
      "Excellent car. I bought it two months ago and I have enjoyed every day driving it!",
      "The car itself was amazing and beautiful. Great car, however the customer service is another story. Car was nice n clean.",
      "My first Mercedes and I absolutely love this vehicle. It's nothing like I have ever driven. I owned a Subaru Tribeca and I absolutely loved driving it in snow with its AWD. If I thought Subaru was perfect for driving in snow, then Mercedes GL 450 beats it hands down. And the luxury interiors match the reputation of a Mercedes. Its expensive though and I am not sure if its expensive to maintain too. Fingers crossed!!",
      "This particular unit was offered a very attractive price",
      "Yes, but with caveats. Mercedes C-Series is what it is. Great car, overall very happy with mine. That said, based on my present experience this will likely be the only Mercedes I will ever own.",
      "My wife and I are having our second boy this year and decided to trade in my truck for the glk. have owned many vehicles and have only been driving this for a short time and can honestly say that it's handling and maneuverability is second to none. It has copious amounts of space for kids pets and luggage and just enough room for my wifes newly ballooned ego. We have always purchased midrange price cars and were in the market to spend abit more. We found a entry level MB for under 30K. In one word flawless.",
      "If you don't have a lot of kids then this car is for you. It is a sports sedan and its not the biggest car but it is just the right size for me. It is very reliable and I haven't even learned all the different things that this baby will do. I LOVE IT!!!!",
      "Handles well - fast and nimble. , good power for its size. Great brakes. Comfortable and easy to drive. Good gas mileage. Mercedes quality, reliability and technology.",
      "The feel, the handle..the car is so fun to drive",
      "It is a great car all around",
      "this is a great car to drive and has enough power to make it feel good",
      "Probably the best vehicle I have bought ever in my life. It's a stylish, reliable and responsive vehicle at the right price point.",
      "It's a beautiful car, handling is great, ride is smooth and acceleration like no other",
      "I had an explorer and than a mercury and the gl450 i got a couple of months ago at carmax has been great. Far surpasses the explorer and mountineer in all catagories. the only thing i wish the 450 had was a bit more space for my phone and such in the center console instead of two drink cups.",
      "this car is very preysentable and has a great look.",
      "WOW! BMW, AUDI, Lexus are in trouble. This newly redesigned Baby Maybach is the clear leader. A built in fragrance atomizer? Freakin genius! Seats are very comfortable for long trips. With the driver assistance package you can pretty much set the cruise and the vehicle will drive its self. Very impressed with the 2014 Flagship Benz.",
      "As for those who have interest in the Mercedes Benz GLK350, I will assure, it is the finest automobile I have ever owned in 50 years of driving various other vehicles. Quality, comfort, and drivability are 5 Star, after having driven the GLK350 each day, I must admit, I still look forward to each drive. The adaptability and practicality of the SUV style of the GLK350 makes re-configuration effortless from passenger to cargo carrying. My wife also has a GLK350, and we both have agreed, hands down, the only vehicle we will continue to own will be the Mercedes Benz GLK350. As I have remarked many times since we have purchased both GLK350’s, it is not the emblem on the front of the car that sells, it is the superior quality, performance, safety, and comfort that sells. If you are interested in a quality SUV, before you decide, make sure you drive a GLK350!",
      "Easy access to technology while driving. Safety on this car has a high rating. Style is great.",
      "I would recommend it to my family and friends they have the best offer and would tray the good price for you",
      "Great vehicle and body styling ques.",
      "I would definitely recommend the GLK 350 to anyone in the market for a luxury suv\/car. You'll get the best of both worlds. Its not too big or too small. Smooth ride and nice features. The only thing I can say that was not great was the tires on the vehicle at the time I purchased it. They were weathered and didn't have sufficient tread. Other than that the car is a good reliable car.",
      "The car is easier for my husband to get in and out compared to BMW sports car we had before. Very comfortable riding car. I like the interior. Trying to get used to ECO feature. Also like the roomy trunk space. Overall I love driving the car.",
      "Quality through and through. Handles like a fighter jet.Does not break the bank",
      "Handles the road well, no lean on curves, but rides quietly. Four wheel drive provides weather protection, and there is power in reserve for acceleration when ramping up to expressways in front of trucks traveling in excess of 70 mph. On the negative side, there are so many electronic gadgets, who has the time to read through three owners' operating manuals? Also, though we have not yet had to take this Mercedes-Benz in for service, we know from past experience that Mercedes-Benz service charges are astronomically high, and unfortunately, do not always achieve problem resolutions in spite of high charges..",
      "I have always wanted a black on black S550 Benz and now I have it. I took it in for my first oil change to a Mercedes Benz dealer and they said the card was in EXCELLENT condition. This was my 2nd Benz that I have bought from Carmax and I love them both!",
      "It is comfortable, smooth, economical,",
      "Beautiful lines - Lots of power - Luxurious",
      "This is the sedan to drive, don't wait until you have gray hair to get one, enjoy it now!",
      "Classy, affordable, fuel efficient backed by a reputable name, loaded with technology and coupled with great handling and sporty style",
      "After 500 miles....... Fact: 29 miles per gallon in 65% Freeway driving. Fact: No rattles. Fact: Very, very good brakes Fact: The turbo boost greatly influences acceleration. Subjective: It's a beautiful car. Sure, some could call it a 'chick' car (please note prior revues). I'm no chick (but this vehicle is much better looking than the Corvette I drove as a young Naval officer. ez",
      "Excellent gas mileage.. We don't live in a city and do most of our driving on highways and have been getting better than 25 mpg. The car handles like a dream on highways, ample power for fast starts, comfortable ride with lots of room for cargo when the rear seats are folded down. Truly love this car.",
      "Great value good handling in the snow. Love the 4 wheel drive.",
      "Yes and no, this car is an excellent deal for the engine and life of the vehicle. However this car EATS gas like crazy!!! I do not think I am getting 16 miles to the gallon. I think its way less. Also its expensive to keep up! But hey that is the cost of luxury vehicles. The model I purchased was a base model with 25000 miles. Excellent deal cost wise.",
      "Pure luxury, with all the bells and whistles you can imagine. Top safety rated. Technology is amazing and extremely fuel efficient.",
      "The car just looks great, really stands-out in the SUV crowd. I can get two mountain bikes in the back and the diesel powerplant is just amazing. Nearly 30 mpg observed on a recent trip to the coast, with smooth acceleration. It is quiet, and has just the right amount of chrome. Not a whiff of smoke with the AdBlue juice, it is 50 states compliant and with 400 foot pounds of torque from its Turbo V-6 it will jump if you mat it from a standstill. Diesel engines produce torque really low in the rpm range, so you are shifting by 3,000 rpm. On the track I ran it to 125 mph and it still had power to pass. I love this thing. My fourth Mercedes, I currently own an AMG as well so I know a little about power.",
      "Great economy and just the right size. Perfect",
      "Great fit & finish, sharp styling, more power than expected, superb handling. Requires premium fuel, but gets much better fuel economy than my previous car that took regular gas. Love the panoramic sunroof, auto-on wipers, auto-on headlights, and reverse camera. Great stereo system.",
      "Very well built solid transportation",
      "It is a great little machine that responds as expected and is relatively inexpensive to drive.",
      "A stylish car that commands respect. It's a comfortable ride on long trips.",
      "Excellent car with good gas mileage in Eco mode. Fast off the line and sleek. In sport mode, it will enter super car territory in performance. I have always had Japanese cars and the engineering is excellent. The menus are easy to maneuver through without depending on the manual.",
      "We drove all the cars in this class with AWD. The E350 was the most stable, comfortable, solid ride of all of them. There's really nothing like that feeling - confidence.",
      "Very well rounded vehicle. There are many options to this vehicle that range from adaptive cruise to Night Vision forward looking Navigation. This particular model did not have the rear sunshades for the side windows or the rear seat heat or message options. The Drive of the vehicle is Super and very easy to drive. I could drive this vehicle across country with no problem. The One Command is very easy to use and ahead of its time. There is an option for a SD Card or IPod connection for the stereo. Very useful for long trips in a comfortable and fun to drive Mercedes. Push button start is very useful in not having to remove the keys from your pocket to gain access to the vehicle doors or the trunk. I would rate the vehicle a 9 of 10. Drive one today.",
      "Great little mid-life crisis car and less maintenance than dying your hair blonde!",
      "powerful yet fuel efficient - wow factor! - great \"date night\" car for married couples with young kids!",
      "I've had other SUVs in the past that didn't have passing power. This SUV has a very powerful engine that lets you pass effortlessly. It has has all the technology and entertainment options that are perfect for long drives. It also has the safety conveniences such as rear view camera, parking sensors, and flip down side mirror to allow you to park without accidentally damaging your car. Lastly, it has a tow hitch that I need to tow my other toys.",
      "The 2012 MB E-Class is a fantastic car. It is a true mid-size (same basic size as an Accord or Camry) but is much quieter. The 6 cylinder has plenty of power without the need for a turbo. It does require premium gas, which I understand is more for the catalytic converter than for the anti-knock feature, but I have gotten almost 30 mpg on the highway on mostly flat highways. In the hills of Western Maryland\/West Virginia, considerably less. The trunk is a good size and the rear seat folds down for more storage. I have the 60\/40 split seat which is very nice. The sound\/nav\/instrument system is extensive. It took several days of reading and playing to get the hand of everything. Not that it is that complicated, just a lot of stuff.",
      "If you want a toy or are single and want something that can appeal to the corporate crowd that is a Beaty abc fun to drive this is your car.",
      "It's a Mercedes-Benz….nothing else needs to be said!!",
      "Its more car than we need at that price!",
      "The pros, this vehicle changes the way I drive, the handling is so different comparing to other vehicles I had owned. Though the vehicle is the base model it really astonished and out performed my expectations. Very impressed.",
      "All service is expensive. Additionally, I noticed not long after purchasing that the silver part of the steering wheel was chipping off. CarMax should have fixed this before selling or choose not to sell with CarMax name attached to it. Also, it sometimes squeal when driving slowly. I haven't been able to make it to a dealership while it is acting up so I still don't know what the issue is.",
      "It's really great car. Nice ride. Nice handling. Sporty feel, but still luxury driving experience",
      "I'd recommend this car because it drives wonderfully. This car is stylish. This car is great for small families",
      "Would recommend to a friend",
      "I traded in a newer pickup for this used car looking for better gas mileage but wanted AWD for safety in Colorado winters. I got it, sometimes 30 MPG. This car is what I would consider way above what is necessary, but WOW, what a car. Power, Style, Performance, Luxury. It Turns heads. I have now driven it in 3 or 4 decent snow storms and it sticks to the roads, even better than an Audi Q5.",
      "This is a terrific automobile. It has all the power and luxury I expect from mercedes. You won't disappointed.",
      "After much looking, from SUV's to convertibles, we decided on the C300 4Matic and couldn't be happier. We have had numerous luxury cars and this one is our favorite. It drives and rides great!",
      "This is an amazing car by all standards. It's very comfortable and has a ridiculous amount of power. The engine will ride super smooth and quite in comfort mode. however in sport mode it turns into an animal. I've had no problems with it just hit 100k miles and have had the tires replaced a few times, oil and battery(once). I would recommend this car for a daily commuter that like to have some fun every once in a while.",
      "This is my first Mercedes a 2013 c 300 Luxury and I could not be more pleased ! The quality ,the style, performance I like everything about this car.I traded MKS Lincoln for this and glad I did...",
      "Nice looking car Pricing was just right Stylish",
      "It definitely is a luxury SUV. It has great pick up and gets great gas mileage.",
      "A great car and an excellent buying experience. Jeff Suddreth and Tylar Sparks at the Merriam, KS office made it very easy.",
      "I did my research on luxury sedans before deciding on the Mercedes-Benz E350 over other cars in the category like the Audi A6, Cadillac CTS, and BMW 335i. After driving these modesl, my decision to purchase the E350 was simply that it brings the entire package I was looking for (performance, interior amenities, safety, and reliability) in a design that is strikingly refined yet not over the top. The ride is tremendous and the interior is extremely comfortable for my size (6'2\" 220lbs).",
      "Very pleasant buying experience. It drives very well and no problems.",
      "This a great car. Awesome performance, even though it's a 6 cylinder car it does not waste much gas. That is unbelievable. I have had no problems with my car. Love it!!",
      "Classy sedan that's fun to drive.",
      "It is just an awesome car for a singe person who wants the power and handling of a sports car with the availability and space of a sedan",
      "no haggling will find and deliver a vehicle from any of your locations which is available pricing and availability",
      "This a second car for me. My other vehicle is an SUV. This is the ultimate fun car. It's fun to drive, you can put the hardtop up or down in 15 seconds with one button, the cockpit layout is perfect. It's hot. For a fun car I only have good things to say. I wouldn't buy it as an everyday vehicle. The trunk space is very limited because of the roof. The seats are for average people. My brother is 6'5\" and can barely fit.",
      "CLEAN DRIVING AND ELEGANT CAR",
      "For an entry level luxury sedan, this care has most of the bells and whistles, but not a lot of fluff that most don't need (Nav. in the age of the iphone). In addition, the care rides like a magic carpet. Just what you'd expect from a Benz. I am very pleased 3 months into ownership.",
      "Excellent vehicle, I have owned all of the luxury SUV from Lexus to Range Rover and this is by far the best if ever owned. This is my 3rd GL. My first one was purchased in 2007 and I have never turned back. It handles like a luxury MB vehicle, I also own an S550 and the drive is the same. Excellent gas mileage for an SUV and great on and off road as well as maintenance costs are affordable.",
      "It works for getting to work and dropping off at school in style. The handling is great! And of course the luxury Mercedes provides can't be beat. My dream car!",
      "I love convertibles! Its just right for riding in the wind and letting go!",
      "It's a great car for the money paid. Very reliable and easy to maintain. Gets great gas mileage. Luxury, comfortable and perfect for me.",
      "classic, great looking sports car. hard top convertible",
      "The car is very stylish great looks everywhere we go. Has lots of goodies which still haven't figured out yet. Nice performance not great gas mileage but can get 22mpg driving normal.Would buy another one Maybe move a class or two.",
      "I needed to downsize from my Jeep Grand Cherokee Overland because it was more power than I needed & was a major gas guzzler. Found this baby at CarMax...a 2010 with only 14,000 miles on it around Feb 2014. Had a very pleasant experience with my trade-in & my purchase of this car at CarMax. Friends & family thought I was nuts to purchase a Mercedes (my first ever) for the maintenance cost but it has turned out to be minor so far...a lot less than my Jeep. I'm in love with this car!",
      "Dependable, lots of room and classes looking",
      "Amazing interior Strong engine Quiet interior Very smooth ride Great safety features",
      "Most comfortable car for driving and riding. Always thought could not afford but used and clean one made it happen. We have been told that it is the prettiest car on church lot. We agree. Will always own one.",
      "It has classic Mercedes good looks at an affordable price.",
      "Fun to drive, good gas milage, and lots of great features. It's great to drive around the city or along back roads with the top down. No too windy on the highway, but that is a function of your speed. This is not a practical family car, but you don't buy a Roadster if you are looking for practical. Also a good car to buy used if well taken care of. Saved at least $10-15K on a two year old car with very low milage.",
      "because it's dependable and is nice driving vehicle",
      "This is my second C series Mercedes. I love the car. The second time I had intentions of purchasing an E series. After test driving an E I saw a C and thought I would take it for a drive. I simply like the C series better.",
      "Would rather have this used ML550 than a new Tahoe, Yukon, Explorer or other similar vehicle",
      "This car seats my family comfortably and drives nice.",
      "Handles well Great power Nice interior",
      "I have owned several MB with the 4 cylinder turbo engine, this one is the best so far, tech and sound to to speed, handles great on the road, I would buy again",
      "I love this car. I upgraded from an SUV that I had for 15 years and it was on it's last leg so I am sure that has made my opinion a little biased. I love the parking assist and backup camera. It takes the guess work out of parking and saves your bumpers from scratches and dings! I love that the hatch opens and closes via a button instead of having to open it yourself. Sounds lazy, but when your hands are full and you are approaching the tailgate it is nice not to have to put stuff down to open the hatch.",
      "Very smooth ride luxary simply the best",
      "pros- great engine, good seats, practical sports car, seems easy to use most features. Cons- gas mileage (I get about 11-12 in city driving in traffic)",
      "With a large family it has enough room. It has excellent air conditioning system. With 4wheel drive handles curves with ease. Radio sounds good with multiple choices (sat. Hd",
      "It's a great balance of luxury and power. You won't be racing people, but it has enough power to accelerate when needed. It has a very quiet cabin especially with windows closed. The suspension is super smooth; I felt like I was riding on clouds. My last car was a sporty 2005 BMW 330CI which was quite the opposite -- low ride, throaty engine, manual transmission, lots of problems after 125K. My Benz has little to no issues (<100K), automatic transmission (although I prefer manual), and quiet. It feels like smooth sailing on a placid pond.",
      "Besides the smooth drive & ride, the protective bells & whistles that Mercedes added for our protection are extraordinary! It is spacious & holds an abundance of items from shopping with family & friends, to the market, and to the dump, which was one BIG reason for getting the SUV-I needed to make runs to the dump, then to the furniture store to pick up items!",
      "Its a great high end vehicle. The look is awesome and the technology with the vehicle is first rate. Just as with all high end vehicles maintenance is a factor you should keep in mind.",
      "Great ride and fuel economy, Great handling and plenty of power. I moved from a Luxury SUV to the Mercedes E350 . I should have tried this long ago.",
      "i love this car wanted it new in 2012 waited until it was in my price range 3 years later carmax had it in the color that i wanted and the interior and best of all only 12k on the car i totally love this car i only drive it on the weekends",
      "It's a great entry level luxury car. Good gas mileage, powerful, tons of features, and very stylish. I had a slight tint put on the windows, but otherwise I wouldn't change a thing about this car, inside or out. People make a big deal of the maintenance costs, but a $200 service\/oil change once a year is a small price to pay to keep your car performing at a high level for years.",
      "It is large enough, yet small enough to be sporty. It gets a lot of attention, but in the right way.",
      "Great creature comforts, great handling, fabulous mileage, good lookingercedes!",
      "Awesome vehicle, base model is pretty loaded, and very well built.",
      "luxury, eye appeal, all around meaning of life",
      "Although this is not a \"high end\" Mercedes, it still exudes luxury, feels very solid, and handles like a dream. Plenty of power with the 6 cylinder engine and still gets good gas mileage.",
      "Nice ride. I love the \"finger touch\" feature of changing gears up on the steering column; I especially enjoy the \"joystick\" of the entertainment center and all four tire measurements make my life easier! I also love how the screen on roof lets in natural light without having to open the roof if I don't want to.",
      "I'm not use to \"luxury,\" but my husband insisted. I'm so glad he did and I'm completely hooked now! I absolutely love it and love to get in it after a long day at work. It's fun to drive, stylish, compact and good on gas. So happy with our purchase!",
      "This car is dependable, comfortable, stylish and economical to operate",
      "Great mid size care. very comfortable ride for both driver and passenger",
      "Comfort, features, style",
      "For the age of the car and the price I got it for, I was satisfied and feel I got a fair deal.",
      "This car rides smooth is fast and drives great",
      "It has a lot of great features and stylist",
      "Hopefully a car for the long haul. Good mileage, functional, stylish, comfortable, sensible size.",
      "Smoothest ride I've ever had.",
      "Drives like a dream, great gas mileage, terrific safety features",
      "Big, comfortable, luxurious, fuel efficient SUV with excellent towing capability.",
      "Drives Great with Amazing features !!!",
      "You cannot beat this car for the price. It does cost more than other cars to maintain but it is worth it.",
      "Mercedes got it right on this model. Not over-engineered like some of their models. Everything is well thoughtout and works.",
      "If purchased with reasonable expectations of off-the-line acceleration, this car is enjoyable to own and operate. The car is lightweight and handles like a sports car in most driving situations. There's noticeable \"turbo lag\" from a dead start, which detracts from an otherwise excellent vehicle. The lag is most obvious in stop-and-go city traffic. However, driving this car is a delight when cruising freeways to reach distant destinations, especially when achieving gas mileage that exceeds 30 MPG.",
      "Beautiful car! Inside and out!! Powerful engine and even better gas mileage!!! Plus on top of that- it's a Mercedes!!!",
      "Beautiful styling, safety features, technology, roomy and comfortable interior",
      "Great body style, handles well, very fast and saves a ton of money on gas.",
      "Family Hauler, fit for children and parents alike.",
      "Good car, reliable, good for you money.",
      "Great car lots of power great ride and handling and best of all Looks stunning",
      "We sold a fully loaded 2015 Honda Accord because of our poor experience with the cheap build quality & poor dealer service. I had on my list of cars to try BMW, Lexus, Mercedes, & Audi. I wanted the following: 4 doors, V6, All wheel drive, able to fit in my garage, good acceleration, great handling, solid \"feel\" & a backup cam. The Lexus was a little too small, the Audi just didn't do it for me & I could only afford the 4 cyl., and last, my wife has a negative view of BMW drivers (so that was a non-starter.). The Mercedes really impressed from the beginning. It felt solid, it didn't sream \"look at me\", handled fantastic, it was quick, and is very stable driving in snow. I would take a 1 year old C300 over a new Accord any day.",
      "Just make sure as I did to get every option",
      "Quality, comfort, exceptional fuel economy, long lasting potential",
      "Nice, dependability ride",
      "Purchased this vehicle 8 months pregnant. It's perfect for me to drive around my little one. Fits stroller comfortably in back. I didn't want a car that was too big, but that made sense for a growing family and this is it. My husband has a Range Rover évoque and I find this one a smoother ride and much easier to drive. Only con is that there are no seat warmers which I feel should be standard in a Mercedes. The technology is a bit dated but works great and easy to use.",
      "Smooth ride, the fit and finish is a lot nicer than the last luxury German car we owned.",
      "It gets fantastic gas mileage, it's fun to drive and it's very comfortable!",
      "Because it was a great deal and this car is a rare find .",
      "dream car highest quality",
      "Very reliable car good performance",
      "The style, looks, and performance off this car is second to none! Always turns heads, complimented, and of course, challenged by the other sports sedan drivers you come across on the road.",
      "Comfortable, handles well in the snow, great looking, good gas mileage!",
      "Yes I would recommend this car to anyone because its a beauty and smooth ride",
      "My car is the C-250 with the AMG package. It drives very well. Excellent gas mileage for the size and model. Price was good. Service was very superior. Steve was wonderful and made himself available whenever i needed help",
      "Smooth, quiet and handles like a dream.",
      "Driving smoothly, gas mileage is great.",
      "It is wonderful on gas mileage and has a smooth ride. I did not particularly need a larger model of the car as it is just my son and myself in it mostly. It has all the luxuries I need but yet practical.",
      "I like the way it handles. Has a sporty look without having to give up class.",
      "Enjoy the comfort and style of the car.",
      "safety safety safety, and the engine is incredible.",
      "The vehicle is visually pleasing, great stock, powerful and responsive.",
      "Beautiful classy looking car , runs great , powerful v6 engine got me thru some nasty snow storms, I do recommend the 4matic over the two wheel drive . Wonderful quality interior and exterior .",
      "Mercedes Benz driving experience nothing else matters.",
      "This is a very comfortable and great looking car. I just love it.",
      "It's a great \"first round\" mercedes. The vehicle rinds well and very low upkeep.",
      "It was quick, had a great ride, great fuel economy and a great ride. It was a Mercedes! However I am a 6'4\" and on the heavy side. The seat was not wide enough for me and my right leg sat on the rails inside the seat. It caused me ciatic problems. However for a normal sized person, who ever buys this car will get a super car! Enjoy!!",
      "My whole experience from beginning to end was a wonderful experience.",
      "This E350 is a Polar White convertible with two-tone mocha interior finish. It is an incredilbile car in every way. Looks, performance and sheer luxury!",
      "Beautiful appearance and luxurious ride",
      "This car is just tops. The German absolutely know how to engineer a car. I've always owned Lexus or other high end US made vehicles. We've actually gone back to the same CARMAX dealer this past week to buy the wife her own GL-450 we love this MB so much.",
      "Super solid car with attention to quality that is very far beyond most cars. Silk smooth engine and drive train. Handles like a cat and very comfortable on top of it all.",
      "Smooth, Surefooted,Reliable commuter and a good deal.",
      "The car is a nice car with lots of amenities at a great price",
      "The E63 AMG is a powerhouse of a car but has the ride of a limousine. Bought it for daily driving and have loved every trip, short or long, that I have taken it on. Even around town this thing is an amazing piece of machinery.",
      "This car gives you more that you'd expect as far as gas mileage handling great car",
      "It's got style ,class & it's a BENZ !!",
      "The drive , the style, the gadgets inside",
      "It's fits me perfectly. I love the size",
      "I love this car and all of its features. You can buy cheaper cars with the same features, though. The motor is what's better than other cars. It's fast and efficient. I only recommend buying a Mercedes with a warranty.",
      "Super cute, great ride, great on gas love all the features",
      "I found this beautiful car to be one of the smoothest most conservative machines on the road. It has a smooth pick up and great cruise control option. If you want to stand out and fit in then Mercedes is the way to go.",
      "the ultimate summer car..great convertible..very quiet with the top up",
      "Excellent ride and handling, along with nice features. I would say it is a good entry level luxury car.",
      "The car is in excellent condition. It drives great. I love it",
      "It has almost everything one of the big Mercedes 's has, just in a smaller body. And I love the paddles!",
      "Rides Great but don't have an Auxiliary port",
      "Anyone looking for a great sports car feel with luxury finishes should give the CLS550 a try. This car is a head turner and a pleasure to own. It's nicely equipped, one of my favorite features is the massaging ventilated driver' seat. It has more than enough power on the highway and won't let you down in passing situations. I suggest buying the Carmax extended warranty. I purchased it and it's almost paid for itself. The roofline is a bit low, so not as comfortable for backseat passengers entry and exit. But, overall that's a small price to pay.",
      "Drives well. Good gas mileage - sporty yet practical. Smaller than average",
      "Great price, low mileage, beautiful car. Loved the people at CarMax",
      "Car meets all expectations and then some.",
      "Acceleration, style, comfort, and handling. Admittedly, I was somewhat concerned about the cost of fuel, having to use premium instead of regular, but the mileage is so much better on it than my previous vehicle (Ford Escape), that it more than makes up the difference in cost.",
      "The SLK250 is sleek and handles exceptionally well! I've always wanted a sporty convertible and this was well worth the wait. Dealing with Carmax was simple and straightforward.",
      "Nice car with a sporty interior the steering is nice and tight and handles the road well has alot of power also.",
      "Great performance, quality and comfort.",
      "This a very fun car to drive and it really gets people's attention. I have been stopped by people because they have never seen this model Mercedes in a convertible. Also, one of the best air conditioning systems I have ever seen.",
      "The epitome of luxury and class. The tide, quality of the interior. The sound is magnified, clear and crisp. It's like flying in a private jet.",
      "It is a very nice car for the money. It is fuel efficient and diesel is also cheaper than premium gasoline which the regular E350 needs. Handles and rides very well also. One downside is the run-flat tires that this car has which severely impacts road noise. In place of the spare tire, it has a AdBlue fluid tank which has to be replaced regularly so regular maintenance costs are slightly higher than gasoline models.",
      "Great power. Great gas mileage and you will just look good driving in comfort.",
      "It rides like no other vehicle. its smooth and quiet and I love the crash resistance sensors; and it looks great on the road. I always get compliments.",
      "Before I purchased the car I researched what cars for what years had the best safety rating between the years 2009-2014. The 2011 E350 ranked at the top. The car has exceeded my expectations. It only had 18,000 miles on it when I purchased it. The ride is very smooth even at high speeds. My wife and I drove roundtrip to Santa Fe, New Mexico. It was wonderful. The bluetooth system works flawlessly,--which is very important to me. Next to the citroen DS21, it is the most comfortable car I've ever driven. MB has thought of everything. The leg space front and back is very good. (I'm 6' and our son is 6'4\". The sound and braking systems are outstanding.",
      "I had one for 16 years. What car today last that long! My ML350 can take so much to the beach, camping....I adore my car!",
      "Beautiful car.... You can't go wrong with a Mercedes",
      "Car drives smoothly and all the luxury things it has are great.",
      "Exceptional performance, handles easily, smooth ride, great features and I get compliments all the time. This is my second Mercedes.",
      "I like Mercedes Benz vehicles. This particular car is efficient and still provides a level of comfort and style. People stop to look at it and I've received several compliments on the styling. On a recent road trip, I got more than 35 mpg! The ride is a bit rougher than my previous MB C 300 Sport, however, I expected that in an SUV and also with the run-flat-tires. I managed to find a GLA 250 with the features I desired, it's been a lot of fun to drive.",
      "Very solid car. It is well built no rattles, handles well and nice power. The ride is nice.",
      "When I purchased this executive owned car, it had only 4,500 miles on it. It was priced right at $18k less than the Accura TL I traded for the Mercedes, when the Accura was new. In the 4 months I have owned the car we have traveled almost 7,000 trouble free miles in it. Our Sales Consultant, Henry Beeler III, was very helpful in making our selection of this car. Ours was an excellent purchase, one with which we are very satisfied!",
      "Sports Turbo, easy maintenance, good acceleration",
      "Good power for a smaller vehicle; easy handling and smooth performance.",
      "These type of cars different----- Just drive it and you will know",
      "powerful car that is great on gas, it is very roomy and stylish",
      "It has all the qualities people want from a Mercedes but it's not that expensive. I get great gas mileage, it's fast and looks amazing.",
      "It's the best drive I ever had. I love my car it's just enough room for my husband and I to take weekends getaways.",
      "This car out performs any other car I have driven in this year. The luxury and bells and whistles don't hurt it's image at all!",
      "It is a wonderful car, I am very happy with it!!!! Very comfortable and beautiful!!",
      "Looks and performance! A great car at a reasonable price!",
      "BECAUSE ITS A WELL BUILT CAR THAT LASTS THE TEST OF TIME IT COSTS A LITTLE MORE BUT WORTH THE EXTRA COST",
      "If you are just looking for a car, or you are optimizing for fuel economy, then look at other cars. But if you really like to drive, if you want driving to be an experience, rather than just getting from point A to B, then look at the Mercedes C300. The car drives with so little effort and it just *feels* different. It drives very well, corners like a dream, and has plenty of power. Fuel economy is not terrible, but again, who cares!",
      "It's a Mercedes Benz, what more do you need to know.",
      "This car is fast, sporty and luxurious all in one. It's very sleek and handles well.",
      "Driving smoothness, power, ride, good looks, reliability,",
      "I already have a workhorse car that's nice looking, but I wanted one just to have fun in. You could not call this car practical by any means. But fun--yes! And I believe is safer than one would think.It's sufficiently wide enough to make handling a dream. Love this car!",
      "Great ride, roomy interior for a sport car, has held up well for a 2010",
      "This is an amazing car. I love the power, comfort, and style. I was lucky enough to find a relatively low-mileage car, and it is in amazing condition. The Carmax buying experience was the best that I have had.",
      "Cleanliness, style, spacious, gas saver, comfortable",
      "Wonderful technology - great to drive and quiet.",
      "Very stylish Handles great Lots of features",
      "Has a great luxurious ride... feels like your floating over the road! Quick responsive steering\/handling, and very good gas mileage!",
      "Great style, highend interior, good visiability all around.",
      "Mercedes Benz is an EXCELLENT vehicle. Well made, durable, classy.",
      "The feel, the power, the handling are awesome. The top down provides more fun than I should be having.",
      "It's capable, comfortable, and beautiful.",
      "It is an excellent car and still smell new even still has plastic seal on from the factory when u step on the footbar inside the car and I took care of it for 5 years owned and still only 21K miles on it. Never have a problem with sensor or anything! I need to buy a car for my daughter to college that's why I am selling it! This is a RARE car in Carmax with that condition! Hopefully the one that bought will be a happy buyer and trully blessing for them!",
      "It is pretty much what I wanted, except it does not have a rear view camera. Other than that, it is working well.",
      "This SUV is easy to drive, handles like a smaller SUV",
      "I love how this car runs and how elegant it is anywhere I go. It is spacious enough for a small family and gives me enough room int he truck for my shopping, luggage and errands.",
      "The value, the features, the drive, and look of it.",
      "My GLK has a powerful engine. It is truly comfortable on long drives. And it feels solid and sophisticated when driving. It's my favorite car I've owned.",
      "Its a nice car , good for a woman , and not a big family",
      "pros: comfortable and quiet good gas mileage (25mpg) good handling and safety features great sound system (Harmon Kardon) cons: none",
      "It has all the features we wanted and then some and the price was great for everything we got.",
      "I was fortunate to find a 2014 Mercedes with only 14,000 miles on it. It drives like it's new, it gets great gas mileage, and it has that sport, \"tight\" German feel.",
      "Easy to drive and it’s an affordable Mercedes!,",
      "This is a great machine with all of the finishing touches you would expect from Mercedes.",
      "Safety, comfort, durability, reliability, exterior and interior features.",
      "When I bought it, I kept receiving an error message about engine overheating. The problem was diagnosed as a bad water pump and I had it fixed by CarMax without cost as I was under warranty. That issue aside, the car has no problems whatsoever. I receive compliments from everyone who takes a ride in it and I feel the quality every time I sit and ride in it. Best purchase I’ve made in awhile.",
      "Is a great beautiful looking car. big engine powerful luxurious interior and easy to control the entertainment system! I do love this car!!",
      "It's a reasonable price to experience Mercedes and reliable performance with enough strong power. If you don't mind the technology, it would be the perfect choice as its biggest con is the little bit old technology as it's not compatible with the Mercedes app.",
      "Excellent on gas, great car if you want a sporty look",
      "As a car enthusiast I’ve always geared to German automobiles because of their handling, workmanship, engineering and driver connection. To that add quality and uncompromising reliability. Mercedes Benz has always been on the top of my tier brands. This car I truly recommend to anyone who can afford it over any other German auto maker. Powerful, comfortable, sport performance and luxury all in one. You can’t go wrong. Mercedes Benz. The Best or Nothing.",
      "Stylish, luxurious, fast. Gas mileage sucks but love the car.",
      "Great gas mileage, comfortable drive, well equipped, stylish.",
      "Is a sexy car , even though its a 4 door it has a sleek body , love the panarama roof. The ambiant lighting throut was a great surprise , only test drove it during the day , so was not aware how beautiful the interior looked at night.",
      "Superb build quality. Amazing V8 Engine. Comfortable and safe. Plenty of room for 4. Easy to drive.",
      "The car is good on gas, it rides well, and the quality is very nice.",
      "This car is great because things rarely go wrong with it, it handles great, rides smooth, is great on gas and is sharp looking. It's very comfortable (not something a ton of people consider when test driving - how long could I sit in this car).",
      "It gets about 100miles on a charge Depending on how you drive it. It also has a Tesla Drive unit and batteries which makes it reliable. The fit and finish is awesome if you are over 6 foot the driving position and seats are awesome and it’s just an all-around good package. It even has a sport mode and is really quick off the line.",
      "The car handles like a sports car but it feels like the luxury vehicle you expect. The Edition Orange just ups the wow factor.",
      "It just fits what I want in a car. It drives very nice and has the power I need.",
      "This little convertible coupe is a joy to drive. Not only is it a thing or beauty, it is an economical rocket.",
      "I just love this car. It’s very user friendly. Fuel efficient. Drives smoothly",
      "Sexy and classy!! Good mileage on gas!!",
      "I like the body of this model, and that’s why I selected this suv. I like the sports mode a lot.",
      "This car provides the luxury and ride comfort of the S Class for a far less price.",
      "This is the nicest car I've ever owned. The driving experience as a first-time Mercedes driver is incredible. Acceleration, handling, visibility and comfort is the best I've experienced.",
      "The car is a little larger on the inside than it looks. I am 5, 11', 275, and fit comfortably. We bought the vehicle for my wife and she loves it. It;s great on gas and when you put in in sport mode, look out! Further, it has all of the modern bells and whistles when it comes to technology.",
      "Smooth ride, mechanical luxuries that enhance entire experience.",
      "This car has a great body style, excellent color, great interior, and space. It’s quite and the sound system is nice as well. It does ride a little hard meaning you sometimes feel the bumps in the road, but other then that I love it . It’s a 4 door car with a coupe sexiness to it . As also thank you Mercedes...",
      "This car is classy and very fun to drive",
      "It has a very smooth ride and easy to handle. Beautiful inside and out.",
      "This car is fun to drive and has many features. It doesn’t look it’s age and is still stylish considering it’s a 2012. So far it’s been easy to maintain and I enjoy driving both in the eco and sport options.",
      "This car makes me so happy every time i see it. I have always wanted a Benz but never had the money for one and thanks to carmax i did! It’s luxurious, sporty and practical!",
      "Good gas mileage, large interior room, lots of leg room, and lots of load room. Enjoy the bells and whistles of the vehicle...electronic gate, electronic windows, seats, etc., Love this Mercedes.",
      "The ride is amazing. Being able to push down on the gas pedal at 75 mph and get more power is my kind of car. Love it.",
      "It is very comfortable for my back, neck, and hips. It's roomy on the inside, gets good gas mileage, rides real smooth, and it sharp like me.",
      "Great ride. Smooth riding whip that looks good too. Peppy engine that does have some turbo lag, but not too bad. Seats are comfortable and the is stereo nice too.",
      "Nice car. Good on gas, nice size",
      "Never was a fan of Mercedes but after buying my new car, I fell in love with it the moment I test driven it. Would definitely recommend to anyone to buy. It has class, speed and not bad on gas considering the kind of car.",
      "Great looking, rides and handles great. Coupe don’t see many",
      "Car was so many features it’s like being in a spaceship... and with the matte grey color it stands out wherever you go!",
      "This suv is not too big and just right for a female. You never know when you’ll need to haul something and a car just won’t do. The gas mileage is great! Although it’s surprisingly a 4 cylinder it surely doesn’t drive like one. This is my 4th Mercedes from CarMax and I can’t say I’d ever look anywhere else in the future.",
      "Rides like a dream. Plenty of pick up, excellent features",
      "I have not been to a Gas station in months! I can charge at home and did not have to install a charging station. I am able to charge on a 110v outlet.",
      "The E350 is a fine balance of luxury and sport, with Mercedes-Benz quality and confident feel.",
      "Really was guarded against the vehicle but after 10k miles it has really gone above and beyond what I expected!! Great gas mileage, a ton of power, great awd system. Maintenance is actually pretty easy, a bit more expensive than some other brands but not crazy. Rides great and handles pretty good for a suv. I’m impressed.",
      "Style, quality, safety and comfort are just perfect for me, and my Black Labrador!!",
      "The active safety features and overall build quality.",
      "The details in the interior are amazing. The ride is smooth and the acceleration is quick. I love this car.",
      "It is e great car , confortable, beautiful in and out, a lot of style , great on gas , very reliable.",
      "Quiet, economical, exciting to drive, gorgeous and secy",
      "The comfort and excellent engineering of this vehicle have convinced me of why Mercedes Benz is the #1 car in the world! I will definitely be buying more of them if the need is there for another vehicle.",
      "Just a beautiful car in every imaginable way",
      "It's a good Car at a good Price with a good Quality & Prestige",
      "The car is a time machine ... every time I’m behind the wheel I’m 25 again",
      "I love this car. This is my second one. I highly recommend it bc of the style, comfort level, and overall performance.",
      "I wanted a stylish, small, but powerful SUV and this fits perfectly! The ride is so smooth.",
      "Fun car. I’m getting 30 mpg on the highway in Economy mode. This car is very customizable: suspension, transmission, seats, etc.",
      "Good engine, all the features you could want",
      "Great all around vehicle a pleasure to drive in any season or weather conditions.",
      "The Mercedes C 300 is an affordable and classy automobile. It drives amazing, it has great looking style. It’s classy and sophisticated. And best of all it’s affordable. I do rank it a monks the top in luxury automobiles because of all of the benefits saving money and looking good while doing it ha ha ha! I do recommend getting this vehicle from Carmax because I tried many other dealerships and they were very very strange. They all made me feel like my credit was too horrible to get a car loan with the exception of a massive down payment. Carmax made the whole experience a lot easier. There was really no haggling I was given clear options of the terms and they were patient with me.",
      "We love this car. It lets us go out with the top down and have fun. We just bought it for fun rides and some trips and it is great for this.",
      "Extremely smooth and quiet ride, good gas mileage, reliable thus far.",
      "Love Mercedes Benz the quality, the color & size\/model",
      "This car is practical luxury. It’s extremely comfortable and customizable. The ride is quiet, smooth and powerful. The gas mileage is surprisingly good too. One tank of gas has about a 500 mile range.",
      "Very comfortable ride. Well well enginered.",
      "This truck is awesome. I pull a 5500 pound boat and trailer and It does a great job Super comfortable and fun to drive Love it!",
      "Drive smooth feels comfortable and reliable",
      "Very smoothie ride, lots of trunk space and the panoramic sun roof is amazing!",
      "I bought the car n didn't check tires, after month I notice that my tires are not all the same brand n tread and alignment was not done correctly.",
      "Super fast and very smooth handles like a dream and the luxurious feel of the interior makes driving exiting and comfortable",
      "Solid performance and good gas mileage",
      "Perfect family car with style, power and great looks!",
      "Good size suv that feels like a sedan",
      "Impeccable Mercedes engineering that combines the highest quality performance standards with elegance and class. I’ve owned other cars from Mercedes and purchased other vehicles from Carmax but this purchase I requested a vehicle I had dreamed about for years and Carmax delivered. My sales person quickly showed me many options to choose from and I was able to have the exact model, with the features I wanted, transferred from Florida without any problems. It arrived in the condition advertised and exceeded my expectations considerably. I purchased an extended warranty service plan but have yet to need any work or repairs done. Thank you, Carmax, for a first class experience.",
      "This is a sports car that can comfortably carry your whole family. Fast, comfortable, safe and beautiful, it checks every box!",
      "I love this car. It drives like a sports car but has Mercedes Benz luxury.",
      "Like new condition station wagon, low mileage and a great price. Third row seats available when needed and large cargo area.",
      "Beautiful, luxurious, sleek, fast, responsive, great fit and finish and quite comfortable.",
      "It has great power and is a medium SUV. Great car.",
      "I love the size of this vehicle. I have three kids and a large breed dog and we all fit. At first- I was worried about going from an SUV to a compact vehicle but there was no reason, plenty of room. I love the large display screen for the GPS and other functions. For the price, the style is great! Also- you can't beat the gas mileage!",
      "I will love to buy the car again, C300 Benz 2019 is an Exclusive car. Fits and balance, I feel my self, when ever I’m driving it.",
      "I will never buy anything but Mercedes ever again. Max AC setting should be called arctic tundra.",
      "This car hasn't disappoint. For the few months since I've owned this vehicle, it remains a smooth, solid and dependable SUV. It still looks and feels brand new. I'm hoping to get to 100k miles with regular maintenance.",
      "Its a good car it drives good and handles good. Its in probate court and I need a price.",
      "diesel S class best of both worlds rare car if you find one especially with low mileage. buy it immediately you’ll never see another s class state side ever again. get max care and enjoy worry free ownership and fabulous file economy",
      "Great experience and easy purchasing options. I was able to complete my application online and found out what my payments would be, so that we I showed up at CarMax I just had to bring documentation for verification.",
      "great service no hassle was all handled timely and efficiently",
      "It's a great car inside and out. The sound system is crisp and clear, comfortable steering and drive, and provides a feeling of safety when I am driving and when it is parked and I'm no where in sight.",
      "The car is built, handles well and amazing power fo a four cylinder.",
      "yes 2 cars and great opportunities to purchase nice cars",
      "Great service and car was well maintained",
      "The car is good overall, but missing 2 key features mentioned review Carmax never replaced the 4Matic symbol, that is falling off.The computer box in my truck is missing the Cover .This vehicle doesn't have auto bright lights and cannot support a Two Way remote start and alarm system.",
      "Car drives absolutely wonderful, smooth, Fits my lifestyle,",
      "I love my car not only do I get complements all the time but it runs extremely well. Total solid car for my toddler and me!",
      "Has good reliability ratings. A 2012 with only 6000 miles on.",
      "Great car with lots of room and lots of great features.",
      "Paid a premium for the low miles even thought it was 10 yards old. Well build SUV",
      "Im so happy to finally have a hardtop convertible again! this car is amazing! the sound, the feeling, the wind",
      "Simple purchase process with greats Specs.",
      "super quiet and comfortable",
      "good car, good price maybe service ok but no problem just yet",
      "It's a nice luxury SUV that has plenty of room with comfortable seats and ride, and I love driving it. It has some pep which I like. And, I love the white pearl finish and the mocha interior. I'l have this car for a while, I'm sure. BK",
      "Fast service, friendly and knowledgeable sales people",
      "I would recommend this car because it rides very comfortably handles the road very well gets great fuel mileage has lots of power",
      "Kennan understood what is was loomking for price wish ,and didnt not try to money slick me to buying a car,",
      "pro it's great I love it to much con it's my every day driver I would to drive something else jus keep it healthy keep the wear and tear Down",
      "The ride along is SOOOOOOO smooth! The POWER is the real hidden secret to this car!",
      "this car is very sharp and affordable. Excellent digital features and the design is very sleek. Fantastic midsize luxury car.",
      "It is such a smooth ride on the highway. I would recommend it!!!",
      "I have recommended CarMax to all my friends. because they have the best selection, and fair prices.",
      "this is how buying a car should be, selection, service and time to test drive and make the decision",
      "Because it’s a great car. It drives well and it’s so comfortable.",
      "very nice driving and makes you feel safe with additional features",
      "It is one of the better SUVs in my opinion. My mane choice for purchasing it is for the trunk space. I love this car! It is roomy, sleek, and sexy! The maintenance can be a little expensive but hey you pay for what you want. It gives you big car feel without being too overwhelming.",
      "I recommended to my son and he bought a car too. Easy process. Outstanding customer service.",
      "it’s cheap and has so many modern features",
      "A very fair price for a great car. It has exceeded my expectations and the car is a pleasure to drive",
      "It's a great car that makes you look and feel like you've accomplished something.",
      "smooth and comfortable driving. beautiful interior and exterior",
      "Great car, clean and drives n looks brand new!!!!! plus u can buy extra warranty!!!! best place buy a used car",
      "Firm ride. Comfortable interior. Worth taking on a ride with no destination.",
      "no pressure to buy you know what you want CarMax make it happen!",
      "great customer service, online catalog is convenient, advertisement is accurate about cars and service.",
      "to find a 2013 with 13000 and 1 owner is like hitting the lottery. it’s a 4matic so perfect for snow and has all the luxury features that you would expect. It drives like a dream.",
      "I don’t know. there was some damage to the back bumper. The car was sent to a workshop and there for over 2 wks. there’s something weird about the so called new bumper that was installed. I think they got a used part from some junk yard and placed it on my car. nobody at CarMax has anything to say or anything they can do now about this “fix”",
      "it’s a AMG E350 Mercedes Benz with low Mileage, leather interior, dvd, navigation, Bluetooth capabilities and much much more",
      "Perfect for your first luxury car! I have had no problems with it. My only con would be the maintenance can be pricey!",
      "Amazing luxury and safety in a surprisingly affordable car. We purchased Carmax's extended warranty so that it's like a new-car warranty. Based on history in this model, we expect much lower depreciation over the next few years than with most alternative brands.",
      "This vehicle is a well-made machine. The quality is apparent, and the technology is spot on.",
      "The car gets great gas mileage and is very comfortable on a long drive. All the comfort and features of a much more expensive car. I would recommend this car to everyone who enjoys comfort and good gas mileage.",
      "I love the luxury features that make driving it super easy!",
      "Absolutely love my E350 4matic! Rides smooth and silky with lots of power. I run it on E85 so it’s good for the environment and my wallet. Plenty of space and luxury options make it a great deal. Took a 300 mile trip and due to the distronic plus with steering assist it was so relaxing and I arrived rested and ready for the rest of my day!",
      "it’s lovely and classy! That’s why I named her “Lena” after The beautiful, lovely and talented Lena Horne!",
      "Because Mercedes puts out some of the best vehicles ever. And they don't lose their value too quickly.",
      "Great buying experience good service I feel confident when I drive it because I haven’t had any problems",
      "this car has just enough space for a family of four and provides you with the luxury experience at a great price. gas is inexpensive and it last!",
      "Sporty, fun and flashy! And the hard-top convertible doesn't hurt.",
      "JUST A GREAT CAR RIDE DEPENABLE COMFORT BUILT WELL BETTER THAN OTHER CARS WE HAD",
      "Premium package interior with audio is amazing. Speedy and aggressive look. Exactly what I wanted.",
      "I love the car. The intermittent wipers do not work. Unfortunately, Car Max let the car be sold without addressing the issue or acknowledging the issue. I did not realize the issue but Car Max had “certified” the status of the vehicle. I am disappointed that I was trusting of the Car Max promise.",
      "Great amenities great on gas good power phenomenal looks. The price was unmatched payment unmatched. Beautiful vehicle with total class and style",
      "It’s tight, quiet, nimble, fast when needed and tech rich.",
      "I have owned this car for 8 months. Beyond the luxury eye grabbing styling this model features the perfect amount of efficiency, & safety. I went through hurricane Michael with this vehicle, I hit a lot of road debrie, including a giant piece of metal which sliced the under body tray but did not slice the vehicle parts itself to create a leak. I have not had any issues at all with this vehicle & feel very happy knowing it has a 5 star safety rating in euro crash test. An oil change is due every 10k miles rather than 3. All around best entry level luxury vehicle. Also great fuel economy averaging 30mpg. Technology & features are all modern, ambient interior lighting. The best or nothing!",
      "This car drives heavier than it looks and has a very smooth ride. It is one the best vehicles I have ever owned. Anyone who says a Mercedes is just an overpriced car has never driven one. But this car and you won’t regret it.",
      "Plenty of room inside car. Looks very classy",
      "Fits the soccer Mom lifestyle while not feeling like you're getting old and fat bc of kids. I can pick the kids up with their backpacks and their musical instruments, then still stop by walmart for some last minute dinner items. I can also feel very classy driving it for a night on the town, because in black, this car looks VERRRY swanky. Love the ease of buying that I got from Carmax and a reasonable price. Virtually painless.",
      "This is an awesome sleeper of a car. The power band was presently surprising. Comfort is what is expected for a Mercedes.",
      "The gas mileage is great and you get the ride quality and interior quality of a Mercedes.",
      "Fun to drive, excellent steering, looks great!",
      "Its a safe and strong vechicle",
      "Great and comfortable interior for the price -Great pickup and overall speed -Stylish -Great price",
      "Its a classy car. If you take of it it would take care of you !",
      "Awesome car to drive, but don’t ever get a scratch on it because it’s extremely expensive to fix! But what else do you expect from a Benz?",
      "Styling, drive, fuel efficiency, durability and reliability",
      "Believe it or not Awesome gas mileage ! And compact enough to fit my needs but not so small that I feel “closed in”",
      "Sporty, classic and fun to drive with and without the top down.",
      "Super quiet and comfortable and fits all our gear. Also about 24 mpg on highway which is great.",
      "Very beautiful car , with all the bells and whistles.",
      "I would recommend this car to anyone who has one or no kids at all. It’s beautiful. You feel good driving it. The trunk is automatic. The windshield wipers come on automatically and adjust to weather.",
      "wonderful car just keeps on going well built you get what you pay for this is just a very well built car made right and it lasts",
      "it gets great mileage for a small SUV it's fun to drive and sporty",
      "Because is very Economic, environment friendly, beautiful and comfortable",
      "Great car and affordable luxury and affordability",
      "Rides smooth and it has some power behind it. It did not come with the navigation device and i was not informed.",
      "Its a Mercedes Bends, that's why! No, it drives great, good gas mileage, confortable and looks good.",
      "Amazing car. Safety. Spacious. Economy gas.",
      "The car is a luxuriously smooth ride, with great get up and go. It's comfortable, has everything I need in it, minus 2 things. The doors do not auto lock if you forget to do so and drive. That is a safety feature I appreciated in previous cars. Also, if the sun is on your dash as you're driving and you cannot see your signal lights, you cannot tell that you have left them on. The clicking sound is very silent. I constantly continue driving with the signal light on, on a bright sunny day. Otherwise, this car would have been a 5 star for me.",
      "I have a diesel and the mileage is outstanding! I love everything about this car. I have owned everything from a Jaguar to a Roadster and this is the best ride by far! I love the way it looks, I love the way it handles, I love the comfort of the interior. This car turns as tight as my Hummer did, and that is saying something!",
      "Good handling; great on the highway; plenty of back seat room even though a coupe.",
      "I've only had the car for a month, but couldn't be happier with it. I traded my 2008 Toyota Sequoia for the 2013 GLK350, so I made a really big change in the size and type of vehicle. Visibility out of the vehicle was a huge factor for me, and the GLK delivers. I test drove about 10 different models of similar vehicles and none had the visibility and lack of blind spots like the GLK. Passengers agree: the view out of this car is outstanding. The ride is so tight and sporty, it makes me a better driver. I feel like I am driving my own sports car every day. I do wish it had more pockets\/cubbies for storing things (phone, sunglasses, etc). That is really all I miss from my Sequoia. Very satisfied with my purchase!",
      "This car is so stylish and has a great interior as well. It drives so smooth. So glad that I purchased it.",
      "This is not a car for everybody. Would recommend to some but not all. Do NOT buy this car or any similar car unless the salesman shows you how to work all the gadgets. The instruction manual is too long and unreadable.",
      "This car is awesome! It's a ton of fun to drive! The way it takes off, how it handles curves, & the smooth ride feels like I'm not even touching the road!",
      "This car has it all at a great price. Style, quality, features, ride and performance. This all wheel drive with 302 hp is definitely no slouch. I guarantee you will unknowingly exceed the speed limit. Perfect executive or professionals automobile with excellent fuel mileage.",
      "fun to drive, good features and looks great.",
      "The car is comfortable with all the amenities you'd expect from an executive sedan. The mileage is better than expected as I have been getting 27mpg average and up to 30mpg on the highway, better than the manufacturer's estimates. The car is quiet, has good acceleration, handling and braking. First Mercedes sedan I've owned. Replaced a Mercedes SUV. The buying process was great from beginning to end.",
      "My car not only have all the bells and whistles but it's performance is great. It is a beautiful white exterior automobile with camel interior.",
      "We love this truck I would recommend this truck if your looking for a great truck this is the one.",
      "This car is a very solid Mercedes, then again what isn't? Anywho I love this car with all of my soul, however there is a couple of minor qwerks or things I just generally hate about the car. The car is a turbo 1.8L 4cy, and unless you get a tune on it, it has a heavy turbo lag, also has is kinda annoying with having to put the supreme 93 octane gasoline. But over all the car is amazing, it drives like a baby S class, which is great because Mercedes builds their cars down from the S class and not up. The opposite would be for BMW whom build their cars from lowest class to the top. over all an amazing car and would recommend.",
      "Excellent gas mileage on trips Excellent pick up for a four cylinder",
      "Unlike other German manufacturers, who build fragile, expensive cars, MB continues to build cars that are tanks and can run forever. I bought it because I like the sound the door makes when it's shut....thunk! Safety, luxury, and diesel efficiency.",
      "This may sound cliché but my recommendation Primary stems from the fact that, hey \"it's a Mercedes!\" It's a high quality luxury car and makes a statement.",
      "It has the room of an suv and the luxury features of a sedan. Perfect size.",
      "This is the Blutech version which makes it a turbo Diesel and 4 wheel drive. It's not the base model this form forces you to select. Lots of tork, great handling, quiet, smooth, excellent acceleration, and 35+ miles to the gallon combined! Lots of 350s out there. This one is a very rare configuration that will easily run into several hundred thousand miles.",
      "it is the sharpest and classiest car in its price range. classic all the way. looks great, feels great, rides great. the options are wonderful, no need to think about anything, just drive!!",
      "The unassuming power, tasteful décor, All Wheel Drive, and list of amenities!",
      "I drove a Audi for years and absolutely loved it, but repairs and maintenance are extremely expensive. After some research I found Mercedes has a great reputation for reliability and is much more affordable repair wise (believe it or not!) I test drove this model as well as a BMW 328i x drive (I also loved) but chose the Mercedes because of the comfort and ease of handling. I live in the city and parallel park constantly. With this car it's a breeze to get into tight spots no problem. The interior also has a bit more swank than the BMW which was another deciding factor. Overall I'm very pleased with my C300.",
      "Beautiful to look at ; great gas mileage; ; quiet and comfortable; awesome sound system . I totally love it.",
      "Space of an SUV, speed of a super car, sound of a speedboat! What's not to like?",
      "Excellent build, not the top of the line Benz but offers all the same quality and safety. Excellent value.",
      "It feels very good , nice ride , love the all wheel drive , and it will go .",
      "The car is gorgeous, runs beautifully and is smarter than I am. Lots of amenities.",
      "This car is just the right size. 4Matic makes it handle wonderfully.",
      "Great gas mileage Great handling Great performance Great looks Too many bells and whistles to even mention",
      "Value of buying used is excellent especially if you can find one with low mileage like we did",
      "Guzzles gas at a high rate, eats brakes, and wears tires incredibly quick. In exchange you get the absolute most fun SUV possible for the street. Take the kids and still have a blast driving.",
      "This car is everything you would expect from a Mercedes Benz.",
      "I love the mix of power and luxury with this car. As someone in her late 20s, I wanted something fun but also reliable and so far this car has been a great combination of both. You won't regret it. I recommend tinting the windows to get a full package! Not fuel efficient though...",
      "Best car I ever had compared with the Acura that I trade this is a first and the only car I need if I trade this baby is going to be another Benz!!!",
      "Small size, decent mileage, good acceleration on highway, safety features, and Mercedes quality",
      "I did not know that Mercedes Benz is so reliable and does not require any services for thousands of miles! Engine is very powerful, yet natural and moderate in size! You get all feelings of driving a Roadster without hard sport suspension (like BMW has). I am enjoying it and recommend it to everyone!",
      "I enjoy the look and feel of the car. Fun to drive. Other than an annoying knocking sound, I am very much satisfied. This is my first and will not be my last.",
      "Jaw dropper It's beautiful and very lady like.",
      "Very comfortable ride, Mercedes attention to the details. Terrific responsiveness for the utility",
      "Super performance sedan with the comfort and luxury of more expensive cars in a small sleeker form. Had the vehicle for about a little less 5 months with 6k in mileage put on the car and it has not disappointed.",
      "I've owned mostly BMW's (M3's) my entire life and didn't think I'd ever enjoy a Mercedes Benz. I think it has something to do with the C63 AMG Coupes incredible naturally aspirated V8 AMG engine. Unfortunately this is the last newer looking\/sexy sleek car of its kind. Now replaced with a V-8 biturbo engine. I'm sure the replacement is a tad faster and better on gas, but you'll trade that hydraulic power steering for electric and lose some idea where the tires meet the road. I think buying a used 2012 C63 AMG is the best bang for your buck period!!! If you had a precious gen M3, you'll enjoy this car even more. My car happens to be an Edition 1 Car. Matte Black 1 of 100 and I'll never buy another shiny car again...",
      "The best car I have ever owned! Power! Technology! Performance! Now, the customer service received at Carmax in Sterling VA is seconded to none! I've never received such great service from any car dealership in the past 25 years. I recommend Carmax to all of my friends. They back up their cars 100%. Purchasing was easy as pie, I think it took 1 hour from start to finish. Got my hard tags 2 weeks later. Done!",
      "I was always attracted to the \"boxey\" good looks of this SUV. I test drove several similar models (Lexus, Volvo, Audi, GMC, Honda...) but was never happy with the horsepower or looks. The GLK350 satisfied both of those things. PROs: Decent MPG (25), good power, good lines, easy to use controls, smooth shifting, quality leather seats, smooth ride, tight steering. CONs: A little tight rear leg room, not a huge amount of stowage behind rear seat. Hard to remove wheel lugs (I added hollow metal bar for leverage on lug wrench, works perfectly), fragile paint on interior buttons.",
      "The quality cannot be surpassed. I love the simplicity and the sleekness of the car. The ride is so smooth.",
      "Mercedes ride is unmistakably smooth and luxurious.",
      "very comfortable, roomy and fast acceleration",
      "Looks great, drives great. Love the interior and the shade of blue on the exterior!",
      "Comfort, Speed, I drove the E63 on a out of town trip and it performed outstanding. I owned an M3 and a Porsche. The E63 has the best of both cars in one package.",
      "It is wonderful on gas mileage. It is very comfortable and the \"ride\" is incredible.",
      "It's an awesome car, don't take me wrong. It accelerates very well for 4 Cyl car, the agility option to select sport+ makes it a very aggressive drive, love it. It drives really nice and comfortable... And it's a car that represents you well, same look as other higher end Mercedes. The interior is very well done and luxurious... The only downside I have is: the display screen for the radio, media, settings, etc... Is NOT touchscreen, that is the only reason I dropped one star from the rating. It's a 5 star car, but the media interaction with the driver relying on a knob or touch pad, instead of touch screen, is behind other make\/model technology. I hope there is a way to upgrade at some point.",
      "Fuel efficiency, apparent reliability (7,000 miles in 1.5 years) plus - MHO now - the car is just beautiful.",
      "It's one of the best vehicles you can buy! Luxurious, yet sporty and classy.",
      "Great drive. Awesome acceleration. Smooth\/effortless steering.",
      "Extremely comfortable ride, quiet, easy handling.",
      "This car has great styling and gas effient. For the amount of pick up it has I'm was surprised at how little I fill up tank",
      "Reliable, fuel-efficient and drop dead gorgeous",
      "Not too big, not too small...it's just right! Good gas",
      "Mercedes-Benz's has the modern design and superior engineering I was looking for in my next car. The rich history of class and style at the CarMax low price made it a no-brainer.",
      "Quality, appearance, power, features and accessories, gar mileage",
      "Very comfortable ,solid car. Great mileage and adequate power. State of the art safety features. Crisp handling and lots of creature comforts. Very well equipped",
      "f u enjoy speed and precision this is the car for you",
      "Great car, I've owned almost every make of the less expensive cars like (or so I thaught) VW Volvo Toyota Honda Nissan Ford Chevy and Jeep and so far this is the car I like best. I don't know why I didn't get a Benz earlier they're not even much more expensive than the above mentioned but the quality is much higher.",
      "It's a VERY comfortable, sturdy & reliable car !! It has ALOT of get up about it, but still rides smooth !!! I LOVE MY CAR & I'm planning on getting me ANOTHER ONE soon !!! GO Mercedes GO !!!",
      "I would recommend this car to anyone that wants a Mercedes Benz because it rides so smooth, the engine sounds wonderful, and it big enough to a single person or a family.",
      "Head turner, drives smooth, great Audio system, well done fully automated rag-top convertible, Air scarf warmer & seat warmers allows you to comfortably enjoy the top down with temperatures as low as 55 F! nice trunk space, can accommodate 4 passengers.",
      "Interior design is nice, serene and comfortable ride, isolate noise from outside. Surprisingly sporty given the luxury ride compared to older E350. Glad mine did not have run flat tires. I stayed away from BMW because of stiffer and harsher ride of run flats. Try iy yourself.",
      "Super comfortable, lots of useful bells and whistles, powerful 302 HP motor and I also have full time all wheel drive. As long as you don't drive it like a race car, you can expect 24 mpg around town and almost 30 mpg on the interstate! Always wanted one and glad I choose the E350. Rides like a big, black cloud.",
      "Great gas mileage beautiful body style looks classy not showy",
      "Small car with great gas mileage and comfortable seats",
      "Great vehicle Great mileage Great on gas",
      "This car is the best!. It has so many amenities. The power is awesome. I can't think of anything negative to say about his car. It has far exceeded my expectations.",
      "Reliability, safety features, and classic style make this car unique for it's age. Other super luxury makers are just catching up in 2016.",
      "Sporty, stylish, handles very well and smooth ride.",
      "Feature rich sports sedan that is both fun and comfortable to drive.",
      "Diesel sedan with plenty of low end torque for the hilly parts of the state. The mpg is around 32.5 which was close to the manufacture's rating.",
      "Owned several E class Benz's before but never an AMG. This thing is a BEAST. From the engine's roar to the acceleration, its 500+ horses remind you why AMG is in a class all its own. The seats heat, cool, and massage as well as automatically flex to tighten around you during cornering. Panoramic glass roof, with dual auto sun shades. Sound system is crisp and clean. Steering is tight and precise. Traded a troublesome, high maintenance Maserati Quattroporte for this beauty and couldn't be happier. Now I pull next to Maz's at stoplights knowing there's not a thing they can do to keep up!! Love it!!",
      "It's a head turner. Smooth ride. Very quiet interior. Great handling. Nice thick steering wheel.",
      "Great car! Don't care for the front seat shapes, but overall love the car",
      "The car drives well, is quiet, and very roomy. 4 adults fit comfortably. Perfect car for my family.",
      "Just the brand name says it. It goes without saying the car is very well made. Handles like a dream and is absolutely fun to drive. For such a small vehicle I wish the gas mileage were a bit better. Updating and adding more ports and charging capability for devices would be good. Another improvement would be to allow the rear view camera to work when the radio is off. If it's not on, the camera won't display anything. That is useless to me as a driver. Also including the guide lines as in lesser quality cars would be great. the stereo system is excellent. This car is a blast to drive. I look forward to the daily work commute.",
      "I have owned several Mercedes Benz and they get better and better. The ride is second to none, the paint is beautiful and it gets great Gas Mileage !",
      "I enjoyed the Carmax experience. I purchased this car via my local Carmax based on the recommendation of a friend who purchased a 2012 Chrysler 300 from Carmax, I used the Carmax app to select a white Mercedes-Benz C300 Sport. The car was transported to my local Carmax at my expense due to the distance. The car is very nice and an amazing drive! Luxury and sport. I get complements and looks daily when I drive the car. Currently, I own 2 other cars and this is my favorite car to drive on a daily basis. From the ride, to the fit and finish, the car feels great! The factory Bluetooth does not stream music, bummer. My first Mercedes service is due in 2 weeks @ $500, ouch! I now understand the hype about the Mercedes-Benz ride! Recommended!",
      "Only affordable world class car. Ride unparrelled",
      "It is everything I want in a car, the ride is excellent",
      "This seems to be a very good car, easy to handle",
      "In a word......NICE!!!! Candy apple red 2 door coup, everywhere I go people stare and tell me how nice it is.",
      "Enjoyable to drive Lots of power Good gas mileage Loaded with extras",
      "Because it run great and it had great miles when i first brought it",
      "Certified Pre-owned preparation and warranty. Reliability (see Consumer Rpts). Styling\/Color. Fuel numbers (450 mile round trip: 35 MPG.",
      "Good gas mileage, comfortable, easy to drive. What I would not recommend is the gas sensor, takes forever to fill up and nozzle can not be left alone. Must hold it down when fueling.",
      "Love this car, it's easy to drive and when I ask for speed it delivers no hesitation. Only thing not a ride for a large person. Leg space is limited it's tight for me I am 5'7\". Performance wise, dynamic engineering. All the bells and whistles in amenities.",
      "I am happy with it. It is my 3rd Mercedes. It is great compared to my last SUV Jeep.",
      "The car was priced great for the mileage and condition, and it had one flaw in the headliner which Car Max replaced and did a great job and their service was Excellent.",
      "Living in the city with a tight garage, we couldn't go full SUV, so this model as well as many other compact SUVs fit the mold. We ultimately went with the Mercedes because we liked the body styling, and the interior was luxurious but simplified in a good way. You're not spending a lot of time scanning the dash for unnecessary buttons while driving. We've done some off road, but mainly highway miles which are extremely comfortable. This SUV definitely does drink the gas, which is fine for a city commute, but if we had to extend that commute it would be an expensive proposition. That and any repairs which are notoriously expensive are something to be cognizant of...",
      "The gas consumption is good and you still look great while driving it!",
      "Amazing combination of comfort, luxury, and performance with reasonable fuel efficiency.",
      "FUEL EFFICIENT SMOOTH RIDING CAR GREAT ON THE HIGHWAY",
      "I feel great driving this car. Love the rear view camera and push start engine.",
      "The performance of this vehicle is amazing and it accelerates like the missile on the freeway when needed. On the other hand, even it equips with a turbo V8, when you are not pushing hard, it gives the average fuel economy 27-28 mpg. Once I made a freeway trip and stayed within 65-70 mph, I made 33mpg on average, which is same as the regular 4-cylinder cars. In terms of the comfort and craftsmanship, it is a Mercedes and it meets my requirements.",
      "Superior handling, high performance, excellent value",
      "This is a great car for a busy mom or working woman that needs space. Perfect travel vehicle, comfy, handles well on the highway and surface streets. Easy to park and navigate.",
      "For the price range, this is nice driving suv and looks good. I have the fully loaded GLK 350 with Nav, DVDs, rear view and running boards; they are hard to find loaded, so It's fun to drive.",
      "I'm 5'1 and my previous vehicle was a huge SUV. I loved it but I was ready to downgrade. I went to Carmax to see what I could get for it. As I browsed the lot my husband spotted the GLK first. Until that point I was not a fan of Mercedes-Benz.....so much for that! It's the perfect size for petite women like me :). When the time comes I will upgrade to the 2015 model.",
      "This car is sleek and gives a great ride. It is very fuel efficient and affordable. This is my 4th Merc and by far the best!",
      "This car has too many great features to list. The ride is amazingly smooth and the engine has plenty of power. It does have more rattles than I would expect from a German Luxury car.",
      "I really am glad I upgraded to a Mercedes with this car purchase. It's a classy car and I love the way it rides and handles.",
      "Full of features, comfortable to drive, good looks. There are more entertainment options than you'll be able to get on any one car, from DVD player to recording your CDs to an onboard Hard Drive. Even SD cards! I did not go to Carmax intending to buy a new car, but only to see what mine was worth. Expecting a low-ball offer, they actually quoted me a grand of KBB. So, I said sho me the Beemers and Benzs. All in all, I wound up trading in my old car for this one and I'm paying $100 a month less than my 2013 Kia Optima Limited. Oh, and I found the one with options I wanted on another lot, and both salesmen helped me with no pressure and both got credit for the sale. Great way of doing business!",
      "I had a 1999 SLK that I traded in with 150k miles on it. So, it was time for a change. I considered lots of other cars, coupes' and sedans but in the end, another SLK was where I kept coming back to. More than any other car I test drove, I smile when I get in, and when I get out. Could't say that about the others….",
      "Rugged yet luxurious. Refined cabin with a smooth ride. Effortless power delivery and amazing dynamics. Huge interior space with extremely versatile configurations. My entire family loves it. Nothing says you have arrived better than a Mercedes-Benz. My knocks are the higher maintenance and fuel costs. The infotainment system is very dated, and the Bluetooth does not stream audio.",
      "This car does all I ask of it. From comfort in the rush hour commutes, to all-weather functionality. This car fits me to a tee.",
      "I had a C280 and this C300 is roomier and so much more solid. It FEELS like a luxury car. Soundproof, responsive, great sound system. Love the color (mahogany).",
      "I love my car! It is everything I wanted and got more options by searching the carmax website! It was in nearly pristine condition and had very low miles. The price was very affordable and lower than every website that I checked within 200 miles.",
      "The S550 is a superb road car. It has an athletic yet comfortable ride and has all the power a driver could ever ask for. It is also library quiet and an oasis on a long business trip. An added bonus, my wife adores this car! Expensive but you get your monies worth.",
      "This is an outstanding car. Drives smooth, feels good, handles well, very quiet inside, have very good acceleration (I have a diesel version). It also has a lot of cool features, such heated seats, joystick regulated steering column, memory seats, the best navigation I ever have had, collision warning, folded back seats, driving assistance, just to name a few...",
      "Great clean and well maintained car at a great price! It’s comfortable and drives extremely well. The staff - Linda and Joanne were beyond my expectations of car saleswoman and business office staff. They made the process so easy and stress free! It was like talking to family. I’m certain I’ll purchase my next car through them!",
      "terrific roof down roadster ,eye candy for auto enthusiasts.",
      "The Mercedes SL is the ultimate combination of a sporty convertible and luxury ride. It is loaded with every feature imaginable, but also accelerates and handles like a roadster. I have taken several long trips up the California coast and it is comfortable, agile and fast. Truly a benchmark.",
      "This is a wonderful car. Small, quick, and sporty. Handles well and the brakes are top notch. A little windy with the top down, but it is a convertible after all. With the top up, it is a coupe. No wind noise at all. Mercedes hit it out of the park with this car.",
      "The C-300 was actually not the vehicle we intended to purchase .. We were looking at the C-250 sports body style .. The dealer was showing us the C-250 and in some confusion someone brought the C-300 out and that vehicle changed our minds in a hurry .. The body style is full of beautiful lines and curves anyone would like .. Its sleek design gets us many compliments from other vehicle owners .. We especially like the V-6 as it delivers the power we have been looking for for quiet a while .. We make occasional trips to the great smokey mountains and the C-300 has no problem climbing the steep grades .. Everyone wants to drive it !! There is only 1 problem we have noticed .. The rear seatbelt fits too tight ..",
      "Beautiful Iridium color, long hood, steeply raked windshield, small greenhouse make for a striking car. Fuel efficient: 450 mile round trip to NoCal calc'd 35 MPG. At 27350 miles only problem is an inoperative rear view mirror compass!",
      "Excellent ride, looks and comfort. Very classy and powerful car that I will keep for 6-8 years. I have owned the BMW 740, Lexus LS460, MB C220 and 2 E350s, and now the S550 is my favorite car.",
      "The GL350 was a good choice for us — we wanted something classic, european and luxury without paying a ton. The crossover aspect is nice. Not tons of room, but more than a sedan. It's zippy on on-ramps, easy to park and eye-catching. Downside: - Gas MPG isn't great, but we knew that going in.",
      "Fits our needs. Right size for wife. I prefer something larger. Started with 350 but this one caught wife's eye. But it is a great riding car that's not loaded with electronics.",
      "This car is fast. Has many luxury comforts available. Several safety features not standard for that years competitive models. Numerous small details not found elsewhere.",
      "It's a great truck but it's not bulky or have that truck feel.",
      "Stylish and economical. Rides great and reliable. But small inside.",
      "Sporty feeling. Responsive. Loaded with options. Only requires servicing every 10,000 miles. Regular warranty for 50,000 miles.",
      "Love this car. A little less horsepower than my last car, but feels much sportier. Totally loaded with almost everything you could want.",
      "All the bells and whistles. Heated and cooled seats, massage front seats. Too many to name! The best ride ever!",
      "Very spacious and allows for transportation of larger items easily.",
      "I always wanted a Mercedes. I loved the convertible that Jared showed us, but with my arthritis, getting in and out was a problem. So I opted for the sedan, I love it.",
      "For the same amount of money I could have bought a new mid-class car, but they will NEVER match the build quality, comfort, history, class and feel of a Mercedes Benz. This car will easily drive me around for the next 10 years, and still look timeless.",
      "I love how smoothly this car handles. I also love how it automatically responds to the weather. I only wish it understood my southern accent when I give it a command.",
      "An amazing automobile. Hugs the road and quick on the power. I love it! My only compliant is that it left the factory with the navigation module, but it was not in the car when I bought it. I discussed with the sales manager and he refused to have one installed. I have confirmed with Mercedes that the car indeed had the module.",
      "This car rides like a dream and it is so relaxing to drive. It is so quiet. My dog fits in the back and I have room for all of my son's teenage friends. People think its brand new because it is so clean and smells like new leather.",
      "It's a wonderful vehicle! I've driven a Chevy Tahoe for the last 10 years - while that was a great SUV, going to a Mercedes showed me a whole different side of a luxury SUV. I'm still trying to learn all of the features my car has! Unfortunately CarMax representative had NO IDEA about this car - couldn't even offer help on the basic setup! ALSO - thought vehicle was a basic diesel, didn't know what the BlueTech feature was, have to maintain with a special chemical treatment every 6,000 miles to keep it running or the car will shut down! Would have been nice if dealership could have told us what that was! It's an added expense and may have changed our mind to buy this type of car if we had known! CarMax should know the cars they sell!",
      "The DESIEL blutech engine is very fuel efficientuch better than the Honda Cvr I traded in. The level of comfort from the ride to the overall engineering far surpasses any other auto maker. Had a few issues with the cam shaft sensors but Mercedes warranty took care of that. Carmax does live up to its reputation for selling top of the line cars, I will always buy my cars from CARMAX their service department is extremely friendly and they have gone out of their way to make sure my Mercedes was perfect for me.",
      "Once you drive a Benz it will become clear of the value you get from the experience",
      "The Mercedes S550 is the best and most comfortable vehicle I have ever driven. The Lincoln and Cadillac models I have owned are smooth but the ride in the Mercedes wins my vote. Excellent styling and engineering. Great car in the Luxury class of automobiles.",
      "This is an excellent mid-sized automobile that is truly crafted for comfort and all around fun to drive. Excellent handling.",
      "Beautiful design, great price, comfortable, great gas mileage, love the interior.",
      "A great car for getting around town. Handles well on freeways and country roads.",
      "The car is well built and very solid. It has a sportier feel. The interior is classy but not \"over the top\". Very user friendly components and a GREAT sound system! Gas mileage is not super, but better than average at around 22mpg city driving. Great safety features including blind spot awareness and large back up camera.",
      "Great style, luxurious. I get tons of compliments on this car. Beautiful!",
      "Looks good. Rides smoothly. Great acceleration. Extremely comfortable.",
      "I simply adore this car. I plan to buy another one in a few years!",
      "Lots of Interior space, 7 seats, lots of A\/C, Diesel engine for torque(towing 7500#) and 25-30 mpg! Airbag ride, enjoyable to drive!",
      "This Mercedes Benz is a very well built example with no rattles or creaks. It seems to be carved out of a single block. A great amount of torque due to 481 HP and a light structure. However, it has all of the MB solidity you would expect. Great A\/C, Great sound system. If you really want a Porsche 911, but really do need a back seat, this is the call.",
      "Great size car for luxury comfort. Great price for luxury car. The C300 gets excellent gas mileage for the size of car it is. Luxury interior is comfortable. It is a reliable car. Smooth and quite with minimal road nose.",
      "Excellent handling and smooth acceleration. Airmatic suspension makes the ride smooth and absorbs road imperfections effortlessly. Very quiet car.",
      "It's sporty while luxurious, the exterior design is awesome, I was really impressed with the interior at first, but it grew on me. It's also somewhat affordable and it's fun to drive.",
      "Reliability, styling, space, comfort...what's not to love?? I deserve this! And so do you - go get one - you'll love it too!",
      "Best ride and drive in any car we have owned. Wonderful!",
      "Fun to drive, great on gas and full lux with technology",
      "Just a great ride. Smooth, quiet, great suspension.",
      "Great suspension and very smooth ride. Oil changes are only needed every 10,000 miles! It's equipped with screens and navigation. Really a nice car.",
      "I LOVE LOVE this vehicle. Best I have ever driven. Second Luxury vehicle I've owned and this is by far, the most luxurious. I purchased it 2 yrs old, so it was definitely worth the money. Doubt if I will ever get another make or model. LOVE LOVE IT",
      "I'm so happy with my new car it is great and the value and service was wonderful. It has a new car smell and feel I love it!",
      "This car is a mid level, mid size luxury sedan; and in my opinion, the best in this class. I did test drive a Lexus and a BMW is the category, and they were no match for this one. The specifications for these competing brands look very similar on the paper, and one need to drive these to see which one matches your personality, your driving style and your expectations from a mid size luxury car; and MB E350 was the one I enjoyed the most. The ride is smooth, the handling is the best bar none, and the interior technology is usable and useful.",
      "I purchased this vehicle and I love it! The salesmen where very friendly and kind. The truck rides smooth and was clean. The dealership filled my truck up with gas and washed my vehicle beyond my expectations! Oh I almost forgot. I filled my gas tank up today for the first time using 93 gas and it was 61.97. Not bad!!!!! I was expecting it to be more. This car is doing great on gas!",
      "What can you say about a car that runs beautifully, looks beautiful and rides like a dream. The Mercedes I picked up at CARMAX is just what I wanted. It rides like it is driving on cotton, the inside is so quite I can hear the radio with out having to turn it down during commercials. The leather interior still looks new and my friends can't believe it is a 2010. I will be driving this car for a very long time.",
      "We specifically purchased this vehicle for bad weather and we have had plenty of opportunity to use it recently. We just go around folks who are unable to get up hills in snowy weather.",
      "It's a comfortable, well equipped automobile. The economy is reasonable. I get in the high teens in town and around 25 mpg on the road.",
      "This has been a great car. It definately ranks as on of my favorite all time purchases.",
      "This car MB C300 sedan is an excellent deal. I got it at West Broad, VA location and has a low mileage with pretty good price tag. The sales rep Ron Telackh assisted me the whole time and also helped me pick the right color. The transactions came out quick with the help of Danielle's in the accounting office. i will definitely recommend this place to all my friends and family.",
      "I love my Mercedes Benz GLK350. It is perfect for me. The vechicle has just the right amount of space that I need inside. Love the look of the outside as well.",
      "Tremendous performance. Excellent offering of accessories.",
      "Wonderful car! This is my second mercedes and by far my favorite of the two. I had to wait a while just to get the color and all the features I wanted however it was well worth the wait. If you are looking for a car with alot of leg room in the rear seats this my not be the car for you but if you are after a sporty car it's the car for you. I must add that it has great \"get up and go\"!",
      "Very well built machine with great appeal. Handles excellent on highway in extreme conditions as a typical touring machine should.",
      "We've always owned MBs. They have been wonderful cars; well designed, well built, comfortable and responsive. Most of the MBs we've owed we've kept for at least five years. Although on occasion they have required repair, most service has only been periodic maintenance. Over the life of the cars they have retained their good looks, performance, and excellent rides. We have a second MB which is over 17 years old. It looks like new, the interior is perfect, it still has great performance and ride, we fully expect our new MB will last at least as long as our other car has lasted. Oh, did I mention that the Bluetec got over 39 MPH on our trip home from Florida where we purchase the car to Lexington, KY where we live. Not bad for a car that can comfortably seat four and has a trunk big enough to carry suitcases for all four passengers! This thing has all the bells and whistles but what I like bast is that most of the navigation, radio, and phone functions can be activated using voice commands. The interior is comfortable well layed out and, leather, but since we've always owned MBs, it's familiar which makes transitioning to the new car easy and comforting. The Mercedes Benz is a great car in general, the e350 Bluetec is extraordinary. This is a full size car but is as peppy as a sports car, in fact, it seems more eager than the 1987 560 SL I once owned, it certainly has better handling and much better mileage. And if you're worried about diesel sound or smell, there isn't any. This car is as quiet as a gas car and the exhaust is cleaner! Check it out, it cleaner! With lower emissions and 39 MPH highway, observed by me on the trip home, why isn't the Bluetec technology mandatory for this country?",
      "Within five days of buying this car and had it at home. The car wouldn't start and my husband had to give a jump. The car also through a SRS code. Thankfully the car still had a manufactures warranty ( I found this out by purchasing a CarFax). They check the car and said something continue to run even while the car was off. So they fix that by updating the software. Then 3 weeks later I had an issue with my steering wheel, took it back to the Mercedes dealership and I needed a new steering pump. Thank god the manufacturer's warranty because I didn't have to pay anything out-of-pocket. Other than that the car runs great, good control, and speed that I like.",
      "I love this car. Great body style. Sporty. Everywhere i go people are looking.",
      "This car is absolutely AWESOME! The condition of it is impeccable! I could not have made a better car buying decision! The handling and ride is so smooth it's like floating on clouds. I LOVE LOVE LOVE my Mercedes Benz!!! Thanks again Carmax!!",
      "2010 C300 Sport\/6 speed MANUAL!!! I gave an overall rating of 5 due to the high overall quality of the car. I've own plenty of cars in the past, to include a BMW 7-series. This car, although not as high on the luxury options is just as good for the build quality. I should add my C300 is very basic with respect to the interior upgrade options. I cannot find any faults with the comfort. It has comfortable seats and the air conditioning blows ice cold. This was not the case with an older S-class I have owned. I knocked performance down one star since it's a V-6. It's is still very much a quick car and you can spin the rear tires if you turn off the ESP. Keep in mind I'm used to performance\/luxury V-8 motors. But it's an acceptable trade off as I've gotten as high as 27mpg with mostly highway driving. It's rated for 19-26mpg and I generally get around 22mpg with mixed driving. Appearance-really?! It's a MB, it looks great! Value for the money is pretty good if this is what you are looking for. I picked mine up with only 24,000 miles, so that was a plus.",
      "My SUV is every woman;s dream. It rides very smooth-every woman should own 1 just once-this was my dream vehicle-it has everything you could want in a automobile-this is pur luxury",
      "I really like the style and comfort it has. With all the highway driving I do I needed a car that makes highway driving easy which the E550 does plus the Dystronic ( automatic cruise-control) and other driver assistance systems turn a 4 hour drive into a pleasure regardless of traffic. On the highway at 70mph I get a fuel economy of 26 mpg even with all that power it still is pretty go on the highways. A very sensible car for the mature. I like it more and more everyday still after 2 months.",
      "the vehicle is not a car.. its a machine.. For anyone who has ever considered a Mercedes Benz.. there is no substitute. I love her and she is mine..",
      "I love this car that I got. It's my second Benz. If anyone is looking for a good car the should first check with car max online.",
      "Great car! Terrific value! Wifey Loves it ! However noted several missing\/chipped paint areas on hood.",
      "I've owned this vehicle for 2 months. Although this vehicle has only 4 cylinders, the turbo allows me to pick up speed when needed. Initially, I was attracted to it's fuel efficiency and this vehicle does not disappoint. At this point into my purchase, I cannot think of one thing I would change about this vehicle. No buyers remorse here.",
      "Have now driven the 350 bluetec for a year. Zero problems and love it! You can not buy a better made car. Make sure you look at options many pricy options.",
      "I absolutely love this car!! I've had it for 3 days and I have no regrets! I thought long and hard about downsizing from my Land Rover and I know for sure I've made the perfect choice in the GLK350. It has all the room I need and it's ABSOLUTELY STUNNING...especially at night with the dashboard lit up!! Love the dual sunroof and the Bluetooth. The engine is so quite i almost got out of the car without turning it off! The radio is the perfect mix of nostalga and technology. Everything is perfect!! Im accustomed to high-end vehicles and the GLK I would recommend this car without hesitation!!",
      "I was in the market for a car after a change to my employer's company car program. I had never bought a used car before but had heard a lot of good things about CarMax. I had a great experience and found a 2010 Mercedes C300 with only 30,000 miles. After a test drive, I realized I was getting a great deal on a great car...and made the purchase! The team at CarMax was terrific to work with and I am extremely happy with my C300!",
      "I traded my 530 BMW for a 300 Benz, I was first hesitate about losing the power of the BMW to exchange for a more luxury riding car. But what a great choice. I love the look and smooth ride of the C300. I have heard so many great reviews from other Mercedes owners regarding the safety of this vehicle. This car is definitely a head turner.",
      "Great power and handling, superb engineering. Keep learning new things this car can do. The more I drive it the better I like it.",
      "I'd been looking for an SUV for several months, although my husband was not thrilled with the idea - he was willing to consider it as long as we focused our search on German engineered vehicles. We looked at Audi Q5, Volkswagon Touraeg, BMW X5 and MB ML350. CarMax had several models in both the model years and price we were looking. I drove all but the BMW and after looking at the cargo specs on all of these vehicles - I decided on the MB ML350. I love my new car. It handles very well and provides me with the extra room I was looking for - having driven a MB CLK320 for the previous 5 years, I knew what to expect with a MB product and was pleasantly surprised that although I was giving up some style and performance going from a sports coupe to an SUV - I knew that this is just what I had been looking for! Very happy with my 2010 MB ML350!",
      "Great looking car, handles beautifully. Engine underperforms off the start but really kicks in once you punch it. I recomend the luxury package. Overall, I great car to drive and looks fantastic.",
      "When we pick the car from CarMax we were so happy, we're very excited and can't wait to drive around the city, we heard very slight noise when we drove slowly then we brought it to mercedes dealership, luckily it is still under waranty... After we got it fix Oh My God ... Love it ...... Specially it's RED one ... It's such a beauty ...",
      "I have truly enjoyed this car. The way it drives, the way people stop and lookand the ooverall appearance is just wonderful. The only complaint that I have is it is just not that comfortable to drive. I find the driver seat is just not...well, comfortable. Not a lot alot of room in the back if you have 5'11\" people in the front seats. Overall, again it is truly a great car.",
      "Awesome vehicle especially when you look at the gas mileage. I'm truly enjoying my car. Great buy from Carmax.",
      "This is an excellent vehicle for someone who wants the feel and performance of a sports car, together with the formal luxury of a larger sedan. The features of the vehicle are built in for the comfort and convenience of the driver and passengers. Ample space in the back seat, and trunk make for a good traveling vehicle, with plenty of room for a two week vacation for four adults. The panoramic moon roof, back door windows that go all the way down, back window shade, individual vent controls, reading lights and a 12 volt outlet makes the passengers feel as though they were not just an after-thought of the designers. The audio system is a dream come true; sometimes I feel like I own an entertainment center on wheels. AM\/FM Stereo, direct link with IPOD\/IPHONE\/MP 3 recordings, while being charged and stored in the glove compartment, or picked up with Blue Tooth Technology, Satellite Radio, CD\/DVD Player, and PCMCIA Memory Card. The screen placement for The Navigation System and the Audio Systems are mounted in the center of the dash and can be controlled by a Center Console knob that makes for easy operation without distractions from driving or if you prefer just below the screen on the dash, or above the wind shield on cockpit type controls, better yet the vehicle is equipped with a voice command mode whereby you may simply use voice commands to activate navigation, the phone or entertainment features of the vehicle, completely hands free. There are numerous storage compartments that are provided throughout the vehicle. The driver and front passenger have access to a storage bins under their seat, as well as a dual door center console compartment, individual door storage for each passenger in addition to the glove compartment with a shelve and wiring to connect and store outside audio\/phone connected devices, and a 12 volt outlet. Last, but not least is the vehicle performance. In a nutshell the car is designed to do what it is told to do. Whether that is turning, accelerating, braking, or using the engine to slow the vehicle. The vehicle has numerous options for the driver’s desires; E Mode is the most economical and comfortable mode of driving, S Mode modifies the suspension of the vehicle to respond to sportier driving and makes acceleration more responsive. The vehicle also has a manual shifting capability for the 6 Speed transmission. which gives the driver control of when to shift up or down for maximum acceleration or using the engine to slow the vehicle without the use of the brakes, for curvy or mountainous driving. In summary, I have owned luxury vehicles and I have owned sports cars, but this is the finest vehicle that I have ever owned. I would recommend it for someone looking for a great blend of a sports car and a luxury car all in one.",
      "I traded in my 2005 Cadillac CTS-V for the Mercedes C300 and I do not regret the trade. Obviously the Cadillac has a lot more power, but the C300 is zippy enough for me. What stands out about the C300 is the attention to detail that was missing in the CTS-V. The interior of the C300 is very refined and all is put together with quality parts. Much better than the CTS-V. The ride is smooth and acceleration is fast enough for all conditions. I bought a red, sport edition and it has received many compliments. I have two small children and the size is just perfect. Plenty of back seat space for them; a trunk that can fit all of the luggage; and comfortable front seats for the adults. Only down side is that the black interior tends to show a lot of dirt in the back seat area - especially where the kids hit their feet on the back of the front seats. But that is quickly remedied with some wet wipes. Would recommend to others and would purchase another in the future.",
      "Great car! Fun to drive, comfortable for driver and passengers, and very practical. The 3L V6 with all wheel drive delivers a quick ride with great traction in any condition. The dual exhaust has a nice tone as well that adds to the enjoyment of giving a little extra gas without being obnoxious. The trunk is big, the interior is spacious (considering the overall size of the car) and the comfort features (dual zone climate control, heated seats, auto dimming mirrors, lumbar support in seats) so even though it can be a blast to drive, it's also very practical and a solid choice as an everyday car. I only have two minor complaints. First, the ride height is lower than I'm used to so I've had to be a little extra careful when pulling into driveways with steeper curbs or uneven surfaces but I think this is par for the course for sport sedans. Second, a folding rear seat is an option on this model for some years. However, the trunk is spacious enough that I can fit just about anything I need (road bike, luggage, groceries) without folding the rear seat down. I was just a bit surprised to find this wasn't a standard feature. All in all, a nice looking car with a great driving experience and plenty of practical features that most would expect in a sedan. I would recommend it to my friends and will consider purchasing another when the time comes.",
      "I previously owned a 2001 Mercedes C class. Although it was a good car, it had a number of problems and design flaws. The 2010 C-300 - and the design changes that began in 2008 - have corrected and imporved ALL of the problems that I had with the earlier model. Everything about the 2010 C-300 is truly up to Mercedes standards. It is a pleasure to drive and reasonable to keep thoroughly maintained. It is a solid, dependable and \"classy\" car.",
      "Powerful, comfortable, lots of safety features and beautiful styling. First time purchasing a car from CarMax and what a pleasant experience! Highly recommended.",
      "Love my car. Still can't believe it is mine. It drives like a car. It is extra quiet and smooth. The one concern is the placement of the emergency brake.",
      "I love everything about this car. One of the best is the back-up you can see everything without turning and the comfort",
      "Great car! Excellent safety features, Fun to drive, lots of room, many options, and the towing capacity is much greater than other similar Make and model SUV's. Definately would recommend this vehicle!",
      "Great car! Great ride! Great handling! Can't say enough good about this car!",
      "Awesome car for performace in snowy conditions. We hated to give up our BMW, but the Mercedes is the next best thing.",
      "Love the car, would purchase it again if I went back in time.",
      "Love the car in and out! The car is very stylish, and comfortable. Although it is 2011, drives like new!",
      "I've had my Mercedes C300 for about 2 months now, and am loving it. It's a pleasure to drive & just the right size for me. I researched it pretty carefully before I bought it & am confident that it will be above-average in reliability.",
      "This is a spirited, sporty feeling car with the expected quality German engineering. And it's gorgeous. Love it.",
      "I test drove the Mercedes-Benz C300 and I was quite surprised to how responsive and agile this car is. The sleek styling of this car and the easy interior instruments are wonderful. I plan on enjoying this car for years to come!",
      "I am so happy with my car. One small issue is you feel road more than any other model in Benz . Except this every thing is great . I will recommend this car to my friends ..",
      "I always wanting to own a MB. That time finally came and to my surprise, people will actually treat you different when they see you in this car. Im very happy with the overall performance. Runs smooth and its everything that i needed from a car and more.",
      "This car is definitely a good car for freeway driving. I drive long distances to work and the performance (pick up, handling, braking and maneuverability) is wonderful. I have plenty of leg room (I am 6'2\") and plenty of head room arm room. As an added bonus, the sport package on this car make it a really nice car to look at (inside and out.) Excellent car!",
      "The E-model make-over for 2010 was a really great update relative to the 2008 E550 I had before this. The 2008 was a really nice car (also from Carmax), but wasn't quite up to my expectations for how a Mercedes E-class should drive. The 2010 E550 takes it to that level. The 2010's significant strides in vehicle stiffness, steering feel and willingness to turn, make the car a much sportier, capable and fun partner for any kind of driving. E550 powertrain is a carry-over from the previous generation, and a very nice powertrain it is. The interior make-over for 2010 is also well done and welcomed, but I personally prefer the exterior lines of the 2008 a little more. The only item still on my improvement wish list is for less road\/tire noise on grainy asphalt. The 2010 is a little quieter than the 2008, but its still not as quiet as it should or could be. Other manufacturers do this better. That said, the 2010 E550 is a really great cruiser, daily driver, road trip car, whatever, smoothing the edges off any harshness or abruptness in the driving experience. Even acclerator and brake pedals are calibrated for very smooth application of either. Overall, a much better than average car and one that I love to drive. Can't wait for this summer's road trips!",
      "I'd just like to say that i was totally impressed by this car. I had a bit of trouble finding the hood release, but I'm OK now. I was impressed by the acceleration of this car. It picked up speed when I needed it and man was it quick in doing so! Thanx for this automobile. Woodrow",
      "This is my first MB. I'm blown away at how smooth this car rides. It's peppy and loaded with features. The Navi is easy to use and it has an amazing sound system. I had no idea a car like this was so affordable. You really get what you pay for.",
      "I couldnt be any happier with my car and the deal I got through car max. Sales person was very professional and I will definatly be coming back in the near future. Thank you",
      "The 2010 Mercedes E-Class 4-matic is a really nice car. It is more than comfortable, performance is really good (although the E500 would have been nicer for those who like a little more pep), the look is amazing. I have owned a number of Mercedes Benz cars in the past (C-Class, E-Clas and S-Class) and the 2010 E-Class has been just as appealing and pleasing as all of the other Mercedes Benz automobile that I have owned. The technology is excellent The only recommendations for improvement that would have made my E-Class better are: 1) electric folding outside mirrors: good for tight parking spots, etc., and 2) upgraded seats that are actually real leather verses the standard \"leather like\" material, 3) parking sensors (I do have a back up camera which is good but the parking sensors would have made it nicer. Overall, an excellent automobile.",
      "This is a super fun car to drive. I have always wanted a smaller car that you can park with out a problem. I love everything about it. The Con's would be it is small for a tall person over 6ft other then that this car rocks.",
      "if you regularly drive over two hours and are around 6' in height, then you may have comfort problems. It's as if the pedals are too far to the left, so my right leg is always bent. This causes pain and fatigue in my right hip bone. I found others online having the same problem as well. They had to set the rear of the seat all the way down, and the front of the seat all the way up. Also, my lumbar support never stays where I put it (the setting that lets you make the bulge come out or go back in). There are pros to owning a Mercedes, especially if you have an issue that's covered by warranty. They do all sorts of checks, such as tire, software etc and throw in a complimentary wash and vacuum. You never see a mechanic, instead you deal with an adviser. They gave me a 2012 C class for the whole day as a loaner. Very cool.",
      "This car is a great value for the cost. It's performance is impressive, not too much nor too little. This car is sporty enough to drive to area social scenes, but classy enough to drive to church or business functions. I would definitely recommend this car to friends and family.",
      "Great ride in my new 2010 GLK. Well, at least \"new\" to me. Someone else had it briefly, but apparently wanted another car for their money. The drawback to the car is the \"running board\" not needed except for appearance of the vehicle. It is difficult to be a lady while stepping out of the car across extra inches. The car offers great vision and plenty of shoulder room for all.",
      "My new ML 350 is great... Love the clean interior and style. Handles great and is so comfortable to drive.",
      "This car is a great car. My mom and I both love it and we've haven't even had it for six months.",
      "Bought this car for my girlfriend and she loves it. I find myself wanting to drive it more and more. All the bells and whistles were a little overwhelming at first, but after getting acquainted with the car, it became easier to understand how things work. Fantastic ride and excellent performance.",
      "We really like our GLK350. This is the 6th Mercedes we have purchased and we are sold on the brand because of the safety features. We also have a 2007 GL450. The GLK is not as comfortable as the GL but it is a very good small utility vehicle. We traded a C350 in for this GLK and from a utility perspective it was a great trade. The problem we have with the GLK is its fuel consumption which is higher than we expected in the city. We get about 18mpg in city and 23mpg on highway. I also rated the quality a little lower due to intermittent minor noise from one of the blowers. Otherwise a solid car.",
      "I brought this car for my wife. I have to admit at first I was not a Mercedes kind of guy, but after riding around with my wife it is one of the best vehicles we have ever owned. We have previously owned two Lexus vehicles , but they do not compare to the Mercedes. Great Vehicle Very Happy",
      "Bought the car beginning of the year at CarMax. Ride feels very smooth and sturdy. Very strong steel body. Need to give little more push to close the doors than Lexus. COMAND system needs some time to learn. Could have come with parking sensor to my existing package. Filling up with supreme gas this year hurts a lot with gas price skyrocketing, but good thing I live in NJ which helps.",
      "I absolutely LOVE my car!! It drives strong and has great pickup and feels very solid...not to mention the stares and compliments I get from people about my car!! VERY PLEASED! : )",
      "I love Mercedes Benz and their quality is unmatched by other luxury brands. My first C300 Sport was so much fun to drive and in the 3 1\/2 years of driving it, I never had any issues. I'm driving my second C300 Sport and loving it once again. Looking forward to my next one already. I hear all the time that some of these asian imports look almost identical to the Mercedes - really? Nobody says WOW! when you say Hyundai :)",
      "I would recommend this car. It handles well, looks great, and gets good gas mileage. I owned a Mercedes roadster previously but needed more room. The GLK caught my eye when it was first introduced, it is still eye catching. The only drawback is back seat passenger space, it is cramped while the driver and front seat passenger ride in complete comfort. I drive this car everyday and can't wait to take a trip in this car.",
      "First time owing a mercedes benz Just excellent! I have driven other lux cars but nothing like this one.",
      "I am really enjoying my new car, it is truly a blessing. I could have selected any other car and for a lot less money, but i would have not been happy and would continue to desire to own a E-350 Mercede-Benz. I am very happy and so is my wife and family.",
      "I have already sent my step son to buy his car and he was absolutely satisfied.. carmax helped me and my family find the right car..",
      "You must have acquired a taste for 2018 Mercedes Benz this car is everything I want it anymore it’s sporty people look at you when you pull into the parking lots or restaurants you are definitely in a higher class",
      "I bought the car with a mileage of 56,000 and its everything I wanted in a Mercedes. It is as good as advertised. I wanted something not too big nor too small and the 350GLK is just a perfect fit. The drive is smooth and well balanced.",
      "Had this car shipped from Oregon! Did a 24hr drive. Very disappointed! Cabin smelled of smoke(?if car was completely checked) brake, power steering and mechanical issues w right steering. Unmentioned dents on left rear bumper. Scratches on inside door handles of all outer doors. Passenger door leatherette torn near storage compartment. I was under the impression that sunroof was standard. Being a Benz owner for over 40 years too basic no bells and whistles",
      "Engineering, comfort features, great gas mileage, styling and performance.",
      "It was just what I had been looking for - looks great, runs awesome. No problems with it at all! Has all the options I was looking for, drives beautifully. Am thrilled with this car in all aspects.",
      "perfect size for me (recent empty nester); lots of power and luxury",
      "Handles beautifully, rated high for safety, comfortable and looks gorgeous.",
      "Smooth ride, beautiful inside and out, unexpected additional features, just the right size for me.",
      "I’m loving everything about this car! It looks great! It rides great! I feel great when driving it!!",
      "the build quality is superb; its got great handling and all the gizmos you'd expect!",
      "Although the status of the vehicle smelling like HEAVY cigar\/cigarette smoke WAS NOT revealed, the car buying process at Carmax was great. I’ve always loved that truck and the price was good, so I brought it anyway thinking that the smoke smell would go away. Four months later, I still have the smell of smoke after heavy duty interior washing and several types of air fresheners. Disappointed that they NOW inform new purchasers about smell issues.",
      "This is by far the best car I owned so far, period! It offers both luxury, prestige, comfort AND sportiness. Sport mode provides more than enough excitement for reasonable and legal driving on any public road. Comfort mode is perfect for cruising around in style without losing the sports car spirit. This car is beautifully sculptured. Photos usually do not reflect the eye-catching design and quality of the car. You must see and experience it yourself. When you drive this car, regardless of top-down or up, you must be ready to draw attention. This car is definitely a gentlemen`s sports car. It tells a lot about your lifestyle and personality. On the other hand, if you are looking for rough power, a sports car screaming performance rather than luxury and refinement, look elsewhere.",
      "I like the car but I wish I could have the book to teach me about everything I should know but they didn’t give me the book. I have a little bit problem to open the trunk sometimes doesn’t open. but it is speedy and soft . I recommend it.",
      "I've driven other luxury brand vehicles and my Mercedes-Benz GLE 350 is by far the absolute best drive I've ever experienced. We recently took it on a road trip that coursed through winding roads and 5% inclines and my beauty of an SUV made the drive an easy and pleasurable one. For its make and model, I get really good gas mileage, and every detail in the vehicle is well conceptualized. I used to dislike driving before I got my GLE 350, and now I look forward to every trip to the grocery store, or school dropoff. I bought my car at such a great price, and I'll be enjoying driving it for years to come.",
      "Love the convertible, interior space, quietness with the top up, and the get up and go of the 550.",
      "I love this car because it is compact, sleek, fuel efficient and comfortable. I received a great price from CarMax. The car was in pristine condition. Everyone thought it was brand new. I generally run it in electric mode for all my errands around town.",
      "I had a 250SLK before this car, I love the larger engine, still gets great gas mileage, averages around 25mpg. I love the hard top convertible, no leaks, just a great little car!",
      "As I would only expect from Mercedes-Benz, this car is so well designed, made and thought out. Everything about it is smooth and sophisticated, from the way it performs to the design of everything inside and out. It has so many \"bells and whistles\" it will take me a year to get through the owners manual, but that is a good thing.",
      "i bought my cla 2015 for 21999 with only 12666 miles. No problems with my car plus after driving a year plus it never deprecated. I just had it blue booked and its worth 25000.",
      "I never thought I’d be a Mercedes Benz owner. this car has so much power mixed with top of the line luxury. Thank you Carmax for matching me with this beautiful machine.",
      "drives smoooth,,love the look , love the display, drives awesome on long trips",
      "Godfrey and the LAX team went above and beyond to aid me with my issues I had at the Burbank location. Thanks to him and the team, I have no regrets about my purchase outside of the minor mechanical issues I think I’ll have in the near future. Also some of the specs weren’t quite accurate. That’s why you have an outside mechanic investigate. Outside of that, the car is perfect and is everything I wanted. I thank Godfrey and the LAX team for helping me find my Black Panther. I will refer and return. thanks again.",
      "I feel accomplished when I drive my car, because I have been through so much, and I was able to get the car I always dreamed of.",
      "Smooth and comfortable ride for errands and road trips.",
      "Handles well, great gas’s mileage, comfortable and upgraded features from my audi",
      "This car has every bell and whistle you can think of. The handling is sublime. This car was made for curvy summer roads, yet, with the top up in the winter, you would think you are driving a hard top. The horsepower does not disappoint for a 4cyl, and the amenities abound.",
      "look, performance, comfort, space, good gas mileage & elegance.",
      "I drove this beautiful machine for a couple of years . the only reason i traded it was to go green. Only to find my hybrid gets less MPG then the e class. I drive A LOT! I miss this car so much.",
      "I had a pleasurable stress free experience.",
      "Exactly as described. All the conditions are very good.",
      "It is a nice value but a little tight upfront. Could use about a couple more feet. Great options.",
      "it's a nice car but Mercedes really didn't go all out on this car my infinity has more luxury than this car it's nice but a bit over priced for this model I would never buy this same model again",
      "This car is so much fun to drive, and it gets good gas mileage, most sports cars don't do well in mileage. I have received so many compliments on the car, people stop me to ask about it. It's very comfortable also, plenty of legroom.",
      "great mileage and a fun run around second car.",
      "It’s the perfect balance between classy and sporty. Comfortable on the road, fast when you want and most importantly, impressed with the gas mileage!",
      "I love Mercedes this is my fourth and my first SUV. My others were sedans and sports coupes so I love being up a little higher when driving. it also fits my growing Grandkids.",
      "Beautiful car that drives great and has a great sound system.",
      "Very smooth drive. Comfortable.",
      "Performance, finish, comfort and features.",
      "The Mercedes C300 is a very nice car for a 30 ish year old adult lifestyle, but the worst place to buy such a nice car is Carmax! Carmax will add several thousands dollars to sale price, give you poor financing options. Go buy this nice somewhere else.",
      "It's a Classy One if a Kind, looks great, drives great",
      "The engine just purrs and the ride on the turnpike is incredible! We are looking forward to the summer so we can enjoy cruising with the top down along Maine's coast.",
      "I am the second owner of my 2012 GL450 with it having 72,000 miles on it at the time of purchase. It now has 130,000 miles on it. I needed a large all-wheel drive vehicle for the snow and traveling. This has been one of the best vehicles that I have ever owned. Trust me, I have owned a lot of vehicles. The key is to keep up on the maintenance at a \"certified MBZ shop.\" The vehicle is extremely comfortable, rides great, and it has never let me down. I recently drove deep into Mexico, and it ran great. Like with any large used vehicle, it will have little maintenance things to do, and some things will cost you money. Overall, it has been money well spent. Especially in light of the cost of new vehicles. I keep up on the interior and exterior as well so it still looks great. I was recently advised by my mechanic that I can practically get what I paid for after owning it almost 5 years! I am strongly considering upgrading to a newer year because it has been a great vehicle.",
      "The Benz S63 AMG in the w221 chassis is very hard to find. Especially one with only 53K miles in good condition. But I found one on the CArMax website and was not disappointed at all. In fact, I took it to the Mercedes dealer to do an all points inspection (just to make sure everything was in good condition) and the dealer made me an offer for the vehicle. I declined of course, but the fact that dealer wanted to buy it from me the day after I purchased it says a lot.",
      "It's an amazing car, comfortable, classic and executively worth its price.",
      "Most of the GLE i expected is there, and its a smooth mid-sized luxury suv to have. Probably the best to have out of them all",
      "LOW MILES, GOOD SHAPE, SOME REPAIRS BUT COVERED AS WITHIN 90 DAYS",
      "I was looking for a 2 seater hard top convertible and Mercedes did a great job with the SLK 300. Substantial beautiful automobile. When the hard top is up and it is a coupe it is quiet inside rides very smooth. With the top down top down and the wind guard up in the back there is hardly any wind. Super fun to drive, excellent Harmon Cardon speakers inside. Could not be happier with my purchase from Carmax. They were awesome to deal with from sales to the service department. Thank you Ed for making the transaction so easy. Thank you Cameron for giving giving me stellar service!! I highly recommend Carmax in Boynton Beach, Florida. LOVE MY MERCEDES SLK300.",
      "this car is exactly what I had been searching for. I live the zip in the sport mode driving. high end classy interior compliments its beautifully designed exterior. fine tuned details that make you very proud of your car. I was able to fix the 2018 to actually use apple car play so that was a bonus. I will upgrade to an after market screen at some point as that is the only item in the car that doesn’t look of value. they offer a 12” infotainment center in the after market which is also touchscreen. The top easily can be put up or down even at 30 mph. Plenty of trunk space even with the top down. the Metallic grey color is the slickest of them all. I tinted the windows and now just can’t say enough if this car. everyone thinks it is a 2021. it shows was good upkeep does to the value of your car. hope you enjoy yours.",
      "I will recommend my Mercedes-Benz to anyone that love a luxury car very protective and beautiful high class stands out in the crowd",
      "it’s fast. very fast. the technology is excellent but has a little learning curve for the unusual mouse-style controller. it handles well, turns heads and I look forward to driving it.",
      "they do not do job repairs to replace parts in car. never buy use car from them again",
      "Easy no hassle; pleasant and efficient service.",
      "This is the most luxurious full-size sedan ever sold. My friend would love it already, and not even have started the car yet.",
      "The Mercedes S560 sedan has set the standard in sedans. Got a great deal on my S560 at Carmax, and it was covered by their sales warranty.",
      "this is one of many Mercedes I have owned. It is all I was expecting from a car when I was doing my research. it is classy, comfortable, fast when I need it to be, and sweet to look at. I traded my '14 Land Rover LR4 and although I will always miss that one for many reasons I would never regret the move I made. the GLC is a fantastic car to drive and to own. Economic at the pump, a great info system and a really good buy!",
      "My car is in excellent condition. I have not had any problems. Low milage for a great price. My online purchase was easy. First was pre-approval and the rest was done with no haggling, no pressure, all in the comfort of my home. Only one drawback, make sure you know exactly what car you want because they will run your credit for each car you choose. Both of my daughters bought their cars from CarMax with the same ease. I would recommend CarMax to anyone.",
      "Beautiful sporty luxury convertible, with 440 horsepower. Smooth or sporty ride option.",
      "Great combination of performance, luxury and functionality.",
      "Great gas mileage on the road, nice seating with memory",
      "good deal in my trade in and the overall service",
      "I love my car. It’s sleek, sexy, full loaded and is definitely me. The vehicle was clearly very well taken care of prior to my ownership. Super impressed from the car buying experience to actually driving the car. No cons. Hot Girl Summer loading.",
      "You won't find a smoother ride than on this Mercedes-Benz! Endless power that keeps on giving but a luxury ride to go with it.",
      "overall good car, it’s my 2nd GLE, and both had a foul smell when you turn the A\/C on, then it goes away. Don’t know what’s that about.",
      "it rides good for a suv like most mercedes and handles good",
      "Luxury all around and great gas mileage",
      "It is the right size and not too low to the ground.",
      "The purchase process was seamless and the vehicle meets the expectations.",
      "easily the best car I've bought so far. Carmax made it easy to find exactly what I was looking for. I spent 2 months looking for the exact trim, color and interior I was looking for. When I found it across the country the quickly brought it to Idaho. Since I've had the car ive had 1 issue which Carmax covered it completely with their \"90 day we got it covered\" assistance. Maxcare is probably the best extended warranty I've seen and is exactly why I went through them. When I get another car it is most certainly going to be through them.",
      "the whole car is built solid. everything is at your fingertips.",
      "I already have and two have went and got cars. easy fast process and affordable prices",
      "Quiet, comfortable and handles like a dream. Just the right size for the two of us. It is a four cylinder for economy and twin turbo for power. A great combination",
      "This is a personal car that offers luxury, comfort and excellent performance. The handling is sporty, but it’s not a sports car. Fuel economy is very good. The power convertible hard top is quiet and effective.",
      "First of all, it's a Mercedes! 4 door sedan with a MASSIVE trunk, all wheel drive, great braking system and you FEEL like you're on top of the world when you're getting compliments everywhere you go in it!",
      "Its a decent compact SUV for driving around town and stuff.",
      "handles great, love the style, very classy",
      "This is the second Mercedes Benz that I have purchased from CarMax and as the case was with my first one, it is not disappointing. The ride is smooth. The seats and headrests are comfortable and the stereo produces great acoustics.",
      "I never knew I could afford a Mercedes Benz until I went looking at Carmax. I love this SUV. Ride's so smooth I'll probably own a Benz for life.",
      "Its good on gas not too pricey and an all around nice luxury car.",
      "The GLB250 is stylish and fun to drive. It has nearly every desired feature and is good on fuel economy, as I average 31mpg consistently.",
      "It feels sturdy and safe when driving. It’s designed well and is a beautiful car.",
      "it drives smooth and I love the extra added on luxury items.",
      "I absolutely love my car. I have not had trouble so far. Its quick and easy on the eyes.",
      "clean acceleration and smooth ride. Gas efficient",
      "I went from a BMW to this car. The take off is slower than the BMW, I have to get used to that.",
      "I driven a BMW for over 17 years and liked my 3 series and X5. However the ride was always a bit hard and stiff. The GLE 350 is a dream to drive. Smooth, elegant, enjoyable.",
      "I saw this car on Carmax and believed it was out of my league. However, the Carmax rep assured me they would help assist me in getting me a vehicle. I was very happy once acquired and this vehicle has been handling like a dream. I highly recommend this vehicle and Carmax",
      "I would highly recommend! great experience! John at Whitemarsh was fabulous!",
      "I feel like I'm going somewhere special whenever I drive it.",
      "I am a lover of small sporty vehicles and this definitely meets my expectations. This car has exceeded my expectations, great on gas and long on looks, my red seats are an added feature. When I step out of my vehicle, heads turn. You will not be disappointed with this car.",
      "im still in the honeymoon stages with my car. It’s fully loaded and it’s such a refined piece of engineering. I do have three dogs so it does get a little tight so my next car most likely will be an SUV. Having said that, I truly love my Mercedes. It feels great, it looks great and I love the moonroof. When it’s open, it gives your car a whole new look. It’s a great vehicle, if you’re looking for an affordable Mercedes, this is a vehicle. It’s got the style, it’s got the luxe, and it drives just like a sports car.",
      "Loved you can place this vehicle on Economy we recently drove to Texas and only spent 250.00 I loved 😍 ❤️ we were comfortable and stylish",
      "I have already recommended friend’s & family members and they have bought cars as well.",
      "excellent ride, very reliable, Mercedes’ quality at an affordable price",
      "car is overall great quality minus a rattle I get from the dash . car has factory warranty and car max care but both don’t seem to cover issue . love the car though",
      "The car hasn't given me any trouble. It looks beautiful, and I feel secured when I drive it. I still get compliments on the beauty of the car."
    ]}