{
  "Review": [

    "This soap smells so nice!  It’s a smaller perfect size for my round marble soap dish.  Luxurious for face.",

    "I use this soap for the entire body, and I also use it in place of shaving cream on my face. It's really good for my face. Ever since Jergens discontinued their aloe and lanolin soap, this is what I use.",

    "I always buy this particular scent, however, I decided to try and purchase this online.  When I got it, I'm not sure if it I received an old batch or not but it smells awful.  It doesn't smell like what it usually smells like when I purchase it.  I will probably throw away and just continue to shop in the store for this scent instead of here.",

    "Just love the product.",

    "Great product",

    "Best soap ever",

    "It is clumpy when rubbing on , make my skin feel dry and tight. It would be only good for body not face.",

    "Skin feels soft and smooth after bathing",

    "Dove Beauty Bar works to gently clean your skin without drying it out. Has a nice pleasant smell. Perfect for sensitive skin. Have used it for years.",

    "I've had problem with soap drying me skin for years (since my early 20s in the early 80s).  I used to use glycerin soap before the liquid body soaps came out.  Then a year ago i began trying different bar soaps to reduce my plastics use.  I've tried about 10 different soaps some of them crazy expensive ($10+ a bar), many of them moisterizing (they still dried my skin) before trying dove which several friends had suggested.  i put it off as i'd never had any luck with big brand name soaps.  But that was a mistake as Dove soap cleans without drying out your skin.  I don't like the soapy smell of regular dove and tried this shea butter version.  I was a bit concerned it would be too smelly (i don't like strong smells and many give me headaches).  But i needn't be.  the smell of the shea butter is mild and much better than the soapy smell of the regular dove soap.  The smell also rinses right off so i don't smell it lingering on my skin after washing.  A great affordable soap that doesn't dry my skin or use plastics in it's packaging.",

    "I love the vanilla svent. I isrd this bar of soap in the shower, for my entire body anf also at one of my sinks for my face.... PERFECT!",

    "I like the price",

    "Skin is soft and supple, never dry it’s all I’ve ever used!!",

    "One of my favorite Dove products.",

    "Awesome",

    "I basically have nothing to complain about the product.\nIt is perfectly amazing with its scent , I can't Imagine it's been months and I'm still able to scent it more like a perfume.",

    "Dove soap is the only soap I have ever and will ever use. And I love the shea butter scent",

    "Good value",

    "It worth the price.",

    "Love this soap.  Gentle on my skin, smells good.  Have to hide it from my husband.",

    "Love the coco dove soap.",

    "Always moisturizes my skin and smells almost edible.",

    "This soap is my favorite and for me getting so many bars of this soap for the price I’ve gotten it for. I suggest everyone and anyone orders exactly what I ordered and if you do not like what kind I got order a different send",

    "6 if the individual boxes that came with the order were all open.",

    "Dove beauty bar is always a must have",

    "⭐️⭐️⭐️⭐️⭐️",

    "Says 4 bars its clearly 2\nsmells great",

    "Nice",

    "I love Dove soup, the varieties they offer and the scent is always pleasing! it doesn't leave a residue or make you feel like you need to rewash. The only soap I use!",

    "I absolutely love this bar soap, it smells so refreshing and clean. Plus, I love how soft my skin is afterwards. I have sensitive skin and this sure does help take care of that problem.",

    "I really like using the soap. It smells good on the body and it feels good on the skin.",

    "I use this soap on a regular basis,  so order 14 bars which took almost a week to receive.  Very strong scent!  Could smell through the box it came in.  Does NOT have the very nice scent it is suppose to have.",

    "This soap works the best for my skin, and also for shaving. A definite 2 in 1! I have been using Dove almost 30 years and always revert back. For my particular skin, this is by far the perfect product!",

    "Liked sence",

    "Loved how it makes your skin feel and rinses easily. Great smell.",

    "Same as you would get in the store",

    "Smells great and helps with dry skin",

    "Dove leaves my face clean and feeling soft.",

    "Bought these and realized that my ex used the same soap... However, I'm not gonna waste 15 bucks so I'm going to use it regardless.",

    "I've tried many soaps, including others from Dove. This is my favorite, and the scent is beautiful.",

    "None",

    "This soap has a very milld sent and is moisturizing. It is gentle and effective.",

    "Really moisturizing smells good i like it",

    "Dove soap is the best - all versions - - Love!!!",

    "Got all 14 that’s all that matters..",

    "Does not leave my skin dry and itchy 👍👍",

    "Smells good I love using dove thanks",

    "price a little high but really wanted to try scent from dove",

    "Leaves my skin so soft and smooth!",

    "Buenisimo\nRapido envio",

    "Love the scent, and it's very moisturizing",

    "I LIKE THE PRODUCT OVERALL",

    "As you can see from the manufacturers box there used to be more bars in the package... You know, like the good old 20 pack. Of course the price was raised while reducing content.\nAnyway, really great quality soap... for the rich.",

    "Very nice. Moisturizing and nice aroma.",

    "I’ve been using this for quite awhile now .  It keeps my sensitive skin very soft and the smell is great. I plan to use for many more years.",

    "I can have 15-20 different scented soap, body washes and oils in my tub at a time.  I use different scents depending on my mood,  but I've been turning more and more towards this scent before bed. I find it so soothing and relaxing. The scent is amazing!",

    "Dove is the best soap.  Better for your skin and does not leave soap scum.  Best to use this soap to wash your face vs. any acne cleansers which make it worse!",

    "The SHEA-BUTTER formula works to alleviate my sensitive skin issues!",

    "I have been using Dove Beauty Bar for many years.  It is the best moisturizing bar soap.  Recently the bars have shrunk and the price has increased sharply.  Aldi makes an equivalent product that is the size and price Dove used to be.  Sorry Dove, times are tough.",

    "Bath & Shower",

    "I absolutely love this dove soap and the scent is amazing! I have really sensitive skin, not only does it not cause a reaction from my sensitive skin but it smells really really good!",

    "Smells nice",

    "Moisturizing",

    "OMG. I have very dry winter skin and this saved me for sure. I did not want to try anything other that white dove but this is the best for dry skin.",

    "This soap is great on sensitive skin and allergy prone skin and it has a very nice scent",

    "Great soap for a great price",

    "Small bard. Melt fast",

    "The scent of this soap is so soothing and makes me feel delicious. Love my Dove soap!",

    "I did not pay close attention to how small this bar soap is. 100 grams. Bought this with intention of it being for body wash. Disappointed to realize this is tiny and would probably be best used at the sink for hand or face washing. I also bought this specifically for the scent. The scent is not as appealing as I thought it would be. Pretty basic soap smell not really “warm vanilla”. Would not buy this specific item again. I only use Dove soap varieties and will continue to use Dove but i will choose a different product next time.",

    "For better smooth skin love dove products",

    "Just buy it an make it a habit it works great keep ur skin soft & smoove",

    "The Scent Is Lovely & Leaves The Skin Smooth",

    "I love Dove soap.",

    "Best soap I've used for my skin. Moisturizing and leaves my skin feeling and smelling great.",

    "Smells so good!",

    "Great smelling but a grainy texture to the soap itself. Can’t beat the price",

    "I got the correct number of bars, but 6 aren't wrapped.  I got a pack of 8 and 6 loose bars that are \"not for individual sale.\" Why not do 2 8 packs & charge appropriately? This feels open, and no one wants their soap they use on their body that way. They should all be wrapped! The soap smells great, and it isn't drying. I love the soap, just hate how they shipped it!",

    "This is my go to bar for my super dry skin, the scent is light and it lathers awesome",

    "When I removed the bar from the packaging and set it out in my room it filled the space with a glorious scent. I become mesmerized by its glorious smell. After a shower it permeates from my skin. The only downfall is the smell doesn't lastI for very long. I know it's just a bar of soap, but !it smells soooo good. It's really gentle and nice on my skin.",

    "I like Dove soaps but not this one.  I also notice how quickly the soap gets small too fast.  Will not order again.",

    "This was advertised as a 14 pack of bar soaps, but when I received it, it was an eight pack and six additional bars instead. I won’t keep it because the individual bars do not look opened and I like the product.",

    "Smooth and soft",

    "Too much fragrance.",

    "I love how good it smells and it lathers up so much I love that..",

    "I love the Vanilla scent.",

    "I really looked forward to this soap, but I realized that this is very bad for skin mositurization after using it for a month.\nAt first, I was a little bit surprised that it had too strong smell, but I didn't care about it.\nHowever, as I used this soap more and more, my hand became drier and drier.\nEven now, my hands easily gets small cracks without using hand creams for moisturing.\nI sincerely don't recommend this product especially for people having sensitive skin.",

    "I love my DOVEsoap",

    "Smells great",

    "Smells good, skin feels soft , fresh",

    "I love the smell, very strong have me sneezing tho lol.. I still love the smell. I would not use on my private down there if your sensitive down there. I only use it for outer body and mah butt lol sorry but yeah.",

    "Smells absolutely incredible and makes your skin feel so soft. Nice and gentle, highly recommend",

    "Creamy",

    "Liked it all",

    "Like the price for the amout",

    "Love the scent and it keeps my skin very soft!  Only brand I buy! A+++",

    "The soap works well with my and my family’s dry skin. We love it.",

    "ery good soap",

    "Love my soap",

    "The price was the same as local Walmart. Smells like sweet coconuts. It keeps skin moist.",

    "I didn’t dislike anything about the soap.",

    "Nice fragrance and feels nice on my skin.\nDid not dry out my face",

    "i recieved today a cellophone wrapped pack of 8, and 6 loose bar boxes-------------please send the two remaining bars at no charge",

    "No complaints! Smells good tho",

    "The soap was so nice and moisturizing to the skin",

    "Love this product never fails me !",

    "This band was attractive, but it  deeply cracked all over, at each hole in the band, and quickly came apart thereafter.",

    "When I received my package it was open and missing items.",

    "For elderly mother",

    "Smells great, feels great, cleans skin!\nIt’s soap but butter. (See what I did there?)\nWill buy again.",

    "I love how creamy it is, lasts long and moistures my body.",

    "Order was wrapped nicely and packaging was flawless. Great price for this product! Hard to find this scent soap in stores. Great lather and great on the skin. Thank You!",

    "Excelente",

    "I'm a huge fan of the original scent Dove beauty bar, but this time I decided to try the Shea Butter scent. It's perfect. It lathers and feels just as moisturizing as the original bar, but the shea scent is really nice.",

    "I always buy dove soap. It’s the only soap I like. The last time I bought the Shea butter soup it is not the same formula. Very strange color even shape. I just bought more dove but I bought it in white. Hopefully it will deliver the quality I’m used to.",

    "Dove is best",

    "Good",

    "It smell sooo good. Will be buying more.",

    "It was shipped fast just as described. Would buy again. Thank tou",

    "Dove is a good quality soap so I don’t know why the chia butter box I got leaves my skin dry, not smelling good very long and produces awful awful suds.  Are these real bars or rejects/fakes IDK.  I can’t compare to store bought of this “model” because I bought this for the price, it’s not my norm.  I wish they gave me a clean feeling and I’ll go with normal dove next time.",

    "Great",

    "The only soap that doesn't irritate my skin and smells delicious",

    "Love the smell of this soap and I like the fact that it gets good lather don’t feel clean if my body is full of suds great soap would buy again",

    "Smells good lathers nicely",

    "Me and my family live this soap",

    "Good\nMe encanto",

    "I love all that since the skin moisturizing the scent I was bought at the store but for convenience I ordered through Amazon like this product very much",

    "I received 14 soaps , rather than 16. 2 soaps were missing.",

    "Definitely does not smell anything like warm vanilla and it leaves my skin extremely dry",

    "My skin so soft my skins loves dove, it cute the grease and does it whole job. I always get me dove you have to buy smells good and not noo strong crazy ! Very good",

    "Gentle, skin softening,  and smells so good!",

    "No dislikes EVERYTHING 💯",

    "👍",

    "Love it smells great and very moisturizing",

    "Like the smell",

    "Bars was small but smells Good",

    "Great item",

    "Love this scent",

    "Everyday use item.",

    "It's the best.",

    "It's not what I thought, or I thought it would Excell with all skin types very buttery. Cleans and is dove so it's soap",

    "Great dove soap as are all dove soaps but this one does not smell like vanilla at all",

    "NA",

    "Todo bien\nTodo bien",

    "This is great product, thank you very much",

    "My favorite soap for the shower.  Great for all seasons.",

    "I really love the smell of this soap! it great on skin being that I have sensitive skin I think it works amazing.. Its a soap and I love dove products! 10/10",

    "Smells good",

    "This soap helps me keep my sensitive skin soft",

    "Smells great even with the box closed!",

    "Leaves your skin feeling smooth",

    "Love this soap , will be ordering again",

    "Great for my sensitive skin",

    "Very happy with this purchase. Smells so good and makes my skin soft.",

    "Does exactly what I would hope a bar of soap to do",

    "Love the scent and softness of this soap!",

    "No strong smell, lathers well, not drying to skin, rinses off better than many soaps.",

    "I use dove all the time and like the way it feels on my body.  Like the ingredients and wanted to try this one.\nThe Shea butter fragrance was so strong that I returned this.  Will go back to the original or for sensitive skin\nNext time.",

    "👍🏾",

    "Great deal thank you!!",

    "Good cleansing, pleasant smell, & long lasting .",

    "I am not any scientist so take what resonates with you and leave what doesn't. Why are we buying soap not only for us as women but for our children, when the main warning on this product is that it causes INFERTILTY? There is a certain chemical that is used as a preservatives ( multiple other ones are used in lotions, hair products, Etc) These chemicals soak into our pores/ blood stream. Bottom line the soap we use should not harm our reproductive systems if anything it should be doing the opposite. Read the ingredients and make sure to read the warnings because it's more common than we like to think and they like to let us know. Stay safe and enjoy yall's day!",

    "Has a very nice scent. Creamy and soft. Good price as well.",

    "You will not received a 14bar sealed packaged is going to be an 8bar packaged plus a few loose ones from another packaged to total 14bars.",

    "Love it",

    "I luv the smell and most of all it did not dry out my skin",

    "If you want a smooth feel to your skin and a smell that last over 24 hours. Dove shea butter is the soap you want",

    "It's typical dove soap with its moisturizing ability, but instead of a nice vanilla scent it's a strong perfume that stays with you long after the shower. It's so strong it stings your nose and waters your eyes.\nWhy on earth they'd put such strong perfume in soap is beyond me. It's unusable.",

    "This is the only soap that works for me. Keeps my face from getting oily and dry. Body too!",

    "My favorite soap",

    "Diferentes gramaje de jabon, es mas pequeno el que envian al que se ve en la foto.\nEl gramo del jabon es diferente al de la foto, es mas pequeno en realidad.",

    "I use this soap to clean my face and body",

    "I have been a consumer of Dove soap for most of my entire 40+yrs. When the body wash, shampoo & conditioner, deodorant and other of their product lines became available to the market I decided to give them all a try, and I am a happy consumer to say the least. Not everyone had the same likes, but give it a try. You may not regret it 🤗",

    "I was expecting a sealed 14 pack not an 8 pack with 6 loose ones, the loose ones bothers me most since I don't even know who touched it and if it's from the same batch. Seem like the scent is not that strong anymore. So frustrating.",

    "Will buy again soon.",

    "Not much scent and wish it lathered more.",

    "Hidratante\nBuen aroma y hidratante",

    "My mother loves this soap.\nMy wife loves this soap.\nWhen a wife and her mother-in-law agree on a soap brand (& you know in-laws don't see eye to eye on a lot of things), then don't think twice, go grab it. ASAP.",

    "What's to dislike",

    "I like dove and looking forwArd to trying this scent\nHowever be aware that Amazon doesn’t send one box of 14 soaps.  It as an 8 pack and 6 loose soaps.  Not what was in the description. And do I trust the opened soap?  Probably not.",

    "It smells like Dove. It makes my skin feel soft and clean like Dove does.\nI would have given 5 stars, but I don't.",

    "The package has two be 14 and close bars in dove bag but I got only 12 missing two and open bag",

    "Nice smelling",

    "This soap left my skin feeling very soft. The scent is nice, not overwhelming. Great buy from my own living room!",

    "False advertisement not 3.75 oz but 3.52 oz",

    "Can’t use vanilla scent",

    "Nice scent",

    "I have been using this soap for years. Only one I use.",

    "Great moisturizer for sensitive skin . Light scented fresh clean smell after shower.",

    "lots of cream for moisturizing smell good light scent",

    "Item is of tip-top quality. The packaging was exceptionally fine. Delivery was estimable. Exceptionally pleased. Thanks.",

    "As noted above.",

    "Really good soap",

    "First of all I am a man - 6' 4\" 240 pounds and an outdoor athlete. I have fought dry skin flakes for years with dozens of bath soaps.\nI flake on my office chair, desk and car console, dark clothes ...looks like skin dandruff.\nOk so trying Dove Beauty Bar Gentle Skin Cleanser - soap trial number 345 - not  much hope. In two days all dry skin and flaking totally gone and my skin feels like a was dipped in body lotion\nI would buy 200 bars for stock if the oils did not go rancid.......PLEASE Dove never quit making this soap with Shea butter...PLEASE !!",

    "Packaging was not as described. Scent is okay not the best. Its okay all in all",

    "Smoother than a skipping rock! Keeps me moisturized an gives an clean feeling all day long! Love them smell!",

    "By far my favorite soap out there.",

    "I love the brand Dove",

    "I've liked dove since the 1960s.\nBut this one just has a nice scent.",

    "If you love that shea butter smell then you will love this. I bought the multi pack because it is cheaper than buying at the store and I enventually will use it all. I'd buy this again when it's time to refill.",

    "Leaves my shin so soft!!",

    "Excellent bar soap that doesn't leave your skin dry. Wasn't a fan of dove body wash as I didn't feel clean after using them as if I didn't rinse everything off. Wasn't a fan of other brands of bar soap because my skin felt too dried out afterwards. The Dove bar is the perfect balance between moisturizing  and cleanliness.",

    "I like the fact that I can depend on the Dove name",

    "Love this soap leave my skin soft  silky",

    "I don't have sensitive skin. But I recently tried this soap out and it made me so itchy. I would wake up at night feeling like bugs were on me. I switched back to my original soap and the itching stopped.",

    "Had to donate the bars of soap. My house smelled like a sinky candle factory, not for me.",

    "If you are a sensitive  person, just don't  use it!",

    "makes my skin smooth",

    "Great product, quick delivery",

    "nice for my sensitive skin; doesn’t dry it out, itch or cause any irritation.",

    "Super gentle but mildly drying on the skin. Otherwise very nice product",

    "No smell waste money",

    "I love this soap.  It makes my skin so soft and it smells great.",

    "Love the scent",

    "Love the smell. Definitely purchase again",

    "To start I want to say that I do have sensitive skin + eczema, and have tried other Dove soaps that have irritated and dried my skin out. I tried this one out with hesitation but I’m glad I did because I love it! My skin feels so soft after the shower and it has even helped calm down my eczema.\nI will say the scent is kind of strong. It’s not a bad smell, it’s just pretty prominent.",

    "This is exactly as you would expect. It’s a Dove bar (not edible).",

    "Great value!",

    "Smells great",

    "Will buy again",

    "Está marca de jabón es muy buena\nYo llevo comprando está marca de jabones por muchos años me gusta mucho como deja la piel y huele muy bien yo la recomiendo",

    "Soft lathers",

    "My entire family will only use Dove!",

    "I was surprised at how amazing this smells.  It doesn't dry my skin out. Would definitely recommend..",

    "Wonderful smell !",

    "If wife likes the soap, it must be all the good attributes ; scent, moisture, sensitive skin.  I didn't ask.  She didn't tell!  I'm supposed to know stuff like this.",

    "Good moisturizing and work well, don't disappear after 3 baths. Recommend. The smell is amazing.",

    "I've been using dove soap for many years and this sent is just wonderful !",

    "This is the only soap/cleanser I can use on my sensitive face, my body can tolerate other cleaners but, I just use this anyway since I have it; it does a great job at keeping my feet soft and the rest of my body feels clean after each use. It rinses away nicely, leaves no residue behind.\nIt's gentle soap with a gentle scent.",

    "I purchased the same product, but in the pump as liquid soap. And you TRULY smell the Shea and vanilla!, however the bars smell like the original Dove soap! I'm not happy!.",

    "Always great",

    "This soap is to die for.  The sent and softness is really great and it lathers with lots of bubbles",

    "If you like this scent then buy from here if you want bulk like I do.",

    "smooth skin!!!",

    "This soap smells really good and makes your skin soft.",

    "Love this brand",

    "Great!",

    "I only use this soap, this is the first time I bought it online. It seems it’s from an Asian country. Everything is the same but the smell is a lot stronger and smells like an “old lady”",

    "I was looking for the small hotel-size bars of soap. These are bathtub/shower size. Good product, but wrong size/",

    "The same size and quality as in the store",

    "Discovered this soap when it was hard to find my usual product on the store shelves. I have had problems with dry skin - especially my hands from washing them more during pandemic. No more! This soap doesn’t dry out skin and moisturizer like a lotion. Not too heavy. I’ll be a customer for life.",

    "I accidentally purchased the wrong scent but that’s my fault. These have a strong smell. It’s not bad it’s just not my most preferred but they make my skin feel good.",

    "Like",

    "The soap is great. Moisturizing and has a great smell. Really recommended!",

    "I use this product everyday",

    "Great  soap smells  great  lathers nicely enjoyable",

    "Good smell & makes you feel clean.",

    "Good",

    "I liked the product it smells good, good moisturizer worked well on my sensitive skin. I would purchase it again",

    "Makes my skin hydrated and feel like Buttah!",

    "Great product",

    "I like the scent and smooth texture of the  cocoa butter Dove soap.",

    "Keeps moisture in skin, great for our dry winters.",

    "👍",

    "In the last 2 years I started to have dried skin in all my body. I changed soups and creams but did not help until I tried this amazing dove. Few months now and no problems.",

    "Soap does the job and rinses clean but, with already dry skin the soap doesn’t moisturize the skin. It dries mine out more so my wife uses it and has no problems at all. Average skin it works just fine. Sceriasis or any skin issues I would not recommend for everyday use. Most however will not have any problems.",

    "I’m  completely sastified. Thanks",

    "I have suffered from eczema for years, now that I’ve been using this bar, my eczema is almost gone. I’m so great full for Dove",

    "If I hadn't purchased these soaps here on Amazon I would say they are fake Dove. I know it's a different scent as the original but it should lather the same, should be as moisturizing, and should be as gentle as the original one. I'm very sensitive so most others probably don't mind but I get itchiness from it and not from the original one. Also the creaminess of the original one is not present at this soap. The scent is awful in my opinion but that's just preferences. Others might like it. But it's very strong. What also bothers me is that after using it a few times the top stains. Also not the case with the original scent soap because it's creamier.",

    "Great soap, good price.",

    "Smells great just like in the store but more for less. I will be ordering these from now on",

    "Excellent soap been using it for years",

    "You can’t ever go wrong with a Dove Beaty bar. It’s a classic.",

    "Showers",

    "Dove brand is the only soap our whole family uses.  My dad always used it he lived to be over 93 yrs. Old and didn't have any wrinkles.  Amazing brand along with the body wash.",

    "Great scent! With the moisturizing power of dove.",

    "My granddaughter has sensitive skin. Dove products is all she can use. She especially loves Dove Shea Butter.",

    "I love this Dove version. I used to always buy the Winter Care type but you cannot buy that all year so I tried this. Beautiful scent, nice lather, great moisturization. Wonderful all-around bar soap for me.",

    "This is a great product for your skin.",

    "Would buy again.",

    "love the scent",

    "Great!!",

    "I just switched out all my liquid products for bars. I don't like the squeaky, sticky feeling that some bar soaps leave you with. I was looking for a soap that would work for my body but would also be gentle on my face. This was exactly what I was looking for. I love the smell and my skin is soft and moisturized and not sticky feeling. I now have one less thing in the shower which is awesome!",

    "Real deal. Smells amazing, and moistens the skin",

    "Great scent",

    "Soft",

    "I have been using regular Dove bath soap which I really liked...HOWEVER, I bought the Dove with Shae Butter and I LOVE IT!!",

    "Great for travel and priced high. Smells good.",

    "excellent moisturizing without greasy feeling; immediate results",

    "I have relatively thick skin and this made me break out. My skin felt so itchy afterward. The smell is VERY overpowering, almost like perfume. I love Dove soap, but not this one. Going to throw this away.",

    "No scent not moisturizing",

    "Only brand my household uses!",

    "I love  the scent not too strong, sensitive to my skin, moisturizes my skin so I don’t have to always use lotion.  Great value for the price, definitely would recommend.",

    "Good product",

    "I love this product. I use it everyday. I highly recommend it.",

    "The product is ok",

    "Smells nice.  Mosturizes, even in dry climate.",

    "Make your face and hands feel great. Great moisturizing for face and hands causing great feeling",

    "This is a great moisturizing soap to smooth and soften the skin.  I love this soap including the other fragrances.  This soap is all I use.",

    "Moisturizing and calms my sensitive skin.  Wonderful scent.  Does not disappoint! IT'S DOVE!",

    "Smells Gr8!",

    "Gooood soap, i dig it.",

    "Love this soap. It leaves my skin soft and feels creamy.",

    "Nothing",

    "It’s amazing for you’re body and the scent is amazing and it’s lasts very long.",

    "I will start off by saying this cause I see a lot of complaints in here , when you buy dove products such as these soap bars  off of Amazon,  MAKE SURE it says SOLD BY AMAZON & ships from Amazon . That way you know your getting the real deal . I ALWAYS set my filters up like that before I shop for name brand body & skin care products .\nDove anything is my go to brand to keep my skin in check . Smells good and does what it’s supposed to do . Great value for your money.",

    "Garbage  product, comtributed to my lymph nodes\nbecoming swollen! I was painful lumps , due to all these toxic mainstream chemicals !",

    "Cheapest price I could find and we love this soap!",

    "👍🏿👍🏿",

    "I like it because it smells good and it keeps the skin moist.",

    "I snagged these at a SUPER great price and that really the only reason I bought them. I. Glad I did because we all really like the soap 🧼 🙂",

    "Great for skin",

    "Excelente olor\nHidratan muy bien",

    "Great value, nice smell, very gentle on my skin.",

    "I usually like Dove products but this soap is really drying out my hands. I bought it because the ingredients are supposed to be hydrating but I find the opposite is happening. I have to use moisturizer after washing or my hands get really dry. Sad.",

    "The best bar soap ever.",

    "I finally settled on this soap for showering because we moved into a new house where the water is hard and our skin began to have some negative reactions like very dry & itchy and then when the weather got cold that didn’t help so this along with Curiel wet skin therapy helped a lot - the two together work for me and keep me from clawing myself so I’m pleased with it",

    "Dove is the only soap I can use on my skin. It smells delightful, softens my skin, and soothes the rough patches.",

    "This is always my go to and it leaves your skin smooth and the scent is wonderful.  It's on automatic so that says more than enough.  Love it!",

    "Let me preface this by saying we have softened water now. This soap lathers really well, is not overpowering and is moisturizing. I use a soap saver and one bar lasts forever. It came in a big pack and 2 individual boxes which tickled me.",

    "I’m not quite sure how to write a review on soap but I will say the price was great for the quantity that I got. I believe in stocking up on items that I use. But I do love this soap it does make my skin feel good and it smells great",

    "Nice change from the original Dove.  Good product.",

    "I have very sensitive skin and am sensitive to fragrances. I absolutely love this soap! It makes my skin feel very soft and doesn't irritate my skin or my head/sensitivies to fragrance. Absolutely love this soap!",

    "love it",

    "Definitely fragrant. I love dove products.",

    "The moustriser",

    "The bars are a nice size and the scent is pleasant. Bought these to wash my face and I'm glad I did. It leaves my face feeling soft and moisturized.",

    "great smell and help my dark spots fade.",

    "Love dive",

    "Great for face and hands.  A little goes a long way.",

    "This is a great deal for soap with a lovely scent that does not irritate my sensitive skin.",

    "I didn't realize the shea butter dove had a vanilla scent added,  if I had I would have never bought it.",

    "Calidad\nMegusta la fragancia",

    "I used to love oil of olay soap bars. But I've noticed the big change. It doesn't seem to be the same formula it used to have. It leaves my skin unmoisturized with s sticky feeling and my tub is full of soap scum. I got rid of this soap and never buying again.",

    "I placed a bar in the shower.  Soon the vanilla scent was so overpowering I packed up the bar and RETURNED the 8 bar pack to Amazon.\nAmazon has now restocked the Lever 2000 w/ Aloe and Cucumber, so I am gladly going back to this excellent soap.",

    "not a soap connoisseur but it helps me clean and feel good",

    "Helped my extremely dry skin",

    "Smells delicious and is ever so gentle for sensitive skin, even for my other half. Suds up quickly, and the bar lasts a long time. Extremely happy, but then again, wouldn’t expect anything different from a great product from “Dove”.",

    "Normal size bar soap",

    "This type of dove soap is awesome for my skin",

    "work well for the skin even though their small but the price not bad",

    "smell, lather, easily rinsed off",

    "I used this in the shower as a body soap, in an effort to reduce my dependence on plastic bottles. But whew! The scent is so darn strong! I can open a new bar, leave the bathroom & it \"perfumes\" my bathroom *and* bedroom with the scent. Gag. I will not be reordering.",

    "nice quality",

    "Exelente\nMe encanto deja la piel muy suave",

    "Always used dove since my children were babies.  Like this scent the best",

    "The soap scent holes up for the entire use of the entire bar. Its  gentle on the skin. Love the Shea butter scent.",

    "Works well, moisturizes and limits plastic waste.",

    "There are a few things that is important to mention. (1) It has a really strong smell, but it doesn't bother me much. (2) This is what I think is more important to say: it does not make a lot of foam so I would have to keep rubbing to make enough amount of foam to make me feel clean; hence it doesn't last long. (3) Of course the shrinking size doesn't help either. The bar now only weighs 3.5oz., a far cry from 4.25oz. not so long ago. I would go with Costco's Kirkland soap which IMO is equally good, if not better, and more economical.",

    "Loved the moisture, smell and feel of this product",

    "Dove is the best for sensitive skin.  Cleans and moisturizes.  Leaves a nice clean smell.  There is no downside to using a Dove bar for your body.",

    "If you get itchy in the winter and cracked skin from regular soap, try this",

    "The scent aroma and smoothness",

    "Other soaps make your skin dry. Always buy Dove, all scents and kids are quality 💯🤘🏼",

    "My kids have used this soap with no problems. My son has really sensitive skins and is allergic to a variety of chemicals. We have been using this soap for a long time.",

    "We love it we bought 16 bars and found out it actually makes the bathroom smell great so I opened up a few of them and stuck them around the place now the entire house smells pretty darn good thank you Dove great product",

    "9/2/22  just received my bi--monthly orde of Dove unscenterr shea  butter bar. It's fantastic leaves skin feeling clean and moistuerized. I ust learned last moth that I have eczema. Ihad a reall bad episode and the physician advised me to continue to use a mild soap for hands as well as the body. Dove unscentered shea butter is just what the doctor ordered! I love it!",

    "Was very impressed , not too oily just right",

    "I paid $8 and some change for a total of 8 bar soap I only got 2 .... where's the rest of my soaps?",

    "My skin feels mouiterized2",

    "It's not as moisturizing as i would have liked but it has a nice scent and it's slightly less drying.",

    "I have sensitive skin and it helped heal my skin",

    "As described. Only soap use",

    "Shae butter Dove Soap is the best at making your skin smile. And the softness lasts all day. Its a wonderful product!",

    "Smells great",

    "Love this soap only one I use",

    "Love the scent and being a man helps to moisturizer my skin.",

    "I like everything about the soap besides if I go to the gym the smell of sweating and the vanilla is gross I should’ve went with another scent. Wish it Had something Exfoliating in it as well but could live with out I guess",

    "Description states 8 bar pack, but received only 1 bar.",

    "Dove is the best natural soap that I know cleans my skin well and keeps it soft and moisturized.",

    "Great moisturizer, but the scent is bad.  It has a strong scent of black licorice.  I would suggest purchasing  unscented bars.",

    "This price on here is good. Comparable to Target and Walmart.",

    "Lovely scent, feels great!",

    "The ell and  what it's  does for skin",

    "It is a soft and very pleasant-smelling  soap - will make it a habit to continue purchasing.",

    "This is our first time with this soap. We are very happy with it.",

    "Love this soap. Improved my dry skin.",

    "Me encanta este jabón , la suavidad que deja en mi piel y el aroma.\nMe gusta como hidrata mi piel",

    "Great smell doesn't dry out skin",

    "I didn't expect to like this so much; it's really luxurious and has improved my skin.",

    "love the scent of the product as well as shipping item was fast",

    "All the bars are vanilla, not coconut like I ordered. They smell good, but is misleading. I'll buy from another seller next time",

    "I love Dove products.  They are what they say they are.  The scents are all soothing and they lather up nicely.  Excellent for sensitive skin.",

    "I love dove soaps they are so soft",

    "This was advertised as a package and coconut. Not coconut and not in one package.",

    "I love this soap. It smells so good and your skin feels amazing.",

    "Good for her skin  help keep her skin moist",

    "I bought this for mom, she likes it. She likes using a bar soap, this one makes her skin soft and silky. She likes the smell too.",

    "The best version of Dove soap.",

    "These came packaged very oddly.\nOne box had 8 bars in a manufacturer package.\nThe other 4 bars were individual which was just odd.\nProduct is fine, but they should indicate that the order will be shipped partially as individual bars.\nMade me think it was a repack or return.",

    "Exelente",

    "Have used dove for 30 years and still love it.  Fun to have so many choices , of sent, to choose from.  Great value",

    "Helped with razor bumps an skin discoloration",

    "For face or body this soap is gentle, but cleans well and does not leave a residue.",

    "Dove is the only soap I have used for years.  It is the only soap I used for my daughter and now that she is an adult she uses it also. It leaves your skin smooth and clear.  The Shea butter smells good.  It leaves you smelling good with a softness.",

    "Absolutely love 💕! This is a must have for me, the smell alone will lighten your mood! My kids say that I smell like cake or cookies, lol. If you have a significant other and you couple this soap with the moisturizer or oil and think your going to bed guess again! I love perfume and own a lot of high-end fragrances but this is my go to for the light and daily wear. It's easy on the skin and again coupled with the moisterizer it's perfect throughout the year.",

    "Excelente",

    "Not drying to the skin. Smells nice",

    "Loose bars of soap scattered in a shipping box not a packaged 14 pack. Horrible packaging. Would not buy again.",

    "I received my package and didn’t open it until I needed to use it. The items in the box came in 3 different quantity packaging. I received an 8 pack, 8 pack that was cut in half, and two singles from another package. I have never seen anything like it before in my life. There is no way this item should have passed Quality Control inspection.",

    "Only soap my body accepts",

    "The packaging did not appear to come from a business.",

    "The Dove Shea Butter is my favorite among all the beauty bars.  It keeps my skin moisturized.",

    "Was a good deal, the shea butter is kinda hard to find... Will purchase again",

    "I use this on my face also",

    "Great value.",

    "I am an already fan of dove products..this one is mild In Texture and scent",

    "My dernatologist recommended Dove, I picked the scent, no more itching.",

    "when it came it i could smell it through the box and it smells so nice but yet so refreshing and simple.",

    "Can't beat this deal! Smells great,\nvery moisturaizing,  nothing bad to say,  only good.",

    "This is the best soap I have ever used. It far exceeded my expectations. It has always been very gentle and it's scent is most pleasant. Using this soap is a continual pleasure! A-Plus! That's what I say.",

    "Great long lasting scent 😊",

    "I don’t share my dove soap w anyone this is my self care using the best bar soap",

    "Good",

    "Dove is a tried and true great brand. These particular bars are no exception to the brands excellent quality. The scent of these is so nice. Its not overly strong, but smells so warm and pretty. Have used this scent for years. Love that I can purchase a bundle here. Its a good value and convenient.",

    "I love it",

    "El producto es súper bueno me gusta la esencia y el precio súper\nEl producto es igualmente como está descrito",

    "I love this soap and got a great deal on it",

    "Love this scent and how it leaves my skin.  Prefer this over their other scents and Irish spring",

    "I like how soap lasts longer than any other soap bar",

    "I like the soft smell and it is not drying.",

    "I usually buy the basic Dove soap and love it. This one was on sale so I figured I’d try it. When I received the package, the scent was already overwhelming before I even opened it! Once I actually opened it and tried using the soap, the scent was INSANELY strong. Some people might not mind this, since it wasn’t a bad scent, just a very strong one. However, as someone who doesn’t like overly strong smells, it was way too much for me. Definitely going back to buying the regular dove soap from now on!",

    "I have been using this soap for years and will never change the scent.  It is a very mild yet clean aroma.  It lathers great, cleans awesomely and make my skin feel soft and smelling oh so good!  I had out of town guests stay here for a week and had an unopened bar for them to use while staying at our place and they asked if they could take the soap and box with them so they can start using this soap!  Give this a try!  You will be glad you did!",

    "To keep my beautiful skin beautiful",

    "I love that it's very good for sensitive skin",

    "I appreciate the services I order from Amazon. The quality is good and\nservice is excellent. Thank you.",

    "I absolutely love dove bar soap. And I love anything that Shea or cocoa butter so I had to have this. It’s a very nice bar to use on your hands and your body as well. Nice scent. Better trying to get them in bulk for a good price if you can. I have to say I love all of doves soap bar scents. This one might be my current favorite though.",

    "This soap is very nice for my skin. Love the way my skin feels soft",

    "Nice smell",

    "Cheap, great soap",

    "our doctor had actually recommended these for my husband.\nVery nice indeed.\nThe scent is lovely but how it makes your skin feel is delightful.",

    "When I opened the box containing this soap and a few other items the smell of burnt wax was overpowering. I didn't know what it was at first and I set everything to air out hoping to get rid of the smell. But the smell didn't fade. It stayed just as strong and I soon realized, the soap was the source! It is pretty moisturizing, I will give it that, but it leaves you smelling like you bathed in candles and napalm. I will never buy it again.",

    "Soap packaged differently than as pictured.",

    "It has my bathroom smelling so good!",

    "Shea butter option doesn't seem to come in unscented.",

    "Don’t want to use agai ln",

    "I love the soap, and smell. But the packing is ODD.\nLike others before me I got two six back of bars, and then two separate. if you look at the picture, the bars say \"not for individual sale\".  I guess since I got my 14, they were not \"individual\", but I thought this would have been LONG resolved.\nSo yes, someone had to open someone else's package to give me the extra two......",

    "Good quality for the price",

    "This particular brand of DOVE is so hard to find.  It is the most moisturizing soap I have ever used and the scent is so nice and fragrant that when I open a bar it smells up my whole bathroom.",

    "Thought I bought 14 bars, only to open the box and find 6. Bummer.",

    "Great product",

    "Love",

    "I do love Dove so much. Only brand I can use. I have Lupus and my skin is very sensitive.\nThis has a very strong scent. It doesn't seem to hurt my skin though.",

    "It's wonderful.  Yes, soaop.  The scent is perfection.  Lather's just right, and yes, moisturizing.  Thank you~!",

    "I like the scents and the moisture it gives but it has too much moisture it started throwing my ph balance off. Even with sensitive skin otherwise it’s my favorite.",

    "I thought it was going to be a package like pictured however it was an 8 pack and the rest were single bars...makes me a little suspecious....",

    "on time delivery and good product",

    "Great product",

    "Nothing to dislike about the product",

    "It’s dove soap & it smells rlly good",

    "It feels soft & nice when u use it to wash your hands/ entire body. It brings lather fast.",

    "Love this soap, came within a couple days of ordering and at a really good cost.",

    "THIS IS MY FAVORITE SCENT DOVE SOAP I DON'T SEE THIS SCENT VERY OFTEN IN THE STORES",

    "Gently cleans your skin without the ripping and stripping.",

    "I love the scent of this soap.  It moisturizes very well and doesn't leave skin feeling dry.",

    "A mixture of 2 size soaps.. Soap size were smaller then the normal size a couple yravel size bars were in packaging too.",

    "I LOVE DOVE",

    "I've always been a fan of dove soap for my sensitive skin. It keeps my face and body moist, soft and supple.",

    "Excellent soap, great scent and good buy",

    "I like it, smells nice and seems to lather up less than most but the scent lasts",

    "Love the anything that’s doves",

    "The luxurious scent when you open a new package of a dove bar is more than enough to earn five stars, but then wash your hands and you remember why dove has been around.",

    "N/A",

    "The order was for 14 bars and I received 11. Not sure what’s going on with that but I’m not thrilled about being shorted.",

    "I do like this product which is why I always use it.",

    "N/A",

    "This soap leaves skin feeling clean and soft, but while I like to smell clean, I don't like to smell as if I've marinated in perfume.  I had bought another of Dove's beauty bars, Purely Pampering Sweet Cream, and found the fragrance overwhelming; I put it in care packages for our senior ladies in our church during the COVID lockdown, and despite packing it in two zipper bags, EVERYTHING in the care packages smelled of it--even raisins in boxes tasted nasty and soapy.  I bought this Shea Butter version and didn't think it was as strong until I opened the package and found that the contents smelled just as strong as the Sweet Cream.  If you don't mind people smelling you before they see you, then you may like this.  Otherwise, I would recommend another brand of soap.",

    "Best soap for dry skin. I’m always ask how do skin looks healthy and everyone always amaze when I say DOVE SHEA",

    "This soap makes me clean and feel good",

    "I love Dove shea butter soap, it cleans while moisturizing your skin to be soft.  I have been using it for many years. This is my first time purchasing it on Amazon\nand the price  was  worth it.",

    "Love anything Dove",

    "This soap is great. I love the scent and it doesn’t dry out my skin. Great basic soap.",

    "I use it daily.",

    "Moisturizing",

    "Nice smell.  Keeps skin soft.",

    "Great",

    "It’s great",

    "Price was great, had a hard time finding dove soap in the stores! Will order this again",

    "Used these for years .\nSo gentle and cleanses the skin.\nGood for sensitive skin",

    "I have been using dove for about 12 years now and absolutely love it. Would recommend for sensitive skin as well.",

    "This is my fav dove scent.  It is fresh, clean, and it does not irritate my skin. This is a little spendy and I worry this storefront will charge me whatever they want from month to month, so I will not have it on auto renewal. I have had several experiences like this.  I pay a good price initially and then once on auto renewal the price changes and any savings I may have had, is changed at the sellers will.  I wish I could trust this process as this is one of those products I would love to have on auto renewal.",

    "Smells amazing!",

    "Love the scent and keeps my skin so soft",

    "I was so excited about this soap, and I'd ordered a big package of it! But the scent was minimal. I am thinking of trying the mango next, but I have to get through this other first.",

    "Great deal..",

    "Love smell and on Subscribe and Save plan. Smell of soap lingers in bathroom",

    "I like dove soap.It's gentle and keeps my skin soft without drying.I bought the Shea soap.It smells more of star anise than Shea nut.I am not disappointed just surprised because I expected it to smell as indicated on the package.I will more than likely purchase again in the future.",

    "I love everything about this product  I've used it for years and I would recommend it to anyone.",

    "The scent is not overpowering.",

    "Me and my wife love it thank you again",

    "Grate price! Fast shipping! Great smell! Love this brand for my sensitive skin!",

    "This soap smells so good..It was the first thing that greeted me when I open the box,",

    "Weird idea. Why sell a \"14 pack\" when you could just do 2 unopened 8 packs? 1 unopened pack of 8, and 1 disgusting half pack and 2 bars, meaning somebody handles individual boxes of soap and makes it less sanitary for me.",

    "Love the scent and keeps your skin very soft",

    "It’s moisturizing.",

    "I’m a big fan of Shea Butter so I knew I would like this! Love the scent!",

    "Great",

    "Love the smell & that I can use it on my sensitive skin.",

    "As described",

    "Smell good feel very soft on skin",

    "This is real dove I love it",

    "This dove soap is so refreshing, and smells very good. Leaves my body smelling good. And it's very rich and susdy.",

    "This soap is very good on my skin which is probably why I never need lotion but my skin always soft",

    "I love this for my dry skin! Light scent no residue.",

    "Only soap we use to shower",

    "I am glad I gave this a try. Really like this.",

    "I love the scent of this soap and the way it leaves my skin feeling!  It is the only bar soap I will buy!",

    "I have sensitive skin this is one of the few soaps that don't irritate me",

    "Its Dove! I mean what else can I say.",

    "This was the best price I could find anywhere for a multi pack of Dove bar soap. It's smells pretty good too! Not too strong.  Trying to be more eco friendly by using bar soap instead of bottles of body wash.",

    "I love this soap.  Makes my skin soft and smells really good.  Soaps up very well.  Great Price and came packaged well.  I recommend",

    "I have no bad reviews for this product. I couldn't believe all the negative comments,  for other people Amazon DOESN'T make the product. They sell it to the consumer. This is my second purchase and completely satisfied.",

    "This version smells better original Dove and reminds me classic Nivea scents that I use to like. It is also more gentle than regular soaps including natural ones. And, as an additional benefit, the bathroom smells better now. So all in all it is a good product for the price.  I may buy Dove soap again in the future.",

    "My purchase of a pack of 14 Dove Shea butter soap bars came as ~> 1 sealed pack of 8, a sliced open pack with 4 and 2 single bars. Yes that equals 14 bars of soap but, I expected the package as advertised not like this.\nMy complaint is regarding the shipment !!\nThe Dove Shea Butter soap is divine ~ great scent and moisturizing !!!",

    "Now, 73 years old, no soap tops a Dove Beauty Bar, period. Dermatology tested and recommended. I began with their white flagship bar decades ago and never looked back. Enter Shea Butter Beauty Bars. They’re still loaded with a moisturizer cream plus a soft vanilla scent. Your skin will thank you. Over. And. Over. Again. Amazon has become my Dove Shea Butter source — I’m so happy I don’t have to pay a higher price at a discount store nor the absurd price at a grocery store!",

    "Good soap great moisturizer for the skin",

    "Love them",

    "Absolutely love this dove soap out of all the different scents.",

    "Does a great job. Smells awesome.",

    "Dove is my favorite soap! Not harsh on the skin with a nice fragrance. I even have this in a body wash! Lathers well and relieves my stress!",

    "I love everything",

    "Enjoying it",

    "We have always had issues with bar soaps leaving us with dry skin. We continue to buy this because it keeps our skin moisturized. Great product and it smells great too",

    "I love the Dove soap bars. They leave your skin soft and smelling so good!",

    "I wish the vanilla was a little more vibrant",

    "I love the scent of this, but when I use this in the shower, it leaves wax build up and scuzzy crud everywhere.  I have a water softener so this should not be happening.  Too waxy for me. feels like a gross film left on my skin.  I suppose they are leaving too much fat in the soap.  Same thing happens in the sinks so I can't even use this for my hands.  I donated it.  I add salt to my softener, not potassium, if that matters.",

    "I paid to much for this item. I could have went into the store.",

    "The best smell out of all the scents.",

    "Love it 😻 my fav",

    "You can never go wrong with Dove ❤ Oh yes, this stuff smells amazing. Feels amazing too.",

    "I put a bar in the shower and the whole bathroom is “ scented”. My husband said “ What is with the potpourri in the bathroom ?”  I love Dove soap but these are going in the garbage and I am going back to the original as these just have too strong a fragrance for me.",

    "Smells like crap, wouldn’t recommend.",

    "Kept my smelly cheeks fresh and clean boy",

    "My hands are pretty destroyed from tile making and frequent washing. I got it for the shea butter, but I love it for the smell.",

    "Love the smell",

    "Thanks because I couldn't find any in my Walmart or Family Dollar",

    "I love dove soaps but these came so damaged and smashed into pieces.",

    "It's okay",

    "Would give no stars if possible. One of the 8 packs was missing outside film and only had 6 bars if soap. Terrible",

    "I was used to and only using tge regular Dove scented soap. When I found this I was excited and ready to try it. The price was decent and the soap was even better. I have found a new love and this will be replacing the original!! I love the Dove brand as a whole but this newest product is off the charts with me. Ive already recommended it to other people abd they are feeling the same",

    "Cleans balls 100% if used with water.",

    "I use it for cleaning  & moisture for body when I bath love the sent",

    "My favorite of all dove soap",

    "I have used this scent before and it's amazing. It's soft and leaves my skin very moisturized. Since childhood i have used Dove on my skin and face.  I did take away two stars for the package arriving opened and dented.",

    "Good price",

    "My favorite soap!! Love it!!",

    "Be aware this soap has a strong perfume fragrance that is overwhelming.",

    "Good product",

    "This is my most favorite choice of all the dove bars, Since it came out i ve not shopped for another. I like everything about.",

    "Super moisturizing! A new favorite. The scent is very strong out of the box but it does fade a lot and is very light when you use it. I have very dry skin and this soap as worked better than any other I’ve tried! Will buy again.",

    "I love regular dove! My subscription switched to this kind once when the regular was out. I did not like the scent at all. I love cocoa butter and love dove but this combo was a miss. Do not recommend.",

    "It’s soap",

    "like",

    "Oh là là ! This soap is truly magnificent! It is a lovely bar of milky sweet perfume which adds a fragrance I simply love! Highly recommended! J'adore!",

    "Wish I had checked the reviews on this product before buying as others have had the same experience as me. Didn't think it was necessary to check reviews on what seemed like a straightforward product.\nPackage arrived with a 'sealed' pack of 8 bars and 6 loose boxes of bars. The scent is stronger than the actual Dove product and the color is off. DO NOT BUY.",

    "Works great on dry skin, esp. Winter skin",

    "This is my favorite soap.",

    "This is my first time with the Shea butter Dove. I am very pleased. The bar lathers up like the genuine white but has a real nice mellow shea butter scent. NOT overpowering.\nScore:\nCoconut  - no\nShea butter  - yes!\nPomegranate - ok\nRegular white - not from here\nI am a big fan of Dove bar soap. Im 67 and have been using it ever since i left home at 17. If you haven't tried it yet you really should!",

    "No complaints",

    "Good for dry skin",

    "Be aware: they sent me only 13 soaps instead of 14. Not a good deal after all.",

    "Ty!",

    "Paid for 14 bars, only received 13",

    "It’s like mini bars of soap for full price. Not made in the United States either was not happy with this purchase.",

    "The way it leaves my skin... very soft",

    "We love dove soap",

    "I’ve used that soap forever. This is a great buy on Amazon. Strong yet gentle sent, moisturizing, and does not leave a residue.",

    "Very disappointed that product was not as described.  Received a package of 8 bars wrapped and 6 bars individual without extra outside wrapping.  Not a pictured.",

    "Dove Shea Moisture Butter soap gives my skin twice the amount of moisture than any other soap that I've used. I love that it makes my skin soft and moisturized. I also love the scent of this soap.",

    "The best!!!",

    "This really keeps your skin hydrated and has a great smell.",

    "I was a little annoyed when I got the email that my usual regular dive was sold out and they switched me to this sent. I have it a try and I’m glad I did. I think this is now my new fav sent and it doesn’t irritate our already very sensitive skin",

    "Light and great product this my second order highly recommended",

    "Came in one pack of 8 and 6 loose bar... which was bit weird but overall I think it's good value for money",

    "Great price for what you get! Love the smell! It’s not overpowering but very fresh and clean smell:)",

    "The smell is awful",

    "My whole family loves the scent. It is a great bath soap.",

    "Love dove..",

    "Amazing deal on amazon - couldnt pass it up!",

    "First off, I'm a huge Dove fan! I was so excited to receive this Dove Purely Pampering Beauty Bar, with fourteen bars included! The Dove Shea Butter Beauty Bar is a rich body bar that is made with shea butter to moisturize your skin. It is scented with lush shea butter, which smells like sandalwood and coconut also. Dove beauty bars contain 1/4 moisturizing cream, so it leaves your skin soft and hydrated. These are very luxurious bars of soap, at an affordable price. I highly recommend them!",

    "This was sent as a replacement to the dove beauty bar. The scent is good but due to the added fragrances in the bar it dries out the skin so I wouldn’t recommend this item period.",

    "One of the best soaps I have ever used. I recommend the smell is to die for ! I never want to leave the shower",

    "My favorite bath soap.",

    "Excelente\nMe encantan el olor es espectacular muy hidratante excelente inversión",

    "I love this product works wonders on my skin and smells great.",

    "I have used Dove soap my entire life and will use no other. This time it came like this? Rather odd that it's broken up and came in 2 boxes? 5* for the product-1 for the packaging",

    "Typically great Dove product with a very pleasant scent.",

    "Love the Vanilla scent and this was getting hard to find locally. So happy to find on Amazon. Plus it is a little cheaper here with the larger pkg size.",

    "Gracias\nGracias",

    "Feel good, smells great",

    "So strange... was an 8-pack and then another cut open with 2 removed. Not sure I am going to keep this subscription.",

    "I could smell the Dove purely pampering shea butter bars before I opened the box because the scent is very strong, but is pleasing to me. The bars give plenty of suds and the shea butter helps with my dry skin. The only issue I had with it is the film it leaves behind. I find this to be true of many bar soaps, and I'm not sure if it is caused by the water (whether hard or soft) or the soap itself. Still, I really like this stuff and definitely recommend it.",

    "It is stinky soap.",

    "I love it.  The fragrance is really nice.",

    "Dove Purely Pampering Beauty Bar with Shea Butter is one of the best soaps on the market. We love how it makes our skin softer and has a wonderful light refreshing scent. I highly recommend this product.",

    "I wasn't really worried about getting a big box of Dove soap, and this was just as nice as I'd expected.\nThe smell is very nice, but not overpowering.  The feel is very nice on the skin, and it seems to do a good job at moisturizing the whole body.\nYou can't go wrong with purchasing this soap.",

    "Nice soap bars!",

    "I just wanted to try this product",

    "seriously please read the ingredients on this soap. It’s a toxic soup filled with hormone blockers and synthetic fillers.\nI recommend Shea Moister or Dr. Squatch, they are a little bit more expensive but trust me it’s so worth it!!!!",

    "This smell so good want to buy more soon!!! Feel good on my skin also..",

    "I love how soft i feel after i shower. I absolutely love it.",

    "Yes",

    "This is the first time I use a Dove Purely Pampering Beauty Bar with Shea Butter, and I am very pleased with the positive changes to my dry skin. Because it really hydrates my skin while cleaning it, and it rinses neatly without leaving any residual. I also like the pleasant and light scent that doesn't linger long.",

    "Great price\nSmell great\nFast delivery",

    "I like that you get 8 bars for a very good price. The Shea butter is my favorite scent. I would buy them again.",

    "Wow! Better than Expected.  Great Moisturizer also Smells Fantastic.. Will Purchase again. Would Recommend",

    "Smells good feels good!!!",

    "i love the lather and moisturizer but the smell is meh",

    "This is a soft, creamy soap with a wonderful scent. It lathers up nicely and feels great. I have dry skin so I appreciate the shea butter. It is gentle but still cleansing.",

    "I like this scent of dove.  I have an issue with the product I received.  What I ordered and what the picture and description showed was a pack of 14 bars.  However, I received 2 packs of 6 bars and 2 loose bars.  Yes it’s still 14 but it’s not as described.",

    "Dove has always been my favorite soap and buying it in a 14 pack is awesome! My entire house has dry skin that gets worse when cold weather approaches. This dove with Shea moisturizes the skin and leave a nice faint smell afterwards. I use it on my face, body, while shaving my legs and on my toddler who has eczema. It leaves my skin super soft and keeps my dry flaky skin away. You can never go wrong with Dove! Worth every penny!",

    "This is one of the go to brands in our house.\nMy kids and I both have eczema and when it comes to bar soaps... DOVE is the brand that is gentle on our skin.\nScent is stronger on this version than other dove but that's okay because we like it!",

    "Great soap, my favorite brand.",

    "We love Dove soap so much! This is a great value for the money and it's going to last a while. It smells so good and washes off clean.",

    "Super soft and moisturizing.\nIt's been mega dry here and this leaves my skin feeling very soft and comfortable.\nScent is nice - not overwhelming.\nLove this!",

    "i like that this soap is biodegradeable, contains shea butter, and is moisturizing. Dove soap bars are a must have in our house (atleast for my fiance). That is the only soap he uses, and he doesnt mind the \"girly\" scented ones. This one is good for the moisturizing benefits but the scent is a little too strong in my opinion. When i got the box in the mail i knew what was in it before i even opened it!",

    "Didn't receive any fake or knockoffs soap. Real dove which didn't dry my skin. Love the smell.",

    "In the box that I received, the fourteen bars were packed individually rather than inside one plastic package like pictured, so by the time I got them they were kind of messy from bouncing around inside the box. I found the fragrance to be pleasant and long-lasting, but very strong. I wish it was milder. The soap lathered on well, and worked for my sensitive skin.",

    "Disappointed with how this handled in the shower. I use a soap holder, but this melted after two showers or so, which is unusual for Dove. I've already gone through 4 bars in less than two weeks.\nThe scent is actually nice and I do think this does whip up a nice lather, but I really don't like that whatever is used for the moisturizing component is probably what makes this meh in the lasting department. I don't think at this price that these are a great value in comparison to Dove's other shower bars.",

    "I love Dove soaps. Smells good and does't dry out my skin.",

    "This Dove soap has a lovely smell. I didn't recognize it as warm vanilla, but it's lightly sweet and very pleasant. It smells stronger when it's dry. When I'm using it, the scent is not as noticeable. The soap produces a good lather. It rinses cleanly. It's not over drying. It's a good bar of soap. There are 14 individually packaged bars, so you should be good for a while.",

    "I have tried many types of bar soaps and wanted to find one where not only the smell was good but also soft for the hand and body. This is when I came across this product where did it have shea butter but also a pleasant smell.\nScent:\nThe scent for this is quite strong right out of the box but it indeed smells well. By putting the soaps out you can change the room fragrance. Even though I generally don't like strong scents, but this one was an exception. The scent was not only pleasant but it was not too harsh on the nose and doesn't cause headaches when smelling or being around it for too long.\nMoisturizing:\nThis soap does quite a good job maintaining the moisturizing components after washing your hands/body with it. Not only did my body stay soft for a couple hours afterwards but the scent remained on my body but at the same time worn off after washing it off but still smells nice.\nOverall, I enjoy this product and would recommend it as not only are you getting a good smelling product that can be used for both genders but also a product that makes your skin nice and soft.",

    "I am in-love with Dove Soap and this Shea Butter bar smells so good and leaves your skin feeling so soft.  I have issues with itchy dry skin in the winter time so I always make sure I have soap like this to use during the colder months.  Great product at a great price for 14 bars.",

    "i really love the scent of this Dove soap! it is one of the reasons why i bought and love this soap. aside from the moisturizing effect that Dove soaps are best known for, it is not sticky and this has really good clean scent and i love that it lingers on me and even gives our bathroom that fresh shea butter scent too. i've been using this many times now and definitely recommends it to family and friends.",

    "My skin type is generally more on the dryer side (but I do have combination skin). I love how these bars of soap always make me feel clean and moisturized after a shower. The scent on these bars are very light and not too heavy on the fragrance side. The shea butter always leaves my skin feeling better than when I started.\nI generally prefer buying these in packs since it's more bang for the buck compared to buying smaller sets of 3 at the grocery stores.",

    "The 2 stars are for the sender only. I was allowed to retune this product easily, though. The problem started with the indescribable writing on the bar boxes. I am under the impression that if I buy Dove soap, that it will be made from/for US use. These are definitely not that. I may have overlooked it, but the bars themselves are way smaller than the US version.",

    "I’m a lifelong Dove user because of my sensitive skin and this does the trick!",

    "Smelled great. Left skin soft and no sticky residue. Great price for 4 bars!",

    "Contains moisturizing cream and shea butter. Net wt. 3.75 oz. per bar. Slightly chocolate scent.",

    "I have issues with my skin with itchiness and dryness. My dermatologist recommended a gentle soap  and mentioned Dove as one them. And yes indeed this soap feels good on the skin, good suds and nice scent. Although the suds isn't as much as the Amazon picture - unless I'm not rubbing too much lol. But so far I'm pretty happy with. The price of $15 for 14 bars is pretty fair.",

    "What is better than getting a box full of 14 of the best smelling soap bars you've ever smelled.  Seriously, I could smell the product through the box it was shipped in.  If you have scent sensitivities - this is probably not a good choice for you.  If you don't - buy this product.  It made the entire 2nd floor of my home smell like vacation.  The shea butter smell is wonderful.  The soap itself lathers up nicely and leaves my skin feeling soft, silky, and smooth.\n5-star rating due to the overall satisfaction with the scent and lather of this product.\nThanks for taking the time to read my review.  I hope it helped you make your purchasing decision.  Take care and happy shopping.",

    "\"Pampering\" is the exact right word! While I have always loved Dove, this offers a truly luxurious experience!\nSo, first, the fragrance is very comforting and light. Like with all Dove products, the scent smells great on everyone!\nThe lather is super luxe! And, it rinses beautifully. Skin is left feel super clean, very soft, and light scented.\nMoreover, one of the reasons why my family relies on Dove is because of how kind it is to sensitive skin. This new version is no different! I had no negative reaction to this soap! It just treats even the more sensitive skin with care. That is really appreciated!\nThis is a great case! Grab it and be stocked-up for a bit! Highly recommended!",

    "And ya can't beat the price!",

    "Love this scent and moisturizing soap bar.",

    "Love it",

    "Great product",

    "It smells so darn good!",

    "I purchased this product as a replacement for another shea butter soap I got from TJ Maxx, and it is not nearly as good. However, it smells wonderful, and my granddaughter likes it, so I gave most of it to her.",

    "I like the soap ok but I don’t care for the sent nor the film left on my skin after bathing. I have to spend extra time rinsing after showering I hate to think of taking a bath and then showering off the soap film. It’s ok but I love tone much better. It leaves me clean with no film.",

    "Excellent product, smelling amazing and a good price. Thanks.",

    "Love it",

    "My favorite soap! Excellent deal too!",

    "It’s just amazing and the price is right for this item!",

    "Really smooth",

    "Dad's favorite soap, he would not change to any other body soap.",

    "Dove works best for sensitive skin",

    "Awesome soap",

    "Great for sensitive skin",

    "Great scent, the entire bathroom smells great after every shower!\nDoesn’t dry my skin, i was a fan and loyal dove soap user before, but now am hooked by this scent!",

    "Smells wonderful",

    "Omg this soap smells amazing. I love all of Dave's products but this soap has been my favorite.",

    "Best soap for my skin . Lather good and good scent well worth the money will purchase again",

    "I Love the richness & lather from this Beauty bar it's so amazing!!!!",

    "I’ve been using Dove bar soap since I was a child. They have a wide variety of formulas and I don’t recommend them all but this one is one of my favorites. It was convenient to order so I can decrease my number of trips to the neighborhood superstore.",

    "I would have loved it. Actually I loved it. That’s why I bought this. But this time I am returning it without being able to use it. When I opened the package, I saw one of the soaps was opened already. Abhorred, I looked. Sure enough, it was used. Dried bubbles on it. I’m sure they didn’t know it. Nah I’m gonna stick with the liquid body wash even though I switched all my liquid soap to a bar soap for some environmental reason I read somewhere.",

    "I absolutely love the scent of this soap",

    "Thought i would try dial and that was awful. Now i know how much better dove is",

    "Great Dove product. Great scent.",

    "Love the fresh smell & it does help with the moisturizing, but not as much as I hoped for during this pandemic!!!!",

    "This soap has a wonderful scent and it is moisturizing. I suspect that women would probably gravitate toward this soap more than men. However, I am a man and love this soap. I will definitely purchase again.",

    "I only like the white Dove..",

    "Smells so good 😊",

    "I have very sensitive skin, so am very selective of what soaps I use. I purchased this after reading reviews on both here and Google, and am very glad that I did. This soap smells wonderful and leaves my skin feeling soft, clean, and smooth.",

    "Exact product stated and arrived fast",

    "Buy it!  You won’t regret it at all.",

    "Smells lovely. Good for my semi sensitive skin.",

    "I tried this once years ago, been buying off and on, then couldn't find it anywhere in stores! So happy I found it on Amazon! This soap leaves you smelling so good but not overpowering! The soap bar lathers the skin real well and feels soft and smooth and not like its loaded with chemicals my sensitive skin would break out to.",

    "Really Like the smell and the fact that it's has moisturizer !!!!!",

    "good",

    "This soap makes all my bathrooms smells so good! Warm vanilla and shea butter~ So moisturizing and gentle for the skin. I'm washing my hands 100 times a day these days and love how super hydrating this leaves my delicate skin!",

    "I ordered two packs off dove and only received one.",

    "I love Dove soap but I have been using this scent for years now. Keeps my skin free of blemishes and smooth. I always get compliments on how soft my skin is.",

    "Been using for years...wonderful product.",

    "Though I don't like its scent, I like its quality.",

    "This soap has a very strong scent.  I won’t order it again.",

    "Good Quality Soap",

    "Dove is my favourite but not this shea butter i wanted to try but didn’t work on my skin so going back to Dove pink",

    "Leaves skin with great texture!",

    "Not much of a scent",

    "It's a good one.. great scent",

    "Great smell, amount and really moisturizing",

    "Lasts a very long time and has a very wonderful scent especially when combined with baby oil it works as a scent booster and the soap just tops it all off",

    "This soap is clogging my pores and leaving white heads on my chest",

    "I have super sensitive skin and Dove soap is the only type of soap that leaves me with a soft and moisturized skin feel after a shower. The Shea butter scent is a great natural-smelling alternative to usual soap chemical smell",

    "Keeping and smelling clean",

    "I love it",

    "My dermatologist  recommended this.",

    "I always loved this product! Leaves my skin soft and beautiful!",

    "Awesome soap leaves your skin soft smooth and silky for days.",

    "I made body wash out of this soap, have been using it for 3 days now and really like the quality. Much better than different kind of soap that I got from Target. I recommend this seller.",

    "Fantastic product",

    "Good",

    "Definitely helps drier skin so far it's the best I've tried.\nRECOMMEND!!!!\nSmells good too..",

    "I liked so much the product! Came as the same announce!",

    "This works best for my skin. I feel the moisturizing effect each time I use it. I love it.",

    "To wash up with and soft skin",

    "Skin felt real moisturized",

    "Good smell, gentle on skin",

    "It smells good and is just like the other bars of dove soap",

    "Keeps my skin from drying out in winter.",

    "The best soap on the market!",

    "I switched to bar soap in order to consume less plastic. I like this soap very much. It’s wonderfully moisturizing. The bars come in individual paper boxes and the set of boxes comes wrapped in a cellophane like plastic.",

    "Don’t dry out skin and no soap left behind.",

    "I use it all the time because it smells good, it moisturizes my body good, and last long.",

    "I love dove and a lot of their scents but this is definitely one of my favorites! Lasts a long time and really moisturizes!",

    "Unlike the traditional soap bars, this soap bar has a very great after scent, while also having the benefit of not drying out my skin.  I would definitely recommend getting this product.",

    "Prefect for my daughter sensitive skin",

    "I liked this product.  It has a soft and beautiful scent!!",

    "It's great! If you feel like you're a fluffy bun put some Shea butter.",

    "Use the bar soap and body wash. I love the scent. I am allergic to most scented products and this smells amazing and works.",

    "Awesome moisturizing factor. Great value. One downside is that you can feel the soap easily come off the bar with warm water, probably wasting product to the shower. Otherwise solid choice for cold dry weather!",

    "I've been comparing it a lot, it's my favorite",

    "Love the way it leaves my skin feeling. I am very particular about what I use on my face and body",

    "The only soap I use.  It smells great and doesn't dry out your skin.  This is a great value too.",

    "All time fave! It’s the only soap I use. Great for sensitive areas. Moisturizing and smells grrrreat!",

    "Love it",

    "I love this product i",

    "What a great soap! It smells good and keeps my skin moisturized.",

    "👍🏽👍🏽",

    "Perfect",

    "Love dove.",

    "Great product.",

    "Not all soaps keep your skin moisturize like dove!! In love with the smells!! Thanks!!",

    "I liked everything about Dove Beauty Bar\nI like othe ones, but I really enjoy the Shea Butter best.",

    "Very nice scent and a good amount of lather from this soap. It's Dove so their quality reflects here too. Little expensive but worth for the performance.",

    "This is my favorite dove soap scent and it’s a good deal on subscribe and save.",

    "good price; good quality",

    "Love the feel",

    "Lathers great and the scent is lovely. Not all DOVE soaps are created equally. This is but far one of the best.",

    "Smell is unappealing. Product feels dry and not softening like other dive bar soaps. Has been relegated to basement laundry sink for dirty hand washing. Very disappointed in product",

    "The item arrived on time, in perfect condition. I haven't noticed a big difference in my skin from use, but I haven't used it long enough, I'll give it more time. I am loving the smell, and ease of use. I would recommend to others",

    "I have always loved Dove but I wanted to try something different than the original bar. So I gave this a try and I love it. The smell is so good you can smell it through the box without opening it. I opened one but the other three are still in their boxes and My whole upstairs smells like Dove. The light but long lasting smell is what I need. And it doesn't disappoints.  Try it out.",

    "Love this soap. It's the right price for what I wanted. Cost a lot more in the store.",

    "Love it, thks",

    "Smells gooooood and soft",

    "Perfect for the winter and very cold air.",

    "As expected.",

    "Leaves your skin so soft and smooth",

    "smells great, leaves u feeling soft",

    "Very Good on your skin, will not feel dry,",

    "love it.",

    "Love the smell! My hands feel so soft!",

    "This soap is very moisturizing, it doesn't leave a sticky residue, and it smells really good. I will be using this one for a long time.",

    "okay",

    "Far too aromatic for my taste.  I cancelled my subscribe-and-save orer for this soap and am seeking a replacement, as \"flowery-smelling\" shea butter is the last thing I want to be using.",

    "Great",

    "Leaves your skin feeling soft.",

    "No good",

    "Love the scent",

    "Love this stuff, keeps my skin soft especially during the dry winter months. My only beef is they seem to dissolve kind of fast.",

    "Love this steamer. My only criticism would be the height. I wish it were a little taller for long items like dresses.",

    "I've tried other soaps has a nice clean smell and so far I love the way my skin feels after use.",

    "This soap smells great and feels lovely on the skin! The price point is good compared to other soaps.",

    "The soap is good Dove quality, but the vanilla smell I was hoping for is not here. It is rather a strong smelling perfumy smell - like laundry detergent almost? In any case, I don't really care for it as a result. Makes me clean though!",

    "We have very hard water and it causes my daughter to feel dry and itchy after she showers. This is the only soap that helps stop her from being uncomfortable after showering. The scent doesn't overpower. It's nice and subtle and pleasant, too.",

    "I love dove and this smells amazing.",

    "Works as listed",

    "Love Dove. Hard to find with Vanilla scent. This was closest I could find. Nice for layering my Vanilla/Coconut scents to.",

    "great smell and moisturized skin. I do like this soap.",

    "I'm a first-time buyer of Dove Shea Butter.  I am impressed and really loving it.  It has a pleasant scent and really leaves my skin soft.  Will definitely buy this again.",

    "Smells good, but Walmart has it cheaper for 6 bars.i paid 6.+ dollars at Walmart.",

    "LOVE IT.",

    "For the price can't beat it",

    "Bought this for my wife smells good",

    "the smell of it is nice....i like the shea butter ..and it smell great!",

    "I would buy this brand and type of bar soap again. Very rich and creamy; hydrate nicely.",

    "Skin smells nice",

    "Phenomenal. Smells great.",

    "Smells really good!",

    "I have very sensitive skin so Dove soap is a product I can always trust however this Nourishing Care with Sheabutter is more like a dessert for my skin and senses! It's nice because usually with skin as sensitive as mine everything either is unscented or has a medicinal smell to it but this smells good enough to eat! Rinses clean, leaves no residual ick, makes my skin glow!",

    "perfect for home use and terribly inexpensive .",

    "very good",

    "Leaves my skin clean and soft.",

    "what can i say? it's soap. flavor smells nice and feels good.",

    "Great for hydrating really dry skin. I still need to use lotion when I get out of the shower but my skin no longer feels/looks extremely dehydrated after bathing. Smells light so I can still use scented deodorant and perfume every day and not be suffocating to those around me.",

    "Substantial soap provides nice lather. Skin feels fine after use of soap.",

    "nice soap",

    "i like it",

    "Love scent of this bar of soap",

    "Wonderful.",

    "We love dove soap, so glad it can now be delivered to our door step",

    "I only use Dove soap and this is my favorite.",

    "I Love it!",

    "Takes care of dry skin, lathers well and rinses off with no residue",

    "Good soap",

    "would buy again",

    "One of my favorite Dove beauty bars. Its fragrance lingers on the skin, after getting out of the shower and leaves your skin very soft.",

    "It smells great, priced well and leaves my skin feeling moisturized.\nI have had dry sensitive skin my entire life, other than the Aveeno and St. Ives products this only thing that does't wreak havoc on my skin after a shower. I also apply Aveeno daily moisturizing lotion (or generic) after and I'm good to go!",

    "I can feel the difference between this Shea Butter soap and my other soaps. It feels richer on the skin and does feel moist. I have some dark scars that look like they are fading. I also use raw shea butter on my skin which is what prompted me to buy this soap.",

    "Good deal",

    "Leaves my skin soft, pleasant scent!",

    "This is my first time buying this product and I will buy it again! Great for my skin",

    "I love and use Dove soap everyday so I thought I would give this soap a try. Buyer beware!!! This soap stinks so bad it literally is giving me a headache. All I have done is opened the box, I have not even used it yet. Unfortunately it is going straight to the garbage.",

    "Great scent!",

    "ordered here bc much cheaper than Target in NYC.  Great quality will continue to order.",

    "Great item! Great price!",

    "Pleased with the foam and smoothness of the skin, but the scent plugged my nostrils and sinuses, with a burning feeling. Had to throw it away because it filled the room. Never had such a bad experience with any other kind of soap, shampoo or the like.",

    "Pretty good and moisturized soap. The price is reasonable as well.",

    "I'm very happy with the soap...",

    "Shea butter turns a ho hum shower into a silky tryst in a steamy waterfall. I love the smell and  the feel.",

    "Shea butter was nice and smells good too. Softens your skin.",

    "My least favorite smell out of all Dove products, but still pretty ok.\nLike all Dove soaps, much better than any others.\nMy skin only feels smooth with Dove.\nI swear I'm not getting paid for this.",

    "Good deal",

    "I had been a huge fan of bath and body, liquid soaps anything that had a fragrance. But as much as I liked it, my skin hated it! My skin had turned dry within the last few years so this winter took a huge toll on my skin. After being so uncomfortable and reading many reviews, I decided to buy this particular dove bar. I love this soap! The smell is light but delicious, it makes my skin moisturized. I love the shape of it and how it works to clean my curves. This is my favorite soap and I am so pleased with how soft my skin is. I definitely recommend going with bar soap. It lasts so much longer and if you would prefer a lather you can always use a loofa.",

    "Nice pack of soap. Great way to buy it. Love the smell and that its dove. I would buy again. I recommend this seller. Thanks, Dororhea Smith.",

    "i love dove soaps and other products",

    "Awesome shipping and great price",

    "Excellent\nBeen using for years and This was a great price",

    "Very good.",

    "love this soap",

    "good feeling",

    "Dove, Olay, and Jergens have fast become my \"go to\" soaps.  These are the only ones that seem to work on my sensitive skin without breaking it out. Although Dove is not cheap, if you can find it on sale through Subscribe & Save, it's definitely worth purchasing.",

    "my skin has gotten so much drier now that I have thyroid issues and this soap is awesomeI also have very sensitive skin as does my son and he really likes the soap as well it doesn't makr him iychy and it doesn't smell girly..it's a really good all-around soap we love you dove",

    "SUCH a strong floral scent!  Way too strong--beware--if you like UNscented--you will NOT like this soap!",

    "Nice scent, doesn't dry hands out.",

    "Smells great. Great price.",

    "mmmmm butter..........",

    "awesome product!",

    "Smells and lathers very well. Much better than the signature white dove soap if you ask me because of the lather and sweet smell.",

    "Love this scent ! Fast shipping , price was great !",

    "Dove, speaks for its self.",

    "smells nice, but pretty strong.  It feels good on the skin",

    "They smell amazing and leave your skin silky soft!",

    "This is my favorite soap. It smells so nice and the price was a quarter of what it costs in the stores.",

    "Bought these several times as very cheap add ons. They're very nice soap, though. Have a nice scent.",

    "This soap bar is AWESOME ! It wont leave residue on your skin and will moisturize! Also has a lovely scent",

    "I have very, very dry skin. This soup is wonderful. I also by Dover liquid soaps but to be honest, it's more for the dispenser in a shared bathroom. I have my own shower these days so I don't have to worry about who else has been handling the soap. That said, I'm able to realize this bar soap is as good as it gets for dry skin and cheaper then the liquid bottles.",

    "I use Dove soap exclusively. It is the most moisturizing. lathery soap I have tried. No heavy perfume scent, just refreshing and clean. Also great as a facial wash since it brings your pH to neutral (7). The shea butter is a treat in the colder months. In the winter I love to layer with body or shea butters after the shower. I also use the exfoliating and the white bar. The liquid body wash is also SO moisturizing.",

    "great buy",

    "One of the best bath soaps there is.",

    "you just can not beat Dove products",

    "Dove has been around as long as I can remember. For men, it is not the normal choice of soaps, I never cared for the smell or feel if I ever used it, so I probably have not bought it for 20+years. This offer came along as cheap add on, and it was a new variation of Dove, so I figured if I did not like it, I was out pocket change. This being the Shea Butter, it has a different smell which I find better than the original, it works OK and lasts as long as a regular bar of soap that I use. As I still have a few bars left, I do not know the regular price, and I would have to see if it is realistic if I were to think of rebuying the product.",

    "Great value!  Bought 8 packs this year and won't need more for another year!",

    "We use these soap bars for bathing. The shea butter ones do have somewhat of a strong odor, but we don't mind it. With highly sensitive and dry skin, these soap bars work out pretty good. They don't make the skin feel soapy after rinsing, which I like. However these bars do dissolve pretty easily, so we usually run out of a bar within 20 to 30 days.",

    "Love it! I love dice because it does not leave my skin too dry, it is soft and got it for a killer deal!",

    "Love Shea butter and Dove's soap is nice and creamy, smooth also use the Dove Shea butter for shower, and the Dove Shea butter lotion.",

    "I love this!",

    "Good soap.  Dove is always a winner.  I like the sensitive skin one better, though.",

    "Smells sooo good!!",

    "I love Dove soaps because I grew up with them.  My mom started us on it's use when we were teenagers.  I love the Shea Butter because it is so soothing on my face.",

    "So nice, finally I can use soap that leaves my skin moistured",

    "PERFECT",

    "GREAT LATHER LEAVE SKIN SMOOTH AND FRESH.",

    "A deal that I would rarely find in my local stores (unless there's a special sale going on).  Unfortunately this soap is now unavailable in this packaging (8pk).",

    "Great Deal for a Great product. Soft and smells great!",

    "Just like any other Dove product, leaves your skin smooth, healthy looking and duly moisturized.  Even though it costs more than the average bar soap, it is more than worth it.",

    "When I wash with the shea butter Dove soap, my skin feels so smooth and luxurious.  Even when I dry off, I feel as if I am wrapped in silken sheets, lounging on a fainting couch, with several gorgeous men fanning me and feeding me grapes.  Ok, that may be a tiny overstatement, but nevertheless my skin loves it!",

    "I love the smell, enough to mention it.  I just think I would prefer larger bars, but that's my fault.",

    "I always use dove for my face, rather than facial washes which always gives me some kind of reaction, and this one smells very nice. The Shea Butter is a plus too.",

    "What do you say about bars of soap? It's good stuff...I love dove, it does what it is supposed to do!",

    "This stuff not only smells great, but moisturized as it goes. It has a very pleasant smell and I think I found a soap for life. I have sensitive skin and this stuff doesn't bother at all... give it a shot!",

    "This has the \"Hawaiian Tropic\" kind of smell, so you can almost pretend you're in Hawaii while taking a shower/ bath, if you close your eyes.  I have noticed my skin is softer.  I was using the Dove Exfoliating during the winter, but I think this will be my new summer soap. The only con is that the smell doesn't last long.  The Men's Dove products, which my husband uses, seem to last longer than the women's scents.",

    "These are sooooooo nice! :)))  Lovely to use and do exactly and precisely what Dove says this soap will do.  Moisturizing, lovely soft scent, lasts very well in the bath. Highly recommend.",

    "I love regular old white Dove and have used it for many years, but I truly hate this Shea butter variety! It stinks up the entire bathroom. I bought 8 bars and might give the rest to the thrift shop just to get them out of my house.",

    "The vanilla fragrance is unpleasant and smells artificial.  Also, the soap is not as moisturizing for my skin as I had anticipated. I'm disappointed since I bought 8 bars",

    "I have sensitive skin, especially with sulfate, so I can't use a lot of liquid soaps. I wad originally using the glycerin based Neutrogena bar on my face but found it to be too drying, so I decided to try using dove on my face since my doc had prescribed it in the past to help me cope with my skin issues. I was disappointed to find the new formula isn't as moisturizing as it used to be. I used it for a while though because it was still better than the glycerin bar, then I found this Shea butter version. Shea butter had always been a huge hit with my skin, so I gave it a try. I love the scent, and it's not irritating. The Shea butter is very soothing and moisturizing, and overall this version is a lot closer to the original dove formula than the supposed original now days is. My skin always has just the right amount of moisture afterwards and feels smooth and refreshed. I'm going to try this with my son's eczema as well and see if it helps him. Btw, you can avoid it melting away on you so quickly by keeping it as dry as possible. Don't keep it in your bathroom, the humidity will even affect its staying power. I learned this a long time ago with the original formula. It soaks up any humidity it's exposed to and this makes it a lot softer so when you use it you use more than intended... that's how it goes so fast.",

    "I like the soap very much, because it doesn't dry my skin and I don't break out from it. The smell is pleasant, but I still prefer the orginal scent. Still, it's nice to try this for a change of pace.",

    "I have used Caress for years but recently tried this Dove Shea Butter Bar and very happy with it.  It lathers up well and a comfortable shape to hold and apply to the body.  I may be a long time user of this Dove bar.",

    "Dove makes great products, the shea butter bar is one of the best we have tried. And yes it does not dry skin like soap, this is a regular soap in our household. While occasionally we try out other soaps as well.",

    "Like all Dove variations, seems to moisturize better, or at least not rob my skin of moisture in the shower. My favorite is the Winter Care, but they all work well and prevent dry skin when it's dry out and the heat's running.",

    "dove always feels great and my wife and i prefer it especially since it does not leave any residue like other brands.",

    "This is a great value for the price. Great buy and will continue to purchase as long as it's available.",

    "I AM SATISFIED AS USUAL WITH THIS BAR BUT ENJOY THE winter DOVE FOR WINTER SEASONS WHICH IS HARD TO FIND. THIS IS WHY OUR DOVE SHEA BAR IS YEAR ROUND FOR OUR HOUSE. JUST IN CASE!",

    "I really like Dove soap, especially the Shea Butter variety.  I think the soap is very moisturizing and non-irritating to the skin.  This was a good price and it arrived right away.",

    "The shea butter from Dove is a good product to use and good for those who may not want to wear cologne all the time. The natural scent works just as fine.",

    "A great soap. I love it and so do my daughters. Can't keep enough in the house. Dove is wonderful",

    "Dove is the best! Great ingredients. Great lather you feel beautiful and clean also soft and smooth after every use of this soap!",

    "I did not realize there was so much perfume in these bars.  Unfortunately we cannot use these in our home.",

    "I like using dove soap because it creates enough moisture and suds that I don't need to use shaving cream. The Shea Butter bar has a nice smell that is not overly perfumy so my boyfriend feels comfortable using it as well.",

    "I can only use Dove soap due to my overly sensitive skin.  I tend to use this scent in the fall/winter, and the added cocoa butter gives a bit more moisture.  Wonderful product for people who get irritated by soap easily.",

    "Stopped buying when we found out that Dove tests on animals...There's plenty of great soaps out there that don't & we choose to buy those.",

    "My family loves it!  I'v used Dove for years, but the shea butter has become a favorite choice for all of us.",

    "Love this product is helps with dry ski and sensitive skin i would recommend this to everyone and it has a good scente.",

    "I have really missed my Dove Nutrium bar. Tried the body wash version - yuk! Not near what the bar was\nNoticed this and thought I would give it a try and I LOVE IT!  Nice fragrance and NO dry skin!",

    "Smells good but needs more vanilla. A bit more drying then some of doves other bars. I do like how clean it smells and feels, though.",

    "The bars dissolve too quickly for the price that they cost. We find that liquid soap is more value for the money.",

    "I do like this Shea Butter beauty bar, but find I like the normal Dove soap just as well.  I thought maybe the shea butter style would give me more moisture, but the regular soap works, too.  If you like Dove products, then give this a try.  Otherwise, I would stick to the usual Dove soap.",

    "I included this in my Subscribe & Save so that I can get it automatically delivered every once in a while. Both my wife and I like the Dove body soaps - but this one is our favorite. The smell is light and pleasant. The clean feeling after this soap is as expected. What's not to like?",

    "I wish I had bough a two pack of this soap from a b&m but,with the coupon the 15% off with subscribe & save the cost was about the same as a two pack in my local b&m. The smell is overwhelming in addition the soap it's not pleasant or as moisturizing\nas other dove bar soap.",

    "Dove has always been my favorie soap. I usually get plain or the pink. This one has a nice smell, but the smell wears off as the bar gets smaller.",

    "While sometimes I indulge in a body wash when I really want to coordinate scents, I love the ease and simplicity of using Dove soaps. I'm a fan of their exfoliating bars, but this bar strikes a perfect balance, leaving you feeling clean without being overly dry, moisturized without being greasy. It lathers easily and quite nicely, thoroughly cleansing without the need for a heavy scrub.\nI love this scent. It's a noticeable freshness, especially when layering with other shea or vanilla scents, but it still registers as a very neutral tone and effortlessly coordinates with other perfumes all along the spectrum. It holds up well without being overwhelming or off-putting, even if you don't shower daily.\nMy only complaint is that this bar seems to shrink more quickly than other Dove bars that I've used in the past. This is a minor concern, however, as purchasing a pack like this saves money and gives you more time before needing to restock.",

    "Moved to Oregon from North Carolina. I've never lived out of the South and the dry air kicked my butt this winter. It might rain all the time in the, but there is no humidity to speak of EVER. This soap in conjunction with Vaseline Intensive Care CocoaRadiant has left my skin barely itchy and NEVER visibly dry.",

    "YOU CANT GO WRONG WITH DOVE...PERIOD...MY FAMILY HAS ALWAYS LOVED IT...GREAT PRODUCT...THE ONLY SOAP THAT COMPARES FOR THIS PRICE IS \"TONE\" WITH SHEA BUTTER",

    "I have been a Dove user for years, then I tried the shea butter bar from amazon. It feels even better on the skin than the regular dove. I don't care much for fragrance on most things and usually buy unscented. These have a pleasant scent that isn't too overpowering for me. The guys in my family even use the Dove over their he-man shower gel. I will continue to buy and highly recommend it. I use much less lotion after showering since using this product.",

    "i love dove products. this soap doesnt make my skin feel dried out and stretched when im out of the shower. it smells good and cleans great. all my makeup comes off of my face the first wash, and my body feel refreshed. this is my favorite bar soap from",

    "I got this product because I suffer from dry skin and was hoping it would help with the dryness.  I can say that it does help somewhat with the dry skin; much better than any other soap I've tried.  I also love the smell.  This was an added bonus.  It leave the bathroom smelling fresh and clean long after you shower.  I would certainly buy this product again.",

    "These Shea Butter beauty bars smell absolutely amazing! My skin is always soft and I always smell nice for an hour or two after showering. I like that the smell lingers for a while. Shea Butter is also great for your skin!",

    "I love Dove soap and could not find this one with shea in local groceries. The shea really has made a difference and my skin is not as dry, especially during colder months.",

    "This shea butter soap has a pleasant scent of shea butter and almost puts me in the mind of cashmere.  The soap does not leave a lot of reside in the bath tub and doesn't make my skin feel extremely dry after use.  Unlike the commercial, you will need to apply some type of moisturizer after use, but again it does not dry out your skin more than any other soap.  Good for men or women, but if Amazon sells it for more than $8.50, buy it from your local dollar store instead.",

    "This is a great product.  People with chronic allergies and sinus may be sensitive to the Shea butter in the product initially. The Shea butter in this product has a moisturizing effect.  I recommend this produce especially persons with dry skin and eczema.",

    "this soap I have been using for many years, in my country it's sold but it's smaller I love the actual size",

    "I bought the Shea Butter Dove because I love the Dove for winter.  Not as good but I like it.  The winter bars works on my skin a lot better.",

    "This is great soap, especially for a guy. This soap really makes you feel clean and refreshed. I love this soap.",

    "great moisturizing effect..doves products are really great when it comes to moisturizing...i use different options since you get generally bored using the same one....a little women fragrance though!",

    "This is a very subjective item to review. Everyone has their own preferences in the types of soaps and lotions that they prefer. But in my opinion, the original Dove soap is the best. All of the others, shea butter, mens formulas, lotions, seem to be riding the coat tails of the original. None of the other products even come close. Here's why, the original is rich and creamy with a pleasant fragrance and it leaves your skin highly moisturized. The other products all have some of the characteristics of the original but not the whole package. Some moisturize well while other lather well....stick with the original.",

    "I developed a rash over most of my body from swimming in the ocean, called swimmers itch. I tried most everything to heal it, but finally discovered that regular use of shea butter soap calmed the rash and soothed my skin without having to use a steroid cream.  I now use it every day, even if I don't have that skin disorder, and it makes the skin feel and look good.",

    "I subscribed to the shea beauty bar and am now down to almost none in less than a month!\nThis soap is milled differently than the other varieties and I suppose this is why it melts away so fast.\nAlso if you live in an area with hard water it could waste your soap too but to get back to the good things about the item\nI would say that it does what it claims --- softens the skin. I cannot find this variety in more than the 4-pack so was surprised\nto see that Amazon offered double.",

    "... strong scent and product not exactly as described. I like Dove soap because it's a non-drying, no residue, pleasant smelling, inexpensive hand soap and felt like a change from my usual Dove pink. I read some reviews for this shea butter kind and I wasn't put off by the fact that I might recieve the vanilla scent version instead of the basic (which I did). I wouldn't order this again because the scent is just ok, and stronger than I was expecting from a Dove soap. It scented the bedroom that adjoins the bathroom and I can easily imagine that if you washed your whole body or your face with this soap it would be overwhelming. I won't suffer using this up, but I'm going back to Dove pink.",

    "I love cocoa butter lotion and dove soap. saw the two combined together and decided to try it love it love it. will be purchasing again it leave your skin feeling soft and clean. also like dove nutrium cream oil soap but have been unable to find it",

    "I have extremely sensitive skin as I was recently diagnosed with psoriasis.  I've been on the hunt for a nice smelling soap that won't irritate the skin.  I was already a fan of Dove soap, but I love the smell of shea butter.  Accidentally saw this and had to try it.  I just love it and will continue to buy this for the whole family from now on.\nI'm honestly not sure why people are saying it's too much of a perfume smell.  The smell is the best part.  It's a light scent, not overbearing and the entire family can use it.  The price is great too!  I highly recommend it.",

    "I bought a 6 or 8 pack of this because it was on sale, and now I practically do not know what to do with them. The fragrance of the so called shea butter is quite intense. It is for an acquired taste to say the least.\nAs for women who use this, i would rather recomment a plain white, sensitive skin or at least a cucumber dove bar instead, especially in the bikini area.\nAgain, I cannot stress enough how overpowering and unnatural the smell of this bar is.",

    "I love the scent of this shea butter bar. There is nothing out there quite like  this. It moisturizes great and leaves my skin soft and smooth and smelling great. I wish the shea butter lotion that Dove makes smelled as good as the bar. Would be great for a nice layered scent oh well...",

    "I absolutely adore this soap. Its the only bar soap you will find in my house. The scent is beyond amazing and it leaves my skin soft and smelling wonderful!!! My entire family uses it down to my husband. When someone is in the shower, the scent of the soap fills my house. When my sister was in the hospital I went and helped her shower. I brought her a fresh bar of this soap to use. When the nurses came in to check on her after, they were asking what she used. They said she smelled delightful. I told them all about it and showed them the box. They said they were going to get some ASAP! Thanks Dove for another amazing product! Please don't quit making it!!!",

    "I love this Nourishing Care Shea Butter soap by Dove! It smells great, is not overpowering, it's refreshing and long lasting... And it makes my skin so soft! My new addiction!",

    "I like this Dove shea butter soap so much and I liked the price I have paid for it.\nDove really lives up to its name and it performs very well for my skin, which can be quite dry at times. It has a very nice scent and lathers up really well and rinses off even better, like the commercial says it does not leave you feeling dry and tight. I like it and highly recommend this for all skin types and genders. One other thing I cannot find this in my community at this price, so I will keep buying it as long as it is available.",

    "what can go wrong with Dove soap. Amazon has the best price compare to other retailer, I did go to local retail store and did a calculation with my phone and find out how much each cost plus tax. Amazon still is the cheapest. so I brought it from amazon, delivery within 2 day with my amazon prime",

    "Very good product I am pleased. I'm sure I may be able to find the product at a dicounted price some place else. But other then that good product.",

    "This soap is the greatest bar soap that i have ever used. It leaves my skin feeling great. Cant go wrong with this product. Dove is the best and this fragrance is fantastic. Great price at amazon.",

    "everything i expect out of soap. keeps me and my family clean, so people don't run away from us, thank you dove! keep the bars rolling.",

    "The bars I received were weirdly cut and mis-shaped.  The scent is fine and over the last few years, the Dove products have definitely improved in quality. I haven't repurchased these particular ones, as I am currently on a grapefruit scent kick. But, I would purchase the Shea butter a second time.",

    "I absolutely love this soap!!  Normally I use Body Wash but decided to give this soap a try when I found it in a grocery store that slashed their prices because they are going out of business.  I am very pleased with this soap.  Lathers up so rich and creamy and smells so nice.  Skin feels silky soft after my shower.  Dove makes such awesome products.  Their soaps are just like creamy lotion; you'd never know it was bar soap because most bar soaps are so drying.  Nothing compares with Dove.  I highly recommend this soap...its wonderful!!",

    "I love this soap and can no longer find it in a store close by...nice to know I can order it from Amazon.",

    "MY FAMILY AND I LOVE THIS SOAP!!! IT GLIDES ON JUST LIKE BUTTER!! MY FAMILY HAVE VERY SENSITIVE SKIN AND THIS IS THE ONLY SOAP I CAN USE ON MY BABIES!!!",

    "This soap smells wonderful and has a creamy-like feel to it, but after using it for about 3-5days it began to irritate my skin and often left me feeling itchy all over.  Great effort but far from natural.",

    "I pretty much love all the Dove products so when I noticed Dove incorporated Shea Butter I just had to try it.  The scent is clean although it may leave a little something to be desired, but it is a nice gentle cleanser, especially if your skin may be a little irritated from harsher perfumed products."

  ]}